<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">

<!--Converted with jLaTeX2HTML 2002 (1.62) JA patch-1.4
patched version by:  Kenshi Muto, Debian Project.
LaTeX2HTML 2002 (1.62),
original version by:  Nikos Drakos, CBLU, University of Leeds
* revised and updated by:  Marcus Hennecke, Ross Moore, Herb Swan
* with significant contributions from:
  Jens Lippmann, Marek Rouchal, Martin Wilck and others -->
<HTML>
<HEAD>
<TITLE>Ficheros de Dispositivos de Carácter</TITLE>
<META NAME="description" CONTENT="Ficheros de Dispositivos de Carácter">
<META NAME="keywords" CONTENT="progmodlinux">
<META NAME="resource-type" CONTENT="document">
<META NAME="distribution" CONTENT="global">

<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<META NAME="Generator" CONTENT="jLaTeX2HTML v2002 JA patch-1.4">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">

<LINK REL="STYLESHEET" HREF="progmodlinux.css">

<LINK REL="next" HREF="node16.html">
<LINK REL="previous" HREF="node11.html">
<LINK REL="up" HREF="progmodlinux.html">
<LINK REL="next" HREF="node15.html">
</HEAD>

<BODY >
<!--Navigation Panel-->
<A NAME="tex2html643"
  HREF="node15.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next"
 SRC="file:/usr/share/latex2html/icons/next.png"></A> 
<A NAME="tex2html637"
  HREF="progmodlinux.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up"
 SRC="file:/usr/share/latex2html/icons/up.png"></A> 
<A NAME="tex2html631"
  HREF="node13.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous"
 SRC="file:/usr/share/latex2html/icons/prev.png"></A> 
<A NAME="tex2html639"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents"
 SRC="file:/usr/share/latex2html/icons/contents.png"></A> 
<A NAME="tex2html641"
  HREF="node35.html">
<IMG WIDTH="43" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="index"
 SRC="file:/usr/share/latex2html/icons/index.png"></A> 
<BR>
<B> Next:</B> <A NAME="tex2html644"
  HREF="node15.html">Múltiples Versiones de Ficheros</A>
<B> Up:</B> <A NAME="tex2html638"
  HREF="progmodlinux.html">Gu&#237;a de Programaci&#243;n de</A>
<B> Previous:</B> <A NAME="tex2html632"
  HREF="node13.html">Multiples Ficheros de Módulos</A>
 &nbsp <B>  <A NAME="tex2html640"
  HREF="node1.html">Contents</A></B> 
 &nbsp <B>  <A NAME="tex2html642"
  HREF="node35.html">Index</A></B> 
<BR>
<BR>
<!--End of Navigation Panel-->

<H1><A NAME="SECTION00400000000000000000"></A><A NAME="char-dev-file"></A>
<BR>
Ficheros de Dispositivos de Car&#225;cter
</H1><A NAME="263"></A><A NAME="264"></A><A NAME="265"></A>

<P>
De este modo, ahora somos valientes programadores del n&#250;cleo y sabemos 
como escribir m&#243;dulos  que no hacen nada. Nos sentimos bien
con nosotros mismos y mantenemos  nuestros corazones en tensi&#243;n. Pero
de alg&#250;n modo sentimos que falta algo. Los m&#243;dulos catat&#243;nicos no son muy
divertidos. 

<P>
Hay dos formas principales para que un m&#243;dulo del n&#250;cleo se comunique con
los procesos. Uno es a trav&#233;s de los ficheros de dispositivos (como los
ficheros en el directorio <TT>/dev</TT>, la otra es usar el sistema de ficheros 
proc. Porque uno de los principales motivos para escribir algo en el n&#250;cleo
es soportar alg&#250;n tipo de dispositivo hardware, empezaremos con los
ficheros de dispositivos<A NAME="267"></A>.

<P>
El prop&#243;sito original de los ficheros de dispositivo es permitir a los
procesos comunicarse con los controladores de dispositivos en el n&#250;cleo, 
y atrav&#233;s de ellos con los dispositivos f&#237;sicos (modems, terminales, etc.).
La forma en la que esto es implementado es la 
siguiente<A NAME="268"></A><A NAME="269"></A><A NAME="270"></A><A NAME="271"></A><A NAME="272"></A>.

<P>
Cada controlador de dispositivo, el cual es resposable de alg&#250;n tipo
de hardware, es asignado a su propio n&#250;mero mayor. La lista de los controladores
y de sus n&#250;meros mayores est&#225; disponible en <TT>/proc/devices</TT>. Cada dispositivo
f&#237;sico administrado por un controlador de dispositivo es asignado a un n&#250;mero menor.
El directorio <TT>/dev</TT> se supone que incluye un fichero especial, llamado
fichero de dispositivo, para cada uno de estos dispositivos, tanto si est&#225; o no 
realmente instalado en el sistema<A NAME="275"></A><A NAME="276"></A><A NAME="277"></A><A NAME="278"></A><A NAME="279"></A><A NAME="280"></A><A NAME="281"></A><A NAME="282"></A>.

<P>
Por ejemplo, si haces <TT>ls -l /dev/hd[ab]*</TT>, ver&#225;s todas las particiones
de discos duros IDE que quiz&#225;s est&#233;n conectadas a una m&#225;quina. Nota que
todos ellos usan el mismo n&#250;mero mayor, 3, pero el n&#250;mero menor cambia de uno
a otro <EM>Nota: Esto asume que est&#225;s usando una arquitectura PC. No se
como son conocidos otros dispositivos en Linux ejecut&#225;ndose en otras arquitecturas</EM>.<A NAME="285"></A><A NAME="286"></A><A NAME="287"></A><A NAME="288"></A><A NAME="289"></A><A NAME="290"></A>

<P>
Cuando tu sistema fue instalado, todos esos ficheros de dispositivos fueron
creados por el comando <TT>mknod</TT>. No existe un motivo t&#233;cnico por el cual
tienen que estar en el directorio <TT>/dev</TT>, es s&#243;lo una convenci&#243;n &#250;til.
Cuando creamos un fichero de dispositivo con el prop&#243;sito de prueba, como aqu&#237;
para un ejercicio, probablemente tenga m&#225;s sentido colocarlo en el directorio
en donde compilas el m&#243;dulo del n&#250;cleo<A NAME="293"></A><A NAME="294"></A>.

<P>
Los dispositivos est&#225;n divididos en dos tipos: los dispositivos de car&#225;cter
y los dispositivos de bloque. La diferecncia es que los dispositivos de
bloque tienen un buffer para las peticiones, por lo tanto
pueden escoger en qu&#233; orden las van a responder. Esto es importante
en el caso de los dispositivos de almacenamiento, donde es m&#225;s r&#225;pido leer
o escribir sectores que est&#225;n cerca entre si, que aquellos
que est&#225;n m&#225;s desperdigados. Otra diferencia es que los dispositivos de
bloque s&#243;lo pueden aceptar bloques de entrada y de salida (cuyo tama&#241;o
puede variar de acuerdo al dispositivo), en cambio los dispositivos
de car&#225;cter pueden usar muchos o unos pocos bytes como ellos quieran.
La mayor&#237;a de los dispositivos en el mundo son de car&#225;cter, porque
no necesitan este tipo de <I>buffering</I>, y no operan con un tama&#241;o de
bloque fijo. Se puede saber cuando un fichero de dispositivo es para un
dispositivo de car&#225;cter o de bloque mirando el primer car&#225;cter en
la salida de <TT>ls -l</TT>. Si es `b'  entonces es un dispositivo de bloque,
y si es `c' es un dispositivo de car&#225;cter.<A NAME="297"></A><A NAME="298"></A><A NAME="299"></A><A NAME="300"></A><A NAME="301"></A><A NAME="302"></A>

<P>
Este m&#243;dulo est&#225; dividido en dos partes separadas: La parte del m&#243;dulo
que registra el dispositivo y la parte del controlador del dispositivo. La
funci&#243;n <TT>init_module</TT> llama a <TT>module_register_chrdev</TT> para
a&#241;adir el controlador de dispositivo a la tabla de controladores de 
dispositivos de car&#225;cter del n&#250;cleo. Tambi&#233;n retorna el n&#250;mero mayor
a ser usado por el controlador. La funci&#243;n <TT>cleanup_module</TT>
libera el dispositivo<A NAME="306"></A><A NAME="307"></A><A NAME="308"></A><A NAME="309"></A>.

<P>
Esto (registrar y liberar algo) es la funcionalidad general
de estas dos funciones. Las cosas en el n&#250;cleo no funcionan por
su propia iniciativa, como los procesos, sino que son llamados, por
procesos a trav&#233;s de las llamadas al sistema, o por los dispositivos
hardware a trav&#233;s de las interrupciones, o por otras partes
del n&#250;cleo (simplemente llamando a funciones espec&#237;ficas). Como 
resultado, cuando a&#241;ades c&#243;digo al n&#250;cleo, se supone que es
para registrarlo como parte de un manejador o para un cierto tipo
de evento y cuando lo quitas, se supone que lo liberas<A NAME="310"></A><A NAME="311"></A><A NAME="312"></A><A NAME="313"></A>.

<P>
El controlador del dispositivo se compone de cuatro funciones
device_<IMG
 WIDTH="16" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="img1.png"
 ALT="$&lt;$">acci&#243;n<IMG
 WIDTH="16" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="img2.png"
 ALT="$&gt;$">, que son llamadas cuando alguien intenta
hacer algo con un fichero de dispositivo con nuestro n&#250;mero mayor. La
forma en la que el n&#250;cleo sabe como llamarlas es a trav&#233;s de la estructura
<TT>file_operations</TT>, <TT>Fops</TT>, la cual se di&#243; cuando el
dispositivo fue registrado, e incluye punteros a esas
cuatro funciones<A NAME="316"></A><A NAME="317"></A>.

<P>
Otro punto que necesitamos recordar aqu&#237; es que podemos permitir que 
el m&#243;dulo del n&#250;cleo sea borrado cuando <I>root quiera</I>. El motivo es que
si el fichero del dispositivo es abierto por un proceso y entonces quitamos
el m&#243;dulo del n&#250;cleo, el uso del fichero causar&#237;a una llamada a la posici&#243;n
de memoria donde la funci&#243;n apropiada (read/write) usada tendr&#237;a que estar. 
Si tenemos suerte, ning&#250;n otro c&#243;digo fue cargado all&#237;, y obtendremos
un feo mensaje. Si no tenemos suerta, otro m&#243;dulo del n&#250;cleo fue cargado 
en la misma posici&#243;n, lo que significar&#225; un salto en el medio de
otra funci&#243;n del n&#250;cleo. El resultado ser&#237;a imposible de predecir, pero
no ser&#237;a positivo<A NAME="319"></A>.

<P>
Normalmente, cuando no quieres permitir algo, devuelves un c&#243;digo 
de error (un n&#250;mero negativo) desde la funci&#243;n que se supone que
lo tendr&#237;a que hacer. Con  <TT>cleanup_module</TT> esto es imposible porque
es una funci&#243;n void. Una vez que se llama a <TT>cleanup_module</TT>, el m&#243;dulo
est&#225; muerto. En todo caso, hay un contador que cuenta cuantos otros m&#243;dulos
del n&#250;cleo estan usando el m&#243;dulo, llamado contador de referencia (que es 
el &#250;ltimo n&#250;mero de la linea en <TT>/proc/modules</TT>). Si este n&#250;mero no es cero, 
<TT>rmmod</TT> fallar&#225;. La cuenta de referencia del m&#243;dulo est&#225; disponible en la
variable <TT>mod_use_count_</TT>. Como hay macros definidas para manejar esta
variable (<TT>MOD_INC_USE_COUNT</TT> y <TT>MOD_DEC_USE_COUNT</TT>), 
preferimos usarlas, mejor que usar <TT>mod_use_count_</TT> directamente, por
lo tanto ser&#225; m&#225;s seguro si la implementaci&#243;n cambia en el futuro.<A NAME="328"></A><A NAME="329"></A><A NAME="330"></A><A NAME="331"></A><A NAME="332"></A><A NAME="333"></A>

<P>
ex

<FONT SIZE="+1"><B>chardev.c</B></FONT>
<A NAME="338"></A><A NAME="339"></A><A NAME="340"></A>

<P>
<PRE>
/* chardev.c 
 * Copyright (C) 1998-1999 by Ori Pomerantz
 * 
 * Crea un dispositivo de carácter (sólo lectura)
 */

/* Los ficheros de cabeceras necesarios */

/* Estándar en los módulos del núcleo */
#include &lt;linux/kernel.h&gt;   /* Estamos haciendo trabajo del núcleo */
#include &lt;linux/module.h&gt;   /* Específicamente, un módulo */

/* Distribuido con CONFIG_MODVERSIONS */
#if CONFIG_MODVERSIONS==1
#define MODVERSIONS
#include &lt;linux/modversions.h&gt;
#endif        

/* Para dispositivos de carácter */
#include &lt;linux/fs.h&gt;       /* Las definiciones de dispositivos 
                             * de carácter están aquí */
#include &lt;linux/wrapper.h&gt;  /* Un envoltorio que 
                             * no hace nada actualmente,
                             * pero que quizás ayude para
                             * compatibilizar con futuras
                             * versiones de Linux */


/* En 2.2.3 /usr/include/linux/version.h incluye
 * una macro para esto, pero 2.0.35 no lo hace - por lo 
 * tanto lo añado aquí si es necesario */
#ifndef KERNEL_VERSION
#define KERNEL_VERSION(a,b,c) ((a)*65536+(b)*256+(c))
#endif


/* Compilación condicional. LINUX_VERSION_CODE es
 * el código (como KERNEL_VERSION) de esta versión */
#if LINUX_VERSION_CODE &gt; KERNEL_VERSION(2,2,0)
#include &lt;asm/uaccess.h&gt;  /* for put_user */
#endif

			     

#define SUCCESS 0


/* Declaraciones de Dispositivo **************************** */

/* El nombre de nuestro dispositivo, tal como aparecerá 
 * en /proc/devices */
#define DEVICE_NAME "char_dev"


/* La máxima longitud del mensaje desde el dispositivo */
#define BUF_LEN 80

/* ¿Está el dispositivo abierto correctamente ahora? Usado para 
 * prevenir el acceso concurrente en el mismo dispositivo */
static int Device_Open = 0;

/* El mensaje que el dispositivo dará cuando preguntemos */
static char Message[BUF_LEN];

/* ¿Cuánto más tiene que coger el proceso durante la lectura?
 * Útil si el mensaje es más grande que el tamaño
 * del buffer que cogemos para rellenar en device_read. */ 
static char *Message_Ptr;


/* Esta función es llamada cuando un proceso
 * intenta abrir el fichero del dispositivo */
static int device_open(struct inode *inode, 
		       struct file *file)
{
  static int counter = 0;

#ifdef DEBUG
  printk ("Dispositivo abierto(%p,%p)\n", inode, file);
#endif

  /* Esto es como coger el número menor del dispositivo
   * en el caso de que tengas más de un dispositivo físico
   * usando el controlador */
  printk("Dispositivo: %d.%d\n", 
	 inode-&gt;i_rdev &gt;&gt; 8, inode-&gt;i_rdev &amp; 0xFF);

  /* No queremos que dos procesos hablen al mismo tiempo */
  if (Device_Open)
    return -EBUSY;

  /* Si había un proceso, tendremos que tener más
   * cuidado aquí.
   *
   * En el caso de procesos, el peligro es que un 
   * proceso quizás esté chequeando Device_Open y
   * entonces sea reemplazado por el planificador por otro
   * proceso que ejecuta esta función. Cuando
   * el primer proceso regrese a la CPU, asumirá que el
   * dispositivo no está abierto todavía.
   *
   * De todas formas, Linux garantiza que un proceso no
   * será reemplazado mientras se está ejecutando en el
   * contexto del núcleo.
   *
   * En el caso de SMP, una CPU quizás incremente
   * Device_Open mientras otra CPU está aquí, correcto
   * después de chequear. De todas formas, en la versión
   * 2.0 del núcleo esto no es un problema por que hay un
   * cierre que garantiza que sólamente una CPU estará en
   * el módulo del núcleo en un mismo instante. Esto es malo
   * en términos de rendimiento, por lo tanto la versión 2.2
   * lo cambió. Desgraciadamente, no tengo acceso a un 
   * equipo SMP para comprobar si funciona con SMP.
   */

  Device_Open++;

  /* Inicializa el mensaje. */
  sprintf(Message, 
    "Si te lo dije una vez, te lo digo %d veces - %s",
    counter++,
    "Hola, mundo\n");
  /* El único motivo por el que se nos permite hacer este
   * sprintf es porque la máxima longitud del mensaje
   * (asumiendo enteros de 32 bits - hasta 10 dígitos 
   * con el signo menos) es menor que BUF_LEN, el cual es 80.
   * ¡¡TEN CUIDADO NO HAGAS DESBORDAMIENTO DE PILA EN LOS BUFFERS,
   * ESPECIALMENTE EN EL NÚCLEO!!! */

  Message_Ptr = Message;

  /* Nos aseguramos de que el módulo no es borrado mientras
   * el fichero está abierto incrementando el contador de uso
   * (el número de referencias abiertas al módulo, si no es
   * cero rmmod fallará) */
  MOD_INC_USE_COUNT;

  return SUCCESS;
}


/* Esta función es llamada cuando un proceso cierra el
 * fichero del dispositivo. No tiene un valor de retorno en
 * la versión 2.0.x porque no puede fallar (SIEMPRE debes de ser
 * capaz de cerrar un dispositivo). En la versión 2.2.x
 * está permitido que falle - pero no le dejaremos. */

#if LINUX_VERSION_CODE &gt;= KERNEL_VERSION(2,2,0)
static int device_release(struct inode *inode, 
			  struct file *file)
#else 
static void device_release(struct inode *inode, 
			   struct file *file)
#endif
{
#ifdef DEBUG
  printk ("dispositivo_liberado(%p,%p)\n", inode, file);
#endif
 
  /* Ahora estamos listos para la siguiente petición*/
  Device_Open --;

  /* Decrementamos el contador de uso, en otro caso una vez que
   * hayas abierto el fichero no volverás a coger el módulo.
   */
  MOD_DEC_USE_COUNT;

#if LINUX_VERSION_CODE &gt;= KERNEL_VERSION(2,2,0)
  return 0;
#endif
}


/* Esta función es llamada cuando un proceso que ya
 * ha abierto el fichero del dispositivo intenta leer de él. */

#if LINUX_VERSION_CODE &gt;= KERNEL_VERSION(2,2,0)
static ssize_t device_read(struct file *file,
    char *buffer,    /* El buffer a rellenar con los datos */
    size_t length,   /* La longitud del buffer */
    loff_t *offset)  /* Nuestro desplazamiento en el fichero */
#else
static int device_read(struct inode *inode,
                       struct file *file,
    char *buffer,   /* El buffer para rellenar con 
		     * los datos */ 
    int length)     /* La longitud del buffer 
                     * (¡no debemos escribir más allá de él!) */
#endif
{
  /* Número de bytes actualmente escritos en el buffer */
  int bytes_read = 0;

  /* si estamos al final del mensaje, devolvemos 0 
   * (lo cual significa el final del fichero) */
  if (*Message_Ptr == 0)
    return 0;

  /* Ponemos los datos en el buffer */
  while (length &amp;&amp; *Message_Ptr)  {

    /* Porque el buffer está en el segmento de datos del usuario
     * y no en el segmento de datos del núcleo, la asignación
     * no funcionará. En vez de eso, tenemos que usar put_user,
     * el cual copia datos desde el segmento de datos del núcleo
     * al segmento de datos del usuario. */
    put_user(*(Message_Ptr++), buffer++);


    length --;
    bytes_read ++;
  }

#ifdef DEBUG
   printk ("%d bytes leidos, quedan %d\n",
     bytes_read, length);
#endif

   /* Las funciones de lectura se supone que devuelven el
    * número de bytes realmente insertados en el buffer */
  return bytes_read;
}




/* Se llama a esta función cuando alguien intenta escribir
 * en nuestro fichero de dispositivo - no soportado en este
 * ejemplo. */
#if LINUX_VERSION_CODE &gt;= KERNEL_VERSION(2,2,0)
static ssize_t device_write(struct file *file,
    const char *buffer,    /* El buffer */
    size_t length,   /* La longitud del buffer */
    loff_t *offset)  /* Nuestro desplazamiento en el fichero */
#else
static int device_write(struct inode *inode,
                        struct file *file,
                        const char *buffer,
                        int length)
#endif
{
  return -EINVAL;
}




/* Declaraciones del Módulo ***************************** */

/* El número mayor para el dispositivo. Esto es
 * global (bueno, estático, que en este contexto es global
 * dentro de este fichero) porque tiene que ser accesible
 * para el registro y para la liberación. */
static int Major;

/* Esta estructura mantendrá las funciones que son llamadas
 * cuando un proceso hace algo al dispositivo que nosotros creamos.
 * Ya que un puntero a esta estructura se mantiene en
 * la tabla de dispositivos, no puede ser local a
 * init_module. NULL es para funciones no implementadas. */

struct file_operations Fops = {
  NULL,   /* búsqueda */
  device_read, 
  device_write,
  NULL,   /* readdir */
  NULL,   /* seleccionar */
  NULL,   /* ioctl */
  NULL,   /* mmap */
  device_open,
#if LINUX_VERSION_CODE &gt;= KERNEL_VERSION(2,2,0)
  NULL,   /* borrar */
#endif
  device_release  /* a.k.a. cerrar */
};


/* Inicializa el módulo - Registra el dispositivo de carácter */
int init_module()
{
  /* Registra el dispositivo de carácter (por lo menos lo intenta) */
  Major = module_register_chrdev(0, 
                                 DEVICE_NAME,
                                 &amp;Fops);

  /* Valores negativos significan un error */
  if (Major &lt; 0) {
    printk ("dispositivo %s falló con %d\n",
	    "Lo siento, registrando el carácter",
	    Major);
    return Major;
  }

  printk ("%s El número mayor del dispositivo es %d.\n",
          "El registro es un éxito.",
          Major);
  printk ("si quieres hablar con el controlador del dispositivo,\n");
  printk ("tendrás que crear un fichero de dispositivo. \n");
  printk ("Te sugerimos que uses:\n");
  printk ("mknod &lt;nombre&gt; c %d &lt;menor&gt;\n", Major);
  printk ("Puedes probar diferentes números menores %s",
          "y ver que pasa.\n");

  return 0;
}


/* Limpieza - liberamos el fichero correspondiente desde /proc */
void cleanup_module()
{
  int ret;

  /* liberamos el dispositivo */
  ret = module_unregister_chrdev(Major, DEVICE_NAME);
 
  /* Si hay un error, lo indicamos */ 
  if (ret &lt; 0)
    printk("Error en unregister_chrdev: %d\n", ret);
}
</PRE>

<P>
<BR><HR>
<!--Table of Child-Links-->
<A NAME="CHILD_LINKS"><STRONG>Subsections</STRONG></A>

<UL>
<LI><A NAME="tex2html645"
  HREF="node15.html">Múltiples Versiones de Ficheros Fuente del Núcleo</A>
</UL>
<!--End of Table of Child-Links-->
<HR>
<!--Navigation Panel-->
<A NAME="tex2html643"
  HREF="node15.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next"
 SRC="file:/usr/share/latex2html/icons/next.png"></A> 
<A NAME="tex2html637"
  HREF="progmodlinux.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up"
 SRC="file:/usr/share/latex2html/icons/up.png"></A> 
<A NAME="tex2html631"
  HREF="node13.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous"
 SRC="file:/usr/share/latex2html/icons/prev.png"></A> 
<A NAME="tex2html639"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents"
 SRC="file:/usr/share/latex2html/icons/contents.png"></A> 
<A NAME="tex2html641"
  HREF="node35.html">
<IMG WIDTH="43" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="index"
 SRC="file:/usr/share/latex2html/icons/index.png"></A> 
<BR>
<B> Next:</B> <A NAME="tex2html644"
  HREF="node15.html">Múltiples Versiones de Ficheros</A>
<B> Up:</B> <A NAME="tex2html638"
  HREF="progmodlinux.html">Gu&#237;a de Programaci&#243;n de</A>
<B> Previous:</B> <A NAME="tex2html632"
  HREF="node13.html">Multiples Ficheros de Módulos</A>
 &nbsp <B>  <A NAME="tex2html640"
  HREF="node1.html">Contents</A></B> 
 &nbsp <B>  <A NAME="tex2html642"
  HREF="node35.html">Index</A></B> 
<!--End of Navigation Panel-->
<ADDRESS>
Ismael Olea
2002-09-22
</ADDRESS>
</BODY>
</HTML>
