<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">

<!--Converted with jLaTeX2HTML 2002 (1.62) JA patch-1.4
patched version by:  Kenshi Muto, Debian Project.
LaTeX2HTML 2002 (1.62),
original version by:  Nikos Drakos, CBLU, University of Leeds
* revised and updated by:  Marcus Hennecke, Ross Moore, Herb Swan
* with significant contributions from:
  Jens Lippmann, Marek Rouchal, Martin Wilck and others -->
<HTML>
<HEAD>
<TITLE>Llamadas al Sistema</TITLE>
<META NAME="description" CONTENT="Llamadas al Sistema">
<META NAME="keywords" CONTENT="progmodlinux">
<META NAME="resource-type" CONTENT="document">
<META NAME="distribution" CONTENT="global">

<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<META NAME="Generator" CONTENT="jLaTeX2HTML v2002 JA patch-1.4">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">

<LINK REL="STYLESHEET" HREF="progmodlinux.css">

<LINK REL="next" HREF="node21.html">
<LINK REL="previous" HREF="node19.html">
<LINK REL="up" HREF="progmodlinux.html">
<LINK REL="next" HREF="node21.html">
</HEAD>

<BODY >
<!--Navigation Panel-->
<A NAME="tex2html726"
  HREF="node21.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next"
 SRC="file:/usr/share/latex2html/icons/next.png"></A> 
<A NAME="tex2html720"
  HREF="progmodlinux.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up"
 SRC="file:/usr/share/latex2html/icons/up.png"></A> 
<A NAME="tex2html714"
  HREF="node19.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous"
 SRC="file:/usr/share/latex2html/icons/prev.png"></A> 
<A NAME="tex2html722"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents"
 SRC="file:/usr/share/latex2html/icons/contents.png"></A> 
<A NAME="tex2html724"
  HREF="node35.html">
<IMG WIDTH="43" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="index"
 SRC="file:/usr/share/latex2html/icons/index.png"></A> 
<BR>
<B> Next:</B> <A NAME="tex2html727"
  HREF="node21.html">Procesos Bloqueantes</A>
<B> Up:</B> <A NAME="tex2html721"
  HREF="progmodlinux.html">Gu&#237;a de Programaci&#243;n de</A>
<B> Previous:</B> <A NAME="tex2html715"
  HREF="node19.html">Parámetros de Inicio</A>
 &nbsp <B>  <A NAME="tex2html723"
  HREF="node1.html">Contents</A></B> 
 &nbsp <B>  <A NAME="tex2html725"
  HREF="node35.html">Index</A></B> 
<BR>
<BR>
<!--End of Navigation Panel-->

<H1><A NAME="SECTION00900000000000000000"></A><A NAME="sys-call"></A>
<BR>
Llamadas al Sistema
</H1><A NAME="564"></A><A NAME="565"></A><A NAME="566"></A>

<P>
Hasta hace poco, la &#250;nica cosa que hemos hecho era usar mecanismos bien
definidos del n&#250;cleo para registrar ficheros <TT>proc</TT> y manejadores de 
dispositivos. Esto est&#225; bien si quieres hacer algo a trav&#233;s de lo que
los programadores del n&#250;cleo quisieran, tal como escribir un 
controlador de dispositivo. Pero, &#191;y si quieres escribir algo inusual, para
cambiar el comportamiento del sistema de alguna forma? Entonces, te
encuentras s&#243;lo.

<P>
Aqu&#237; es d&#243;nde la programaci&#243;n del n&#250;cleo se vuelve peligrosa. 
Escribiendo el ejemplo siguiente eliminamos la llamada al sistema <TT>open</TT>.
Esto significa que no podr&#237;a abrir ning&#250;n fichero, no podr&#237;a ejecutar
ning&#250;n programa, y no podr&#237;a <TT>apagar</TT> la computadora. Tengo que pulsar
el interruptor. Afortun&#225;damente, no se muere ning&#250;n fichero. Para asegurarse
de que no pierdes ning&#250;n fichero, por favor ejecuta <TT>sync</TT> correctamente 
antes de hacer el <TT>insmod</TT> y el <TT>rmmod</TT><A NAME="573"></A><A NAME="574"></A><A NAME="575"></A><A NAME="576"></A>.

<P>
Olv&#237;date de los ficheros <TT>/proc</TT>, olv&#237;date de los ficheros de los dispositivos.
Son s&#243;lo detalles menores. El mecanismo <EM>real</EM> de comunicaci&#243;n entre
los procesos y el n&#250;cleo, el que es usado por todos los procesos, son las
llamadas al sistema. Cuando un proceso pide un servicio al n&#250;cleo (tal como
abrir un fichero, duplicarse en un nuevo proceso, o pedir m&#225;s memoria), este es
el mecanismo usado. Si quieres cambiar el comportamiento del n&#250;cleo de
formas interesantes, este es el sitio para hacerlo.  Si quieres saber
ver qu&#233; llamadas al sistema usa un programa, ejecuta 
<TT>strace <IMG
 WIDTH="10" HEIGHT="31" ALIGN="MIDDLE" BORDER="0"
 SRC="img4.png"
 ALT="$\langle$">comando<IMG
 WIDTH="10" HEIGHT="31" ALIGN="MIDDLE" BORDER="0"
 SRC="img5.png"
 ALT="$\rangle$"> <IMG
 WIDTH="10" HEIGHT="31" ALIGN="MIDDLE" BORDER="0"
 SRC="img4.png"
 ALT="$\langle$">argumentos<IMG
 WIDTH="10" HEIGHT="31" ALIGN="MIDDLE" BORDER="0"
 SRC="img5.png"
 ALT="$\rangle$"></TT><A NAME="583"></A>.

<P>
En general, un proceso no se supone que pueda acceder al n&#250;cleo. No
puede acceder a la memoria del n&#250;cleo y no puede llamar a las funciones del
n&#250;cleo. El hardware de la CPU fuerza esto (este es el motivo por el que
es llamado `modo protegido').
Las llamadas al sistema son una excepci&#243;n a esta regla general. Lo que sucede
es que el proceso rellena los registros con los valores apropiados y entonces
llama a una instrucci&#243;n especial, la cual salta a una posici&#243;n previamente
definida en el n&#250;cleo (por supuesto, la posici&#243;n es le&#237;ble por los procesos
de usuario, pero no se puede escribir en ella). Bajo las CPUs Intel, esto es realizado por
medio de la interrupci&#243;n 0x80.
El hardware sabe que una vez que saltas a esta localizaci&#243;n, no te estar&#225;s 
ejecutando m&#225;s en modo usuario restringido, pero s&#237; como n&#250;cleo del sistema
operativo -- y entonces se te permite hacer todo lo que quieras<A NAME="584"></A>.

<P>
A la posici&#243;n en el n&#250;cleo a la que un proceso puede saltar es llamada <TT>system_call</TT>.
El procedimiento en la posici&#243;n verifica el n&#250;mero de la llamada al sistema, 
el cual dice al n&#250;cleo qu&#233; servicio ha pedido el proceso. Entonces, mira
en la tabla de llamadas al sistema (<TT>sys_call_table</TT>) para ver la direcci&#243;n
de la funci&#243;n del n&#250;cleo a llamar. A continuaci&#243;n llama a la funci&#243;n, y despu&#233;s
retorna, hace unos pocos chequeos del sistema y regresa al proceso (o a un
proceso diferente, si el tiempo del proceso ha finalizado). Si quieres leer
este c&#243;digo, est&#225; en el fichero fuente <TT>arch/<IMG
 WIDTH="16" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="img1.png"
 ALT="$&lt;$">architecture<IMG
 WIDTH="16" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="img2.png"
 ALT="$&gt;$">/kernel/entry.S</TT>, 
despu&#233;s de la linea <TT>ENTRY(system_call)</TT><A NAME="589"></A><A NAME="590"></A><A NAME="591"></A><A NAME="592"></A>.

<P>
Por lo tanto, si queremos cambiar la forma en la que una cierta llamada al
sistema trabaja, lo que necesitamos hacer es escribir nuestra propia 
funci&#243;n para implementarla (usualmente a&#241;adiendo un poco de nuestro
c&#243;digo) y entonces cambiar el puntero en <TT>sys_call_table</TT> para
que apunte a nuestra funci&#243;n. Porque quiz&#225;s la borremos despu&#233;s y no queremos 
dejar el sistema en un estado inestable, es importante que <TT>cleanup_module</TT>
restaure la tabla a su estado original.

<P>
El c&#243;digo fuente aqu&#237; es un ejemplo de un m&#243;dulo del n&#250;cleo. Queremos
`espiar' a un cierto usuario, e imprimir un mensaje (con printk) cuando el
usuario abra un fichero. Hasta aqu&#237;, nosotros reemplazamos la llamada
al sistema para abrir un fichero con nuestra propia funci&#243;n, llamada <TT>our_sys_open</TT>.
Esta funci&#243;n verifica el uid (identificaci&#243;n del usuario) del proceso actual, y
si es igual al uid lo espiamos, llamando a <TT>printk</TT> para mostrar el nombre
del fichero a ser abierto. Entonces, de todas formas, llama
a la funci&#243;n original <TT>open</TT> con los mismos par&#225;metros, para
realmente abrir el fichero<A NAME="598"></A><A NAME="599"></A>.

<P>
La funci&#243;n <TT>init_module</TT> reemplaza la localizaci&#243;n apropiada en
<TT>sys_call_table</TT> y mantiene el puntero original en una variable
para restaurar todo cuando regresemos a la normalidad. Esta aproximaci&#243;n
es peligrosa, por la posibilidad de que dos m&#243;dulos del n&#250;cleo
cambien la misma llamada al sistema. Imag&#237;nate que tenemos dos m&#243;dulos
del n&#250;cleo, A y B. La llamada al sistema de A ser&#225; A_open y la llamada
al sistema de B ser&#225; B_open. Ahora, cuando A est&#225; insertada en el n&#250;cleo, la
llamada al sistema es reemplazada con A_open, la cual llamar&#225; a la 
sys_open original cuando est&#233; hecho. A continuaci&#243;n, B es insertado en 
el n&#250;cleo, el cual reemplaza la llamada al sistema con B_open, que ejecutar&#225;
la llamada al sistema que &#233;l piensa que es la original, A_open, cuando est&#233; hecho. 

<P>
Ahora, si B se quita primero, todo estar&#225; bien -- simplemente
restaurar&#225; la llamada al sistema a A_open, la cual llamar&#225; a la
original. En cambio, si se quita A  y  despu&#233;s se quita B, el
sistema se caer&#225;. El borrado de A restaurar&#225; la llamada al sistema original,
sys_open, sacando a B fuera del bucle. Entonces, cuando B es borrado, se restaura
la llamada al sistema que <B>&#233;l</B> piensa que es la original, A_open, la cual
no est&#225; m&#225;s en memoria. A primera vista, parece que podemos resolver
este problema particular verificando si la llamada al sistema es igual
a nuestra funci&#243;n open y si lo es no cambi&#225;ndola (por lo
tanto B no cambiar&#225; la llamada al sistema cuando es borrado), lo
que causar&#225; un problema peor. Cuando A es borrado, a &#233;l le parece que la
llamada al sistema fue cambiada a B_open y por lo tanto no apuntar&#225; m&#225;s a
A_open, y por lo tanto no la restaurar&#225; a sys_open antes de que
sea borrado de memoria. Desgraciadamente, B_open a&#250;n intentar&#225; llamar a
A_open la cual no estar&#225; mas all&#237;, por lo que incluso sin quitar B 
el sistema se caer&#225;.

<P>
Pienso en dos formas de prevenir este problema. El primero es restaurar
la llamada al valor original, sys_open. Desgraciadamente, sys_open no es
parte de la tabla del sistema del n&#250;cleo en <TT>/proc/ksyms</TT>, por lo tanto
no podemos acceder a ella. La otra soluci&#243;n es usar un contador de referencias
para prevenir que root borre el m&#243;dulo una vez que est&#225; cargado. Esto es
bueno para la producci&#243;n de m&#243;dulos, pero malo para un ejemplo
de aprendizaje -- que es por lo que no lo hice aqu&#237;<A NAME="604"></A><A NAME="605"></A><A NAME="606"></A>.

<P>
ex

<FONT SIZE="+1"><B>syscall.c</B></FONT>
<A NAME="611"></A><A NAME="612"></A><A NAME="613"></A>

<P>
<PRE>
/* syscall.c 
 * 
 * Ejemplo de llamada al sistema "robando" 
 */


/* Copyright (C) 1998-99 por Ori Pomerantz */


/* Los ficheros de cabeceras necesarios */

/* Estándar en los módulos del núcleo */
#include &lt;linux/kernel.h&gt;   /* Estamos haciendo trabajo del núcleo */
#include &lt;linux/module.h&gt;   /* Específicamente, un módulo */

/* Distribuido con CONFIG_MODVERSIONS */
#if CONFIG_MODVERSIONS==1
#define MODVERSIONS
#include &lt;linux/modversions.h&gt;
#endif        

#include &lt;sys/syscall.h&gt;  /* La lista de llamadas al sistema */

/* Para el actual estructura (proceso), necesitamos esto
 * para conocer quién es el usuario actual. */
#include &lt;linux/sched.h&gt;  




/* En 2.2.3 /usr/include/linux/version.h se incluye
 * una macro para esto, pero 2.0.35 no lo hace - por lo
 * tanto lo añado aquí si es necesario */
#ifndef KERNEL_VERSION
#define KERNEL_VERSION(a,b,c) ((a)*65536+(b)*256+(c))
#endif



#if LINUX_VERSION_CODE &gt;= KERNEL_VERSION(2,2,0)
#include &lt;asm/uaccess.h&gt;
#endif



/* La tabla de llamadas al sistema (una tabla de funciones).
 * Nosotros justamente definimos esto como externo, y el
 * núcleo lo rellenerá para nosotros cuando instalemos el módulo
 */
extern void *sys_call_table[];


/* UID que queremos espiar - será rellenado desde la
 * linea de comandos */
int uid;  

#if LINUX_VERSION_CODE &gt;= KERNEL_VERSION(2,2,0)
MODULE_PARM(uid, "i");
#endif

/* Un puntero a la llamada al sistema original. El motivo para
 * mantener esto, mejor que llamar a la función original
 * (sys_open), es que alguien quizás haya reemplazado la 
 * llamada al sistema antes que nosotros. Destacar que esto
 * no es seguro al 100%, porque si otro módulo reemplaza sys_open
 * antes que nosotros, entonces cuando insertemos llamaremos 
 * a la función en ese módulo - y quizás sea borrado
 * antes que nosotros.
 *
 * Otro motivo para esto es que no podemos tener sys_open.
 * Es una variable estática, por lo tanto no es exportada. */
asmlinkage int (*original_call)(const char *, int, int);



/* Por algún motivo, en 2.2.3 current-uid me da cero, en vez de
 * la ID real del usuario. He intentado encontrar dónde viene mal,
 * pero no lo he podido hacer en un breve periodo de tiempo, y 
 * soy vago - por lo tanto usaremos la llamada al sistema para 
 * obtener el uid, de la forma que un proceso lo haría.
 *
 * Por algún motivo, después de que recompilara el núcleo este
 * problema se ha ido.
 */
asmlinkage int (*getuid_call)();



/* La función con la que reemplazaremos sys_open (la
 * función llamada cuando llamas a la llamada al sistema open).
 * Para encontrar el prototipo exacto, con el número y tipo de
 * argumentos, encontramos primero la función original (es en
 * fs/open.c).
 *
 * En teoría, esto significa que estamos enlazados a la versión
 * actual del núcleo. En la práctica, las llamadas al sistema nunca
 * cambian (se destruirían naufragando y requerirían que los programas
 * fuesen recompilados, ya que las llamadas al sistema son las 
 * interfaces entre el núcleo y los procesos).
 */
asmlinkage int our_sys_open(const char *filename, 
                            int flags, 
                            int mode)
{
  int i = 0;
  char ch;

  /* Checkea si este es el usuario que estamos espiando */
  if (uid == getuid_call()) {  
   /* getuid_call es la llamada al sistema getuid,
    * la cual nos da el uid del usuario que ejecutó
    * el proceso que llamó a la llamada al sistema
    * que tenemos. */

    /* Indica el fichero, si es relevante */
    printk("Fichero abierto por %d: ", uid); 
    do {
#if LINUX_VERSION_CODE &gt;= KERNEL_VERSION(2,2,0)
      get_user(ch, filename+i);
#else
      ch = get_user(filename+i);
#endif
      i++;
      printk("%c", ch);
    } while (ch != 0);
    printk("\n");
  }

  /* Llamamos a la sys_open original - en otro caso, perdemos
   * la habilidad para abrir ficheros */
  return original_call(filename, flags, mode);
}



/* Inicializa el módulo - reemplaza la llamada al sistema */
int init_module()
{
  /* Peligro - muy tarde para él ahora, pero quizás 
   * la próxima vez... */
  printk("Soy peligroso. Espero que hayas hecho un ");
  printk("sync antes de insertarme.\n");
  printk("Mi duplicado, cleanup_module(), es todavía"); 
  printk("más peligroso. Si\n");
  printk("valoras tu sistema de ficheros, será mejor ");
  printk("que hagas \"sync; rmmod\" \n");
  printk("cuando borres este módulo.\n");

  /* Mantiene un puntero a la función original en
   * original_call, y entonces reemplaza la llamada al sistema
   * en la tabla de llamadas al sistema con our_sys_open */
  original_call = sys_call_table[__NR_open];
  sys_call_table[__NR_open] = our_sys_open;

  /* Para obtener la dirección de la función para la
   * llamada al sistema foo, va a sys_call_table[__NR_foo]. */

  printk("Espiando el UID:%d\n", uid);

  /* Coje la llamada al sistema para getuid */
  getuid_call = sys_call_table[__NR_getuid];

  return 0;
}


/* Limpieza - libera el fichero apropiado de /proc */
void cleanup_module()
{
  /* Retorna la llamada al sistema a la normalidad */
  if (sys_call_table[__NR_open] != our_sys_open) {
    printk("Alguien más jugó con la llamada al sistema ");
    printk("open\n");
    printk("El sistema quizás haya sido dejado ");
    printk("en un estado iniestable.\n");
  }

  sys_call_table[__NR_open] = original_call;
}
</PRE>

<P>
<HR>
<!--Navigation Panel-->
<A NAME="tex2html726"
  HREF="node21.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next"
 SRC="file:/usr/share/latex2html/icons/next.png"></A> 
<A NAME="tex2html720"
  HREF="progmodlinux.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up"
 SRC="file:/usr/share/latex2html/icons/up.png"></A> 
<A NAME="tex2html714"
  HREF="node19.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous"
 SRC="file:/usr/share/latex2html/icons/prev.png"></A> 
<A NAME="tex2html722"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents"
 SRC="file:/usr/share/latex2html/icons/contents.png"></A> 
<A NAME="tex2html724"
  HREF="node35.html">
<IMG WIDTH="43" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="index"
 SRC="file:/usr/share/latex2html/icons/index.png"></A> 
<BR>
<B> Next:</B> <A NAME="tex2html727"
  HREF="node21.html">Procesos Bloqueantes</A>
<B> Up:</B> <A NAME="tex2html721"
  HREF="progmodlinux.html">Gu&#237;a de Programaci&#243;n de</A>
<B> Previous:</B> <A NAME="tex2html715"
  HREF="node19.html">Parámetros de Inicio</A>
 &nbsp <B>  <A NAME="tex2html723"
  HREF="node1.html">Contents</A></B> 
 &nbsp <B>  <A NAME="tex2html725"
  HREF="node35.html">Index</A></B> 
<!--End of Navigation Panel-->
<ADDRESS>
Ismael Olea
2002-09-22
</ADDRESS>
</BODY>
</HTML>
