<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">

<!--Converted with jLaTeX2HTML 2002 (1.62) JA patch-1.4
patched version by:  Kenshi Muto, Debian Project.
LaTeX2HTML 2002 (1.62),
original version by:  Nikos Drakos, CBLU, University of Leeds
* revised and updated by:  Marcus Hennecke, Ross Moore, Herb Swan
* with significant contributions from:
  Jens Lippmann, Marek Rouchal, Martin Wilck and others -->
<HTML>
<HEAD>
<TITLE>Manejadores de Interrupciones</TITLE>
<META NAME="description" CONTENT="Manejadores de Interrupciones">
<META NAME="keywords" CONTENT="progmodlinux">
<META NAME="resource-type" CONTENT="document">
<META NAME="distribution" CONTENT="global">

<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<META NAME="Generator" CONTENT="jLaTeX2HTML v2002 JA patch-1.4">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">

<LINK REL="STYLESHEET" HREF="progmodlinux.css">

<LINK REL="next" HREF="node26.html">
<LINK REL="previous" HREF="node23.html">
<LINK REL="up" HREF="progmodlinux.html">
<LINK REL="next" HREF="node25.html">
</HEAD>

<BODY >
<!--Navigation Panel-->
<A NAME="tex2html782"
  HREF="node25.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next"
 SRC="file:/usr/share/latex2html/icons/next.png"></A> 
<A NAME="tex2html776"
  HREF="progmodlinux.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up"
 SRC="file:/usr/share/latex2html/icons/up.png"></A> 
<A NAME="tex2html770"
  HREF="node23.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous"
 SRC="file:/usr/share/latex2html/icons/prev.png"></A> 
<A NAME="tex2html778"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents"
 SRC="file:/usr/share/latex2html/icons/contents.png"></A> 
<A NAME="tex2html780"
  HREF="node35.html">
<IMG WIDTH="43" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="index"
 SRC="file:/usr/share/latex2html/icons/index.png"></A> 
<BR>
<B> Next:</B> <A NAME="tex2html783"
  HREF="node25.html">Teclados en la Arquitectura</A>
<B> Up:</B> <A NAME="tex2html777"
  HREF="progmodlinux.html">Gu&#237;a de Programaci&#243;n de</A>
<B> Previous:</B> <A NAME="tex2html771"
  HREF="node23.html">Planificando Tareas</A>
 &nbsp <B>  <A NAME="tex2html779"
  HREF="node1.html">Contents</A></B> 
 &nbsp <B>  <A NAME="tex2html781"
  HREF="node35.html">Index</A></B> 
<BR>
<BR>
<!--End of Navigation Panel-->

<H1><A NAME="SECTION001300000000000000000"></A><A NAME="int-handler"></A>
<BR>
Manejadores de Interrupciones
</H1><A NAME="740"></A><A NAME="741"></A><A NAME="742"></A>

<P>
Excepto para el &#250;ltimo cap&#237;tulo, todo lo que hicimos en el n&#250;cleo lo
hemos hecho como respuesta a un proceso preguntando por &#233;l, bien tratando
con un fichero especial, enviando un <TT>ioctl</TT>, o a trav&#233;s de una llamada
al sistema. Pero el trabajo del n&#250;cleo no es s&#243;lo responder a las peticiones
de los procesos. Otro trabajo, que es un poco m&#225;s importante, es hablar
con el hardware conectado a la m&#225;quina.

<P>
Hay dos tipos de interacci&#243;n entre la CPU y el resto del hardware de la
computadora. El primer tipo es cuando la CPU da &#243;rdenes al hardware, el
el otro es cuando el hardware necesita decirle algo a la CPU.
La segunda, llamada interrupci&#243;n, es mucho m&#225;s dif&#237;cil de implementar
porque tiene que tratar con el hardware cuando sea conveniente, no la CPU. 
Los dispositivos hardware t&#237;picamente tienen una peque&#241;a cantidad de ram, y
si no quieres leer su informaci&#243;n cuando est&#225; disponible, se pierde.

<P>
Bajo Linux, las interrupciones hardware son llamadas IRQs (abreviatura para
<B>I</B>nterrupt <B>R</B>e<B>q</B>uests)<A NAME="tex2html292"
  HREF="footnode.html#foot747"><SUP>11.1</SUP></A>.  Hay dos tipos
de IRQs, peque&#241;as y grandes. Una IRQ peque&#241;a es una que se espera que dure un
<B>muy</B> corto periodo de tiempo, durante el cual el resto de la m&#225;quina ser&#225;
bloqueada y ninguna otra interrupci&#243;n ser&#225; manejada. Una IRQ grande es una que 
puede durar mucho, y durante la cual otras interrupciones pueden ocurrir (pero
no interrupciones desde el m&#237;smo dispositivo). Cuando sea posible, es mejor
declarar un manejador de interrupciones para que sea grande.

<P>
Cuando la CPU recibe una interrupci&#243;n, para lo que quiera que est&#233; haciendo
(a menos que se encuentre procesando una interrupci&#243;n m&#225;s prioritaria, en cuyo
caso tratar&#225; con esta interrupci&#243;n s&#243;lo cuando la m&#225;s prioritaria se haya
acabado), salva ciertos par&#225;metros en la pila y llama al manejador de interrupciones.
Esto significa que ciertas cosas no est&#225;n permitidas en un manejador de interrupciones
por si mismo, porque el sistema est&#225; en un estado indefinido. La soluci&#243;n a este
problema es que el manejador de interrupciones hace lo que necesite
hacer inmediatamente, usualmente leer algo desde el hardware o 
enviar algo al hardware, y entonces planificar el manejo de la nueva informaci&#243;n
en un tiempo posterior (esto se llama `bottom half') y retorna. El n&#250;cleo
est&#225; garantizado que llamar&#225; al bottom half tan pronto como sea posible -- y 
cuando lo es, todo lo que est&#225; permitido en los m&#243;dulos del n&#250;cleo ser&#225; 
permitido<A NAME="749"></A>.

<P>
La forma de implementar esto es llamar a <TT>request_irq</TT> para tener
un manejador de interrupciones preparado cuando la IRQ relevante es recibida
(hay 16 de ellas en las plataformas Intel). Esta funci&#243;n recibe el n&#250;mero
de IRQ, el nombre de la funci&#243;n, flags, un nombre para <TT>/proc/interrupts</TT>
y un par&#225;metro para pasarle al manejador de interrupciones. Las flags pueden
incluir <TT>SA_SHIRQ</TT> para indicar que est&#225;s permitiendo compartir la IRQ con
otro manejador de interrupciones (usualmente porque un n&#250;mero de dispositivos
hardware est&#225;n en la misma IRQ) y <TT>SA_INTERRUPT</TT> para indicar que
esta es una interrupci&#243;n r&#225;pida. Esta funci&#243;n s&#243;lo tendr&#225; &#233;xito si no hay ya
un manejador para esta IRQ, o si ya est&#225;s comparti&#233;ndola<A NAME="754"></A><A NAME="755"></A><A NAME="756"></A><A NAME="757"></A>.

<P>
Entonces, desde el manejador de interrupciones, nos comunicamos con 
el hardware y entonces usamos <TT>queue_task_irq</TT> con <TT>tq_immediate</TT>
y planificamos el bottom half. El motivo por el que no podemos usar
la <TT>queue_task</TT> est&#225;ndar en la versi&#243;n 2.0 es que la interrupci&#243;n
quiz&#225;s suceda en el medio de una <TT>queue_task</TT> de alguien
<A NAME="tex2html293"
  HREF="footnode.html#foot947"><SUP>11.2</SUP></A>. Necesitamos <TT>mark_bh</TT> porque en las primeras versiones de 
Linux s&#243;lo hab&#237;a un array de 32 bottom halves, y ahora uno de ellos 
(<TT>BH_IMMEDIATE</TT>) es usado para la lista enlazada de bottom halves de
los controladores que no tienen una entrada bottom half asignada<A NAME="767"></A><A NAME="768"></A><A NAME="769"></A><A NAME="770"></A><A NAME="771"></A>.

<P>
<BR><HR>
<!--Table of Child-Links-->
<A NAME="CHILD_LINKS"><STRONG>Subsections</STRONG></A>

<UL>
<LI><A NAME="tex2html784"
  HREF="node25.html">Teclados en la Arquitectura Intel</A>
</UL>
<!--End of Table of Child-Links-->
<HR>
<!--Navigation Panel-->
<A NAME="tex2html782"
  HREF="node25.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next"
 SRC="file:/usr/share/latex2html/icons/next.png"></A> 
<A NAME="tex2html776"
  HREF="progmodlinux.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up"
 SRC="file:/usr/share/latex2html/icons/up.png"></A> 
<A NAME="tex2html770"
  HREF="node23.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous"
 SRC="file:/usr/share/latex2html/icons/prev.png"></A> 
<A NAME="tex2html778"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents"
 SRC="file:/usr/share/latex2html/icons/contents.png"></A> 
<A NAME="tex2html780"
  HREF="node35.html">
<IMG WIDTH="43" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="index"
 SRC="file:/usr/share/latex2html/icons/index.png"></A> 
<BR>
<B> Next:</B> <A NAME="tex2html783"
  HREF="node25.html">Teclados en la Arquitectura</A>
<B> Up:</B> <A NAME="tex2html777"
  HREF="progmodlinux.html">Gu&#237;a de Programaci&#243;n de</A>
<B> Previous:</B> <A NAME="tex2html771"
  HREF="node23.html">Planificando Tareas</A>
 &nbsp <B>  <A NAME="tex2html779"
  HREF="node1.html">Contents</A></B> 
 &nbsp <B>  <A NAME="tex2html781"
  HREF="node35.html">Index</A></B> 
<!--End of Navigation Panel-->
<ADDRESS>
Ismael Olea
2002-09-22
</ADDRESS>
</BODY>
</HTML>
