<html>
<head>
<title> ODBC para Servidor de Bases de Datos PostGreSQL </title>
</head>
<body>
<hr>
<h1> ODBC para Servidor de Bases de Datos PostGreSQL ( II )</h1>
<p>
<b>Autor:</b> <a href="http://www.dit.upm.es/~jantonio">
	<i>Juan Antonio Martinez Casta&ntilde;o</i></a><br>
<b>E-mail:</b> <a href="mailto:jantonio@drake.dit.upm.es">
	<i> jantonio@drake.dit.upm.es</i></a><br>
<hr>
<p>
<a name="indice">
<h3><u> Indice:</u></h3>
<ol>
	<li><a href="#entradilla">Presentaci&oacute;n</a>
	<li><a href="#introduccion">Introducci&oacute;n</a>
	<li><a href="#odbc">Un primer paseo por el API ODBC</a>
	<li><a href="#iodbc">El API ODBC en Linux</a>
	<li><a href="#php">Un Ejemplo pr&aacute;ctico: PHP-3.0.1</a>
	<li><a href="#conclusion">Conclusiones</a>
	<li><a href="#referencias">Referencias</a>
</ol>
</a>
<hr>

<a name="entradilla">
<h3> <u>Presentaci&oacute;n</u> </h3>
</a>
Continuando con la serie sobre ODBC para Linux, describimos en este 
art&iacute;culo la instalaci&oacute;n de los diversos drivers del API ODBC
en nuestro sistema operativo favorito, Presentando como ejemplo de 
aplicaci&oacute;n el complemento ideal de todo gestor de bases de datos:
PHP-3.0.1
<p>
<hr>

<a name="introduccion">
<h3> <u>Introducci&oacute;n</u> </h3>
</a>

Antes de emprender la instalaci&oacute;n de ODBC es preciso aclarar algunos 
conceptos de funcionamiento del API de ODBC.
<p>
Como explicamos en el n&uacute;mero anterior de <b>Linux Actual</b>, ODBC es 
un API de interfaz entre clientes de bases de datos y servidores de bases 
de datos. La figura 1 ilustra este esquema: 
<p>
<table>
<tr><td>
<img src="odbc_api.gif" alt="Estructura del API ODBC" width="512" height="256">
</td</tr>
<tr><th>
figura 1: Estructura en capas del API ODBC
</th></tr>
</table>
<p>
La primera capa constituye la librer&iacute;a del API que utilizan las 
diversas aplicaciones que "hablan" ODBC. Microsoft proporciona para sus 
sistemas el fichero <i>ODBC32.DLL</i>, que contienen el API y el interfaz 
con el sistema operativo, permitiendo a los desarrolladores de controladores 
ODBC inclu&iacute;r dicha librer&iacute;a en sus distribuciones ( de la 
misma manera que para la DLL de controles Visual Basic VBRUN.DLL ). Para 
sistemas UNIX, el proyecto FreeODBC, ha desarrollado su propia librer&iacute;a 
GPL <i>libodbc.so.x.x</i> que es totalmente compatible con las especificaciones 
descritas por Microsoft 
<p>
El administrador de or&iacute;genes de datos es el responsable del "rutado" de
peticiones de ODBC desde la librer&iacute;a hasta los controladores. Para ello
se discriminan tres tipos de or&iacute;genes de datos: de usuario, de archivo 
y de sistema. Esta nomenclatura es motivo frecuente de confusi&oacute;n: cuando
desde Windows se abre desde el panel de control el men&uacute; de 
"controladores ODBC" se encuentra con esta clasificaci&oacute;n, y cuando 
abre cada una de las ventanas se encuentra con los mismos contenidos... 
Vamos a explicarlo un poco:
<ul>
<li> Los or&iacute;genes de datos de usuario, realmente se refieren a las 
  operaciones que realiza el usuario con su base de datos desde la 
  aplicaci&oacute;n nativa para la que han sido desarrollados, y sin 
  realizar ning&uacute;n tipo de compartici&oacute;n con otros usuarios. En 
  cristiano: cuando se trabaja con MS-Access, y no compartes la base de 
  datos ( en UNIX y en Win-NT esta disgresi&oacute;n tiene sentido; 
  en Win95 es cuando menos discutible ) 
<li> Cuando se comparte la base de datos mediante un servidor de ficheros 
  compartiendo f&iacute;sicamente los datos almacenados en un fichero 
  determinado hablamos de or&iacute;genes de datos de archivo. Este 
  m&eacute;todo permite, por ejemplo a un usuario de dBase manejar una 
  database de MS-Access, o bien que varios usuarios puedan compartir 
  una misma database
<li> Cuando no se comparte un fichero, sino que se trabaja con la database a
  trav&eacute;s de un sistema cliente-servidor, hablamos de un origen de 
  datos de sistema.
<li>Las aplicaciones ofim&aacute;ticas mas comunes, ofrecen drivers para 
  or&iacute;genes de datos de usuario y de archivo, para permitir a los 
  usuarios el poder trabajar, importar y exportar datos entre diversas 
  aplicaciones de gesti&oacute;n. Las aplicaciones de servidores de bases 
  de datos, por contra, proporcionan drivers para or&iacute;genes de datos 
  de sistema <br>
  <b>PostODBC</b> y los drivers de <b>PostGreSQL</b> para iODBC pertenecen a 
  esta &uacute;ltima categor&iacute;a
</ul>
<p>
Por &uacute;ltimo, cada origen de datos tiene asociado un controlador, 
que act&uacute;a de "pasarela" entre el API y el acceso f&iacute;sico a 
los datos
<p>
<hr>
<p>
<a name="odbc">
<h3><u> Un primer paseo por el API de ODBC</u></h3>
</a>
En el CD-Rom que acompa&ntilde;a a este n&uacute;mero de la revista se incluyen
bajo el directorio <i>iODBC-1.0</i> los ficheros correspondientes a la libreria 
ODBC para Linux, y los drivers ODBC para <b>PostGreSQL</b> y <b>MySQL</b>
bajo Linux. Descomprimamos el paquete, y echemos un vistazo a los ficheros 
<i>odbc_types.h </i> y <i>odbc_funcs.h</i>. Estos ficheros constiuyen el el 
interfaz del API ODBC tal como ha sido definido por Microsoft y definen la 
lista de funciones y definiciones que todo driver ODBC debe cumplir ( bien 
totalmente o en parte, en funci&oacute;n del nivel de conformidad del driver )
<p>
Del mismo modo, descomprimiendo los ficheros de la librer&iacute;a iODBC, se
obtienen los ficheros <i>isql.h</i> e <i>isqlext.h</i> que contienen las
definiciones de tipos de datos y los codigos de las diversas llamadas a la 
librer&iacute;a del API ODBC. 
<p>
Podemos observar que el API ODBC no es sino una llamada a una funci&oacute;n
de entrada, en la que, dependiendo de los par&aacute;metros especificados
se realizan unas u otras funciones. Se observa una correspondencia casi 
lineal entre los c&oacute;digos de entrada del API ODBC y las funciones 
definidas para el driver PostGreSQL. Esta correspondencia, que en Linux/UNIX 
es lineal, en sistemas MS-Windows "atraviesa" el sistema operativo (?) donde el
administrador de or&iacute;genes de datos redirecciona las peticiones a los 
diferentes drivers instalados.<br>
	En cambio, en Linux/UNIX, la misi&oacute;n del administrador de
or&iacute;genes de datos es realizada por la propia librer&iacute;a. Existe
para ello un fichero <i>iodbc.ini</i> donde se le especifican los drivers
y los modos de acceso. ¿ C&oacute;mo se realiza la conexi&oacute;n entre
el API y el driver?. Mediante un sistema de "dynamic loading" de los diversos
drivers de cada gestor de base de datos, en funci&oacute;n de las 
especificaciones del fichero <i>iodbc.ini</i>

<p>
<a name="iodbc">
<h3><u>El API de ODBC en Linux</u></h3>
</a>
<p>
Llegados a este punto preguntamos: ¿Cómo funciona de cara al programador
la librer&iacute;a ODBC?. La respuesta es rid&iacute;culamente sencilla: 
el API ODBC consiste en un interfaz que implementa un m&eacute;todo de 
pasar peticiones en lenguaje SQL a trav&eacute;s de una serie de funciones. 
Con ODBC podemos:
<ul>
<li> Obtener un puntero de descripci&oacute;n del entorno de programacion 
     ( algo parecido al <i>XOpenDisplay()</i> de X-Windows )
<li> Crear punteros de conexi&oacute;n, especificando origen de datos y 
     controlador
<li> Efectuar conexiones con la database (en nuestro lenguaje: abrir un socket)
<li> Crear punteros de peticiones SQL ( b&aacute;sicamente, obtener 
     estructuras de datos que nos permitan insertar nuestras peticiones )
<li> Ejecutar peticiones sobre la base de datos
<li> Recoger resultados de nuestras peticiones
<li> Liberar y cerrar todos los recursos previamente asignados
</ul>
En la pr&aacute;ctica, ni todas las aplicaciones, ni todos los controladores de
or&iacute;genes de datos son capaces de gestionar todas las funcionalidades
previstas por el API. Por ello se establecen los denominados "niveles de
conformidad SQL" en la aplicaci&oacute;n as&iacute; como "niveles de 
conformidad del controlador", que permiten al administrador de or&iacute;genes 
de datos saber qu&eacute; puede hacer tanto con el driver como con la 
aplicaci&oacute;n.
<p>
Remitimos al lector a la literatura indicada en las referencias para
buscar las especificaciones y descripciones de cada nivel de compatibilidad
<p>
<table>
<tr><td width="40%">
   <table border><tr><th>
   El proyecto <b>FreeODBC</b> ha desarrollado una librer&iacute;a, denominada 
   iODBC, que cumple con las especificaciones del API ODBC 2.0 de Microsoft, 
   y que integra las funciones de API y de administrador de or&iacute;genes 
   de datos.
   </th></tr></table>
</td><td> </td><td> </td></tr>
</table>
<p>
¿C&oacute;mo se aplica &eacute;sto en sistemas UNIX? El proyecto 
<b>FreeODBC</b> ha desarrollado una librer&iacute;a, denominada iODBC, que 
cumple con las especificaciones del API ODBC 2.0 de Microsoft, y que integra 
las funciones de API y de administrador de or&iacute;genes de datos. Cada 
servidor de bases de datos provee un driver que hace las funciones de 
controlador de or&iacute;genes de datos y de origen de datos de sistema 
espec&iacute;fico de cada servidor de bases de datos. <br>
Existe un fichero <i>${HOME}/.iodbc.ini</i>, que indica a la librer&iacute;a 
<i>libodbc.so.x.x</i>, los controladores de que dispone cada sistema, y 
c&oacute;mo se accede a ellos. Todo el interfaz esta implementado mediante 
librer&iacute;as din&aacute;micas. El resultado de todo esto, es que el 
programador se encuentra con un API virtualmente id&eacute;ntico al que se 
encontrar&iacute;a si estuviera trabajando en una maquina M$-Windows
<p>
En el CD-Rom que se acompaña a esta revista, bajo el directorio 
<i>odbc/</i> encontramos el fichero iODBC-1.0.tgz, que contiene:
<p>
<ul>
<li> <i>iodbc-2.12</i>  C&oacute;digo fuente de la librer&iacute;a 
del API de ODBC para UNIX proveniente del Proyecto <b>FreeODBC</b>
<li> <i>pgodbc-0.06</i>    C&oacute;digo fuente del driver UNIX para 
conectar el API iODBC con el servidor <b>PostGreSQL</b>
<li> <i>myodbc-2.50.17</i> C&oacute;digo fuente del driver UNIX para
conectar el API iODBC con <b>MySQL</b>
</ul>
	Su instalaci&oacute;n es realmente sencilla, pues basta seguir las
instrucciones para tener las librer&iacute;as libpgodbc.so, libmyodbc.so y
libiodbc.so compiladas.  Unicamente se deber&aacute; tener presente el 
instalar los ficheros <i>include</i> y las librer&iacute;as de manera que 
sean accesibles por el resto de las aplicaciones, ( por ejemplo en 
/usr/local/lib y /usr/local/include ), y modificar el fichero 
<i>/etc/ld.so.conf</i> para que el comando ldconfig localice dichas 
librer&iacute;as y las incluya en el cach&eacute; 
<p>
<table>
<tr><td width="40%">
<table border> <tr><th>
Navegando por el Web, podremos encontrar drivers de iODBC para casi
todas las bases de datos disponibles en Linux.
</th></tr> </table>
</td><td> </td><td> </td></tr>
</table>
<p>
Buceando por las paginas web, podremos encontrar drivers de iODBC para casi
todas las bases de datos disponibles en Linux. De hecho, Los desarrolladores
de iODBC han decidido inclu&iacute;r en sus nuevas releases todos los drivers 
de aquellas bases de datos que libremente los provean, incluyendo adem&aacute;s
de serie la pasarela JDBC-ODBC.
<p>
<hr>

<p>
<a name="php">
<h3><u>Un Ejemplo pr&aacute;ctico: PHP-3.0.1</u></h3>
Para que nuestro servidor de bases de datos est&eacute; completo nos falta un
componente imprescindible en todo servidor de informaci&oacute;n: el poder
hacer consultas a la base de datos desde el Web. Para ello Linux dispone de
la herramienta ideal: PHP
<p>
	PHP es un lenguaje de scripting con sintaxis tipo C, orientado a la 
generaci&oacute;n de p&aacute;ginas Web. Al igual que Perl, puede ser invocado
como un CGI script desde el servidor, o bien, insertado en documentos HTML
mediante cl&aacute;usulas &lt;?php..... ?&gt;. Estas tags son detectadas por el
servidor web, que las "intercepta" y transfiere al programa PHP que las 
interpreta, dando por su salida estandard el c&oacute;digo HTML que el 
programador desea
<p>
	As&iacute;mismo, PHP es capaz de tomar y procesar los par&aacute;metros
procedentes de un FORM, convirti&eacute;ndolos directamente a variables del
lenguaje, que pueden ser utilizadas a voluntad.
<p>
	La caracter&iacute;stica de PHP que nos interesa, es que tiene soporte
directo de funciones de acceso a las diversas bases de datos existentes para
Linux, incluyendo -c&oacute;mo no- a PostGreSQL, y a ODBC.
<p>
<table>
<tr><td width="40%">
<table border> <tr><th>
	PHP es un lenguaje de scripting con sintaxis tipo C, orientado a la 
generaci&oacute;n de p&aacute;ginas Web.
</th> </tr></table>
</td><td> </td><td> </td></tr>
</table>
<p>
	A la hora de instalarlo en nuestro sistema deberemos decidir:
<ul>
<li> Si lo vamos a instalar como programa independiente ( al estilo Perl )
o como m&oacute;dulo cargable desde el servidor Apache. Esta &uacute;ltima 
opci&oacute;n es la m&aacute;s recomendable, pero tiene el inconveniente de 
requerir la recompilaci&oacute;n del servidor Apache.
<li> Las funcionalidades y lista de servidores de bases de datos soportados.
En relaci&oacute;n con nuestra serie de art&iacute;culos podemos seleccionar:
<ul>
	<li> Soporte para PostGreSQL
	<li> Soporte para acceso al driver ODBC 
	<li> Soporte para acceso a trav&eacute;s de la librería iODBC
</ul>
<li>Deberemos tambi&eacute;n especificar los diversos par&aacute;metros de 
funcionamiento: safe-mode, ejecuci&oacute;n paralela, utilidades de 
compresi&oacute;n/descompresi&oacute;n, utilidades gr&aacute;ficas, 
modos de funcionamiento, etc. 
</ul>
<p>
En el Listado 1 se indican las funciones ODBC que soporta PHP, as&iacute;
como sus par&aacute;metros. Del mismo modo, en el CD-Rom bajo el directorio 
<i>listados</i> se incluyen una serie de ejemplos de paginas web con 
extensiones php ( ficheros .pthml ) que ilustran el manejo de php con 
accesos a la base de datos que se cre&oacute; de ejemplo en el art&iacute;culo 
anterior
<p>
<table border>
<tr>
<td align="left">
Unified ODBC Functions
<ul>
<li>    (int) odbc_autocommit($connection_id, $OnOff)
<li>    (void) odbc_close($connection_id)
<li>    (void) odbc_close_all(void)
<li>    (int) odbc_commit($connection_id)
<li>    (int) odbc_connect($dsn, $user, $password)
<li>    (int) odbc_pconnect($dsn, $user, $password)
<li>    (string) odbc_cursor($result_id)
<li>    (int) odbc_do($connection_id, $query_string)
<li>    (int) odbc_exec($connection_id, $query_string)
<li>    (int) odbc_prepare($connection_id, $query_string)
<li>    (int) odbc_execute($result_id, $array)
<li>    (int) odbc_fetch_row($result_id, $row_number)
<li>    (int) odbc_fetch_into($result_id, $row_number, $array_ptr)
<li>    (int) odbc_field_len($result_id, $field_number)
<li>    (string) odbc_field_name($result_id, $field_number)
<li>    (string) odbc_field_type($result_id, $field)
<li>    (int) odbc_free_result($result_id)
<li>    (int) odbc_num_fields($result_id)
<li>    (int) odbc_num_rows($result_id)
<li>    (string) odbc_result($result_id, $field)
<li>    (int) odbc_result_all($result_id, $format)
<li>    (int) odbc_rollback($connection_id)
</ul>
<p>
</td>
</tr>
<tr><td align="center"> Listado 1: Funciones ODBC soportadas por PHP</td>
</tr>
</table>
<p>
	Remitimos al lector al manual para proceder a la instalaci&oacute;n.
Es algo complicado, y normalmente implica una recompilaci&oacute;n del servidor
Apache, pero los resultados compensan con creces el esfuerzo dedicado.

<p> Prestemos atenci&oacute;n a como PHP implementa las diversas funciones de
llamada al API ODBC o al driver ODBC que tengamos instalado. Para ello echemos
un vistazo al fichero <i>functions/unified_odbc.c</i> . En el se enumeran 
todas y cada una de las funciones del API ODBC, y se efect&uacute;a una 
translaci&oacute;n entre las funciones PHP y las funciones equivalentes del 
API. En funci&oacute;n de los par&aacute;metros de configuraci&oacute;n 
indicados en el momento de la compilaci&oacute;n, PHP utilizar&aacute; 
bien el API iODBC, o bien acceder&aacute; directamente al driver ODBC del 
servidor de bases de datos que tengamos instalado. Esta &uacute;ltima 
configuraci&oacute;n tiene un inconveniente: impide que podamos tener 
varios servidores que hablen ODBC accesibles desde el servidor Web. En 
un primer momento, esto puede parecer que no tiene sentido, pero 
pi&eacute;nsese que iODBC permite el uso de varios servidores de bases 
de datos simultaneamente, por lo que podr&iacute;amos utilizar la 
librer&iacute;a como un "t&uacute;nel" de acceso a un servidor de databases 
remoto que careciera de servidor web...
 </a>
<p>

<hr>

<p>
<a name="conclusion">
<h3><u>Conclusi&oacute;n</u></h3>
</a>
<p>
En este segundo art&iacute;culo dedicado a la conectividad ODBC, se han
introducido los conceptos b&aacute;sicos de dicho sistema. Asimismo hemos 
aprendido a instalar y configurar los drivers ODBC para <b>PostGreSQL</b> y
las librer&iacute;as ODBC para Linux/UNIX, poniendo como ejemplo de 
aplicaci&oacute;n el interfaz web de acceso a base de datos PHP
<p>
En el pr&oacute;ximo n&uacute;mero de <b>Linux Actual</b>, 
finalizaremos la serie sobre ODBC, explicando la forma en que debemos instalar 
los drivers ODBC para <b>PostGreSQL</b> en sistemas Microsoft Windows-3.XX 
y Windows-95, con ejemplos de utilizaci&oacute;n desde MS-Access-97.
<p>
<hr>
<p>
<a name="referencias">
<h3><u>Referencias</u></h3>
</a>
<ul>
<li>PostGreSQL:<br>
 http://www.postgresql.org<br>
 http://postgres95.vnet.net

<li>Apache:<br>
 http://www.apache.org

<li>PHP:<br>
 http://www.php3.org

<li>Referencias sobre SQL:<br>
 - "The Practical SQL handbook" Bowman, Emerson y Damovsky<br>
  ISBN 0-201-44787-8 Addison-Wesley 1997<br>
 - "A guide to the SQL Standard" Date y Darwen<br>
  ISBN 0-201-96426-0 Addison-Wesley 1997

<li>PostGreSQL ODBC:<br>
 http://www.magenet.com/postodbc<br>
 http://postgres95.vnet.net/postodbc

<li>iODBC:<br>
 "The FreeODBC Pages" http://users.ids.net/~bjepson/freeODBC/

<li>ODBC y JDBC:<br>
 "Gestion de Bases de Datos en Internet" Frami&ntilde;an y Le&oacute;n<br>
  ISBN 84-415-0208-0 Anaya Multimedia
</ul>
</body>
</html>
