<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
	<TITLE></TITLE>
	<META NAME="GENERATOR" CONTENT="StarOffice/5.1 (Linux)">
	<META NAME="AUTHOR" CONTENT="Juan Antonio Martinez Casta&ntilde;o">
	<META NAME="CREATED" CONTENT="19991118;12410200">
	<META NAME="CHANGEDBY" CONTENT="Juan Antonio Martinez Casta&ntilde;o">
	<META NAME="CHANGED" CONTENT="19991119;4225900">
	<STYLE>
	<!--
		@page { margin: 2cm }
		TH P { font-style: italic }
	-->
	</STYLE>
</HEAD>
<BODY>
<P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif"><FONT SIZE=4 STYLE="font-size: 16pt"><U><B>Software
Libre: una aproximaci&oacute;n desde la Teor&iacute;a de Juegos</B></U></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif">Juan Antonio
Mart&iacute;nez</FONT></P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif">e-mail:
<A HREF="mailto:jantonio@dit.upm.es">jantonio@dit.upm.es</A></FONT></P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif">*****
ENTRADILLA******</FONT></P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif">El software
libre est&aacute; de moda. Conferencias, ensayos y estudios
matem&aacute;ticos se presentan todos los d&iacute;as
para hablar de las bondades de este &quot;nuevo estilo&quot; de hacer
software. En este art&iacute;culo se propone un
nuevo enfoque del tema, mediante una modelo sociol&oacute;gico
conocido por el nombre de &quot;Teor&iacute;a de Juegos&quot;</FONT></P>
<BR>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif">*****
PRESENTACION *****</FONT></P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif">El tema del
Software Libre es objeto de un amplio estudio. Conferencias, ensayos,
simulaciones..  Para la elaboraci&oacute;n de dichos estudios, se utilizan 
diversas herramientas del campo de las Matem&aacute;ticas, Sociolog&iacute;a,
y Gesti&oacute;n Empresarial. Vamos a analizar el fen&oacute;meno
mediante una herramienta conocida como &quot;Teor&iacute;a de Juegos&quot;
caracterizada por su simplicidad y, sobre todo, porque puede ser
&quot;simulada&quot; mediante diversos programas, con los que
ilustraremos el art&iacute;culo</FONT></P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm"><IMG SRC="dalton.en.jpg" NAME="Imagen1" WIDTH=642 HEIGHT=315 BORDER=0><BR>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif"><U><B>Introducci&oacute;n</B></U></FONT></P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif">Lo primero es
definir el concepto de &quot;Teor&iacute;a de Juegos&quot;. No es ,
como a primera vista pudiera pensarse una metodolog&iacute;a para el
dise&ntilde;o y construcci&oacute;n de juegos, sino una herramienta
matem&aacute;tica para modelizar de forma sencilla las
interrelaciones entre dos o m&aacute;s participantes en una relaci&oacute;n.</FONT></P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif">La Teor&iacute;a
de Juegos parte de una serie de supuestos:</FONT></P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<UL>
	<LI><P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif">Los
	participantes en la relaci&oacute;n son conscientes de &eacute;sta,
	buscan el m&aacute;ximo provecho de dicha relaci&oacute;n y actuan
	racionalmente</FONT></P>
	<LI><P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif">Existe
	un coste de la relaci&oacute;n y se obtiene un beneficio de ella.
	Coste y Beneficio son cantidades mensurables</FONT></P>
	<LI><P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif">Las
	transacciones se efectuan mediante los denominados &quot;turnos de
	juego&quot; , en los que todos a la vez realizan su selecci&oacute;n.
	En principio no podemos saber a priori cual va a ser la elecci&oacute;n
	del contrincante, sino solo suponer que escoger&aacute; la opci&oacute;n
	Optima para &eacute;l</FONT></P>
	<LI><P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif">Las
	&quot;partidas&quot; pueden ser a una sola vuelta ( un &uacute;nico
	turno ) o iterativas ( m&uacute;ltiples turnos ). Del mismo modo,
	pueden ser entre dos personas ( caso habitual ), o entre grupos de
	personas, en cuyo caso suponemos que se juega &quot;todos contra
	todos&quot; ( aunque posteriormente puedan surgir diversos tipos de
	alianzas )</FONT></P>
	<LI><P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif">El
	objetivo de la Teor&iacute;a de juegos es el an&aacute;lisis de
	estas relaci&oacute;nes y la b&uacute;squeda de un modelo de
	actuaci&oacute;n optimo para todos los casos</FONT></P>
</UL>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<TABLE WIDTH=336 BORDER=1 BORDERCOLOR="#000000" CELLPADDING=4 CELLSPACING=0>
	<COL WIDTH=326>
	<THEAD>
		<TR>
			<TD WIDTH=326 VALIGN=TOP>
				<P><B>el objeto de la teor&iacute;a de juegos es el an&aacute;lisis
				de las interrelaciones entre dos o m&aacute;s individuos, y la
				b&uacute;squeda de un modelo de actuaci&oacute;n &oacute;ptimo</B></P>
			</TD>
		</TR>
	</THEAD>
</TABLE>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif">Desde estas
presunciones, podemos considerar el modelo de desarrollo del Software
Libre como sujeto de an&aacute;lisis con esta metodolog&iacute;a. Los
lectores pueden objetar que en la pr&aacute;ctica estos supuestos no
son de sencilla aplicaci&oacute;n: las personas no siempre actuan
racionalmente, la b&uacute;squeda del beneficio m&aacute;ximo no es
siempre el objetivo, es dificil mensurar el &quot;beneficio&quot; de
la satisfacci&oacute;n personal...No obstante, la Sociolog&iacute;a
demuestra que si bien a nivel personal, estos supuestos no siempre se
cumplen, a nivel empresarial, de grupos u organizaciones - incluso
las autodenominadas &quot;altru&iacute;stas&quot; - tienden a
comportarse as&iacute;</FONT></P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif">Un primer
ejemplo, que ilustra los problemas t&iacute;picos que trata la Teor&iacute;a
de Juegos: El problema del reparto
equitativo. En esencia se trata de conseguir que un grupo de personas
se sientan contentos con la parte que les haya tocado en un reparto.
La modelizaci&oacute;n de este problema presupone que a todo el mundo
le gustar&iacute;a que le tocara el 100% de la cantidad total a
repartir, y que se sentir&aacute; a disgusto si considera que alguien
tiene m&aacute;s que &eacute;l.</FONT></P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif">	El problema,
as&iacute; planteado, y para el caso de dos personas, se conoce como
el &quot;reparto del pastel&quot;. En el caso de dos personas, se
describe como &quot;&iquest;C&oacute;mo deben repartirse dos personas
una tarta, de manera que ninguno considere que tiene menos que el
otro?. La respuesta es sencilla: El primero debe partir la tarta, y
el segundo escoger el pedazo que prefiera. Evidentemente, el primer
jugador har&aacute; lo posible por que la partici&oacute;n sea lo m&aacute;s
equitativa posible, pues en caso contrario, sabe que se quedar&aacute;
con el trozo menor.... El problema es generalizable a n personas y m
tartas, y existen demostraciones de reparto &oacute;ptimo para cada
caso.</FONT></P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif">	Este
ejemplo, si bien lejano al caso del Software Libre es ilustrativo de
c&oacute;mo se puede estudiar matem&aacute;ticamente una
interrelaci&oacute;n entre dos o m&aacute;s individuos en casos
concretos. Para acercarnos m&aacute;s al caso que nos interesa vamos
a analizar los elementos que intervienen en el proceso de desarrollo
de este Software.</FONT></P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif">En el
universo del desarrollo de software libre, tenemos los siguientes
participantes:</FONT></P>
<UL>
	<LI><P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif">Empresa</FONT></P>
	<LI><P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif">Coordinadores
	de proyecto</FONT></P>
	<LI><P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif">Programadores</FONT></P>
	<LI><P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif">Voluntarios</FONT></P>
	<LI><P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif">Usuarios</FONT></P>
	<LI><P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif">Clientes</FONT></P>
	<LI><P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif">InterNet</FONT></P>
</UL>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif">Cada uno de
ellos relaciona con los dem&aacute;s, teniendo en dicha relaci&oacute;n
una serie de costes, y recibiendo por ello unos beneficios. Estos
beneficios pueden ser econ&oacute;micos, morales, de obtenci&oacute;n
 de recursos, de prestigio... en cualquier caso algo por lo que
merece la pena moverse. Por el contrario, para obtenerlos es
necesario un gasto: tel&eacute;fono, perdida de control del software,
dispersi&oacute;n de clientela, tiempo, dinero... Como hemos dicho
antes, tanto los beneficios como los costes son dif&iacute;cilmente
cuantificables, por lo que tendremos que hacer diversas
aproximaciones</FONT></P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif">De lo que se
trata a efectos del modelo, es que se ofrece una opci&oacute;n de
intercambio. Cada uno puede o no ofrecer algo al otro, y el otro
puede o no recibirlo, dejando a su vez o no  algo a cambio.</FONT></P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif">En sociolog&iacute;a
esto se conoce por el nombre de Modelo de Cooperaci&oacute;n Ego&iacute;sta:
cuando dos o m&aacute;s personas interrelacionan para obtener algo a
cambio. Se denomina &quot;egoista&quot; porque se presupone que cada
participante busca el inter&eacute;s propio, o a lo sumo el inter&eacute;s
com&uacute;n, no el inter&eacute;s del otro.</FONT></P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif">Utilizaremos
a partir de ahora los conceptos de &quot;Altru&iacute;smo&quot; y
&quot;Ego&iacute;smo&quot; en un sentido sociol&oacute;gico, no moral</FONT></P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<TABLE WIDTH=304 BORDER=1 BORDERCOLOR="#000000" CELLPADDING=4 CELLSPACING=0>
	<COL WIDTH=294>
	<THEAD>
		<TR>
			<TD WIDTH=294 VALIGN=TOP>
				<P><B>Cooperar o no cooperar, he aqu&iacute; el dilema</B></P>
			</TD>
		</TR>
	</THEAD>
</TABLE>
<P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif">Vamos a
ponernos en el caso de uno de los participantes: Yo tengo acceso a un
producto (software), y tengo dos opciones: cogerlo o dejarlo. En el
primer caso puedo dar algo a cambio, o no. En el caso del software
propietario, el dar algo a cambio, significa pagar por la licencia de
utilizaci&oacute;n, o bien ser un &quot;pirata&quot;. En el caso del
software libre, significa contribu&iacute;r al futuro de dicho
software, o bien qued&aacute;rmelo &quot;sin m&aacute;s&quot;.</FONT></P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif">N&oacute;tese,
que en cualquiera de los casos, el ofrecimiento que me hacen del
producto puede ser aceptado o no, y retribu&iacute;do o no. La
decisi&oacute;n es m&iacute;a. Yo, evidentemente busco el m&aacute;ximo
beneficio para m&iacute;, y debo tener en cuenta las posibles
consecuencias de mis actos. &iquest;qu&eacute; es lo que debo hacer?</FONT></P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif"><U><B>El
Dilema del Prisionero</B></U></FONT></P>
<P STYLE="margin-bottom: 0cm"><FONT FACE="times, serif">Tenemos ya
todo lo necesario para entrar de lleno en la Teor&iacute;a de Juegos,
mediante el conocido &quot;Dilema del Prisionero&quot;</FONT></P>
<P><FONT FACE="times, serif">Dos atracadores han sido detenidos,
estando cada uno aislado del otro en sendas salas de interrogatorio.
El fiscal propone a cada uno de los presos un pacto: si delata a su
compa&ntilde;ero se librar&aacute; de la c&aacute;rcel.... siempre y
cuando el compa&ntilde;ero no le delate a &eacute;l. Si ambos optan
por permanecer callados la pena ser&aacute; de un a&ntilde;o de
prisi&oacute;n. En el caso de condena, la pena ser&aacute; de tres
a&ntilde;os. </FONT>
</P>
<P>Tanto A como B razonan que en el caso de permanecer callados no
tienen posibilidad de librarse de la c&aacute;rcel, luego la soluci&oacute;n
ideal es delatar al compa&ntilde;ero... salvo que el compa&ntilde;ero
puede seguir el mismo razonamiento &iquest;C&uacute;al es pues la
decisi&oacute;n correcta? 
</P>
<P>Representando el problema en forma de tabla, obtenemos el
siguiente diagrama:</P>
<TABLE WIDTH=542 BORDER=1 BORDERCOLOR="#000000" CELLPADDING=4 CELLSPACING=0>
	<COL WIDTH=98>
	<COL WIDTH=99>
	<COL WIDTH=155>
	<COL WIDTH=155>
	<TR>
		<TD WIDTH=98>
			<P>Preso 1</P>
		</TD>
		<TD WIDTH=99>
			<P ALIGN=RIGHT>Preso 2</P>
		</TD>
		<TD WIDTH=155>
			<P ALIGN=CENTER>Delata</P>
		</TD>
		<TD WIDTH=155>
			<P ALIGN=CENTER>Calla</P>
		</TD>
	</TR>
	<TR>
		<TD COLSPAN=2 WIDTH=205>
			<P>Delata</P>
		</TD>
		<TD WIDTH=155 SDVAL="-3,3" SDNUM="1034;0;@">
			<P ALIGN=CENTER>( 3 , 3 )</P>
		</TD>
		<TD WIDTH=155 SDVAL="-0,3" SDNUM="1034;0;@">
			<P ALIGN=CENTER>( 0 , 3 )</P>
		</TD>
	</TR>
	<TR>
		<TD COLSPAN=2 WIDTH=205>
			<P>Calla</P>
		</TD>
		<TD WIDTH=155 SDNUM="1034;0;@">
			<P ALIGN=CENTER>( 3 , 0 )</P>
		</TD>
		<TD WIDTH=155 SDNUM="1034;0;@">
			<P ALIGN=CENTER>( 1 , 1 )</P>
		</TD>
	</TR>
</TABLE>
<P><BR><BR>
</P>
<P>La segunda variante del dilema del preso nos introduce de lleno en
los modelos de cooperaci&oacute;n: 
</P>
<P>Tenemos de nuevo dos atracadores, esta vez en libertad, que se
dedican a la compraventa de productos robados. Los atracadores han
pactado que uno de ellos deje la mercanc&iacute;a en un lugar
determinado, mientras que el otro deja el dinero en otro lugar. Ambos
atracadores se dirigen a recoger posteriormente el paquete destinado
a cada uno... 
</P>
<P>Est&aacute; claro que si uno de ellos deja un paquete vac&iacute;o,
y recoge a cambio un paquete lleno, ha obtenido un beneficio neto en
la transacci&oacute;n. Por consiguiente ambos dejan sendos paquetes
vac&iacute;os... y recogen paquetes vac&iacute;os. Pero &iquest;Y si
en lugar de un &uacute;nico intercambio se realizan una serie de
intercambios espaciados en el tiempo ? Si un ladr&oacute;n traiciona
al otro, es casi seguro que ser&aacute; traicionado en la siguiente
transacci&oacute;n. &iquest;Cual es la estrategia ganadora? 
</P>
<P>Para complicar m&aacute;s las cosas, vamos a suponer que en lugar
de dos atracadores tenemos n atracadores, interaccionando entre ellos
por parejas: a cada turno el atracador m debe decidir qu&eacute; es
lo que va a hacer con cada uno de los dem&aacute;s atracadores,
colaborar o traicionar</P>
<P>En el caso del software libre, la interrelaci&oacute;n no se
realiza por parejas, sino que es una relaci&oacute;n de todos con
todos, pero a&uacute;n as&iacute; podemos seguir utilizando el modelo</P>
<P>Realmente podr&iacute;amos aplicar este an&aacute;lisis a
cualquier tipo de transacci&oacute;n econ&oacute;mica. &iquest; En
qu&eacute; se diferencian unos modelos econ&oacute;micos de otros? En
la estrategia de intercambio que utilizan cada uno. Un empresario sin
escr&uacute;pulos, puede adoptar una postura &quot;ego&iacute;sta&quot;
( recu&eacute;rdese siempre que se habla en t&eacute;rminos
sociol&oacute;gicos, no morales ), y ofrecer sistem&aacute;ticamente
a cambio de dinero un software de calidad m&aacute;s que dudosa ( &iquest;
A qu&eacute; nos suena ...? ). Un altru&iacute;sta convencido, puede
trabajar por amor al arte y ofrecer productos gratis, sin esperar
nada a cambio... Por el otro lado, yo  puedo escoger entre pagar o
piratear, usar el software o contribu&iacute;r a &eacute;l....</P>
<P>En cualquier caso la estrategia que adoptemos condicionar&aacute;
futuras negociaciones. En el caso del software libre, la estrategia
adoptada ( en teor&iacute;a ) es la de colaboraci&oacute;n: se acepta
el producto, y a cambio se ofrecen mejoras, estudio, e incluso
dinero.</P>
<TABLE WIDTH=338 BORDER=1 BORDERCOLOR="#000000" CELLPADDING=4 CELLSPACING=0>
	<COL WIDTH=328>
	<THEAD>
		<TR>
			<TD WIDTH=328 VALIGN=TOP>
				<P><B>Se han definido y estudiado m&uacute;ltiples estrategias de
				comportamiento. La m&aacute;s conocida se denomina &quot;Ojo por
				ojo&quot;</B></P>
			</TD>
		</TR>
	</THEAD>
</TABLE>
<P><BR><BR>
</P>
<P>En Teor&iacute;a de Juegos se han definido y estudiado m&uacute;ltiples
estrategias. Citemos como presentaci&oacute;n alguna de ellas:</P>
<UL>
	<LI><P>El Ego&iacute;sta: Defrauda sistem&aacute;ticamente</P>
	<LI><P>El Altru&iacute;sta: Colabora siempre</P>
	<LI><P>El Loco: Colabora o defrauda de forma aleatoria</P>
</UL>
<P>Entre las diversas estrategias conocidas destaca por su sencillez
y efectividad la denominada &quot;Tit for Tat&quot;, que podr&iacute;amos
traducir al castellano como &quot;Ojo por ojo&quot;. Se puede resumir
de la forma siguiente:</P>
<UL>
	<LI><P>En el primer turno, el jugador colabora.</P>
	<LI><P>En el segundo y siguientes turnos, el jugador repite la
	jugada que le haya hecho el opnonente: colabora, si el otro colabor&oacute;
	y defrauda si el otro le defraud&oacute;</P>
</UL>
<P>Esta estrategia, extremadamente simple es a la vez muy efectiva.
En muchos concursos celebrados en Internet sobre simulaciones del
&quot;Dilema del Prisionero&quot;, esta estrategia ha resultado
ganadora.</P>
<P>En el caso del software libre, podemos ver una similitud con esta
estrategia: la gente empieza por poner su software a disposici&oacute;n
del p&uacute;blico ( colaboraci&oacute;n inicial ), y recibe
respuestas de &eacute;ste en forma de contribuciones al desarrollo.
En el caso de un oponente ego&iacute;sta... se queda sin respuesta,
pero tambi&eacute;n en cuanto se sepa que dicho oponente act&uacute;a
con estrategias ego&iacute;stas, se ver&aacute; relegado de la
comunidad de cooperantes.</P>
<P><U><B>Un Simulador para el dilema del prisionero</B></U></P>
<P>Antes de seguir con las implicaciones de esta modelizaci&oacute;n
vamos a hacer algo pr&aacute;ctico: montar un simulador para este
modelo. El CD-Rom que acompa&ntilde;a a esta revista contiene dos
programas, denominados &quot;prison&quot; y &quot;jprison&quot;, que
consituyen plataformas de simulaci&oacute;n para el dilema del
prisionero. El primero est&aacute; escrito en C, y precisa para su
ejecuci&oacute;n de la librer&iacute;a OpenLook Xview, de la cual se
ofrece en el CD-Rom el paquete en formato .rpm. El segundo, aunque
menos potente, est&aacute; escrito enteramente en java, con lo que
podremos compilarlo y ejecutarlo en cualquier plataforma.</P>
<P>Ambos programas incluyen instrucciones para su compilaci&oacute;n
y ejecuci&oacute;n. Del mismo modo, incorporan diveras estrategias
predefinidas, y ofrecen la posibilidad de crear e integrar
estrategias nuevas. La figura dos ilustra una imagen del programa
&quot;xprison&quot;, versi&oacute;n gr&aacute;fica del primero de los
paquetes inclu&iacute;dos ( este paquete ofrece tambi&eacute;n una
versi&oacute;n en modo texto, que permite interacci&oacute;n con el
correo electr&oacute;nico, web, etc, para hacer simulaciones off-line
)</P>
<P>Xprison es un emulador iterativo gr&aacute;fico del dilema del
preso. A cada turno se analizan los resultados, y en funci&oacute;n
de ellos se crea una &quot;nueva generaci&oacute;n de algoritmos&quot;.
Dependiendo del beneficio obtenido, el programa tender&aacute; a
potenciar m&aacute;s hijos de los algoritmos m&aacute;s rentables, y
a disminu&iacute;r el n&uacute;mero de algoritmos no rentables 
</P>
<TABLE WIDTH=100% BORDER=1 BORDERCOLOR="#000000" CELLPADDING=4 CELLSPACING=0>
	<COL WIDTH=256*>
	<THEAD>
		<TR>
			<TH WIDTH=100% VALIGN=TOP>
				<P><IMG SRC="xprison.jpg" NAME="Imagen2" ALIGN=LEFT WIDTH=635 HEIGHT=556 BORDER=0><BR>
				</P>
			</TH>
		</TR>
	</THEAD>
	<TBODY>
		<TR>
			<TD WIDTH=100% VALIGN=TOP>
				<P>Figura 1: El simulador Xprison</P>
			</TD>
		</TR>
	</TBODY>
</TABLE>
<P><BR><BR>
</P>
<P>Analicemos el programa: En la primera pantalla nos aparecen una
serie de estrategias, de las cuales deberemos esoger las que queramos
someter a an&aacute;lisis. Podemos escoger tanto el n&uacute;mero de
estrategias como la poblaci&oacute;n inicial. Del mismo modo, podemos
definir los grados de mutaci&oacute;n, la intervenci&oacute;n del
azar en la nueva generaci&oacute;n.... podemos as&iacute;mismo cargar
y guardar configuraciones, y por supuesto, ejecutar simulaciones</P>
<P>La segunda ventana corresponde a la del simulador. Podemos ver en
forma de histogramas el resultado global de la simulaci&oacute;n,
avanzar paso a paso, cambiar las condiciones de ejecuci&oacute;n. La
representaci&oacute;n visual puede conmutarse entre histograma o
diagrama de &quot;quesos&quot;, sirviendo &eacute;ste &uacute;ltimo
para ver el resultado final, o bien realizar trazas paso a paso.</P>
<P>Aparece un segundo gr&aacute;fico, correspondiente al nivel de
colaboraci&oacute;n entre las diversas estrategias. Es curioso
analizar como a medida que el n&uacute;mero de iteraciones crece,
crece el nivel de colaboraci&oacute;n entre las diversas estrategias.
Esto nos ilustra ya una la primera conclusi&oacute;n extra&iacute;ble
desde la Teor&iacute;a de Juegos:</P>
<TABLE WIDTH=288 BORDER=1 BORDERCOLOR="#000000" CELLPADDING=4 CELLSPACING=0>
	<COL WIDTH=278>
	<THEAD>
		<TR>
			<TD WIDTH=278 VALIGN=TOP>
				<P><B>A corto plazo, las estrategias ego&iacute;stas salen
				vencedoras</B></P>
			</TD>
		</TR>
	</THEAD>
</TABLE>
<P><BR><BR>
</P>
<P><i>&quot;En condiciones normales, las estrategias ego&iacute;stas son
beneficiosas a corto plazo, siendo las estrategias colaboradoras las
ganadoras a medio y largo plazo&quot;</i>.<br>
 En lenguaje llano: &quot;se
puede enga&ntilde;ar a una persona siempre, o a todo el mundo una
vez, pero no se puede enga&ntilde;ar siempre a todo el mundo&quot;....
Fabricantes de software, Editoriales, Empresas de cine,
discogr&aacute;ficas... etc, se enfrentan actualmente al problema de
la pirater&iacute;a y al descenso imparable de los beneficios de
ventas. A la luz de estos resultados es la reacci&oacute;n l&oacute;gica
a todo un historial de abusos sobre los consumidores. En cambio, las
empresas de servicios, o el software libre se encuentran ante un
crecimiento de expectativas y de ventas imparable... 
</P>
<P>Realmente no tiene por qu&eacute; ser as&iacute;:Paul Rosemberg,
en un reciente documento publicado en Internet ( inclu&iacute;do en
el CD-Rom ) titulado &quot;A Mathematical Analysis of  the Bussines
of Software&quot;, realiza un estudio matem&aacute;tico detallado de
la evoluci&oacute;n de las empresas y llega a la conclusi&oacute;n de
que tanto el software libre como el software propietario pueden
progresar indefinidamente si se cumplen una serie de requisitos. Es
de lectura dif&iacute;cil, pero obligada para todos los interesados
en el tema.</P>
<P><U><B>Estudio y simulaci&oacute;n de diversas estrategias</B></U></P>
<P>Sigamos estudiando el modelo con el simulador. Para ello vamos a
leer la documentaci&oacute;n sobre las diversas estrategias, y a
probar diversas configuraciones</P>
<P>La primera de ellas consiste en estudiar el algoritmo del &quot;ojo
por ojo&quot;. En casi todas las simulaciones, este algoritmo
resulta, si no ganador, si de los primeros. Escojamos pues una
poblaci&oacute;n basada en una mayor&iacute;a de algoritmos ego&iacute;stas
y una minor&iacute;a de &quot;ojo por ojo&quot;...</P>
<TABLE WIDTH=301 BORDER=1 BORDERCOLOR="#000000" CELLPADDING=4 CELLSPACING=0>
	<COL WIDTH=291>
	<THEAD>
		<TR>
			<TD WIDTH=291 VALIGN=TOP>
				<P><B>Es precisa una &quot;masa cr&iacute;tica&quot; para que una
				estrategia colaboradora prospere</B></P>
			</TD>
		</TR>
	</THEAD>
</TABLE>
<P><BR><BR>
</P>
<P>En la figura hemos escogido 100 muestras de &quot;Ego&iacute;sta
puro&quot;, frente a 7 muestras de &quot;ojo por ojo&quot;. El
resultado es deprimente: El algoritmo generoso no obtiene beneficio
alguno, y acaba por desaparecer... es necesario que elevemos a 10 o
m&aacute;s muestras de &quot;ojo por ojo&quot; para que muy despacio,
los colaboradores sean capaces de pervivir y reproducirse. Tenemos
aqu&iacute; la segunda conclusi&oacute;n:</P>
<TABLE WIDTH=100% BORDER=1 BORDERCOLOR="#000000" CELLPADDING=4 CELLSPACING=0>
	<COL WIDTH=128*>
	<COL WIDTH=128*>
	<THEAD>
		<TR VALIGN=TOP>
			<TH WIDTH=50%>
				<P><IMG SRC="mcritica1.gif" NAME="Imagen3" ALIGN=LEFT WIDTH=314 HEIGHT=270 BORDER=0><BR>
				</P>
			</TH>
			<TH WIDTH=50%>
				<P><IMG SRC="mcritica2.gif" NAME="Imagen4" ALIGN=LEFT WIDTH=314 HEIGHT=270 BORDER=0><BR>
				</P>
			</TH>
		</TR>
	</THEAD>
	<TBODY>
		<TR>
			<TD COLSPAN=2 WIDTH=100% VALIGN=TOP>
				<P>Figura 2: Representaci&oacute;n gr&aacute;fica del concepto de
				masa cr&iacute;tica</P>
			</TD>
		</TR>
	</TBODY>
</TABLE>
<P><BR><BR>
</P>
<P><i>&quot;Condici&oacute;n indispensable para que una estrategia
colaboradora perviva, es que exista un n&uacute;mero de colaboradores
suficiente para que se produzcan beneficios&quot;</i>. Es la condici&oacute;n
de &quot;<b>masa cr&iacute;tica&quot;</b> del Software Libre.</P>
<P>La aplicaci&oacute;n al software es inmediata: Si bien el software
libre ha existido desde los comienzos de la inform&aacute;tica, solo
con la popularizaci&oacute;n de Internet y la accesibilidad global a
la red ha permitido que el software libre haya podido llegar a donde
est&aacute; hoy. S&oacute;lo la existencia de un gran n&uacute;mero
de colaboradores en el modelo garantiza su pervivencia</P>
<P>Probemos ahora otra combinaci&oacute;n: &iquest;Qu&eacute; pasar&iacute;a
si en lugar de enfrentar a nuestro colaborador ego&iacute;sta con
&quot;los malos&quot; lo enfrentamos con una estrategia 
&quot;Altru&iacute;sta&quot;.  
Probemos por ejemplo una proporci&oacute;n de 50% de cada poblaci&oacute;n..
El resultado se puede preveer sin necesidad de efectuar simulaci&oacute;n:
ambas estrategias permanecen estables en el tiempo y el indicador de
colaboraci&oacute;n permanece en el 100 %. Esto ilustra un efecto
sorprendente y que da lugar a multitud de discusiones sobre moral y
sociolog&iacute;a:</P>
<TABLE WIDTH=332 BORDER=1 BORDERCOLOR="#000000" CELLPADDING=4 CELLSPACING=0>
	<COL WIDTH=322>
	<THEAD>
		<TR>
			<TD WIDTH=322 VALIGN=TOP>
				<P><B>En condiciones normales, no hay diferencia entre el
				comportamiento Altru&iacute;sta y una colaboraci&oacute;n
				ego&iacute;sta, cuando ambas estrategias se relacionan entre s&iacute;</B></P>
			</TD>
		</TR>
	</THEAD>
</TABLE>
<P><BR><BR>
</P>
<P><i>&quot;Para un observador neutral, y en ausencia de otros datos m&aacute;s
que los resultados obtenidos, es imposible distinguir una estrategia
genuinamente altru&iacute;sta de una de colaboraci&oacute;n ego&iacute;sta&quot;</i>.
Esto es: no hay diferencia entre el que es &quot;bueno&quot; del que
busca su beneficio. Las implicaciones  &eacute;ticas de este
resultado trascienden del &aacute;mbito de este art&iacute;culo, pero
baste hacer notar que en base a estos resultados muchos fil&oacute;sofos
sostienen que los conceptos de &quot;bueno&quot; y &quot;malo&quot;,
no son tales, sino que el &uacute;nico concepto v&aacute;lido es el
de &quot;beneficioso o no&quot;. Existe la denominada &quot;<b>Etica de
lo &uacute;til&quot;</b> que se apoya en que es posible el beneficio
mutuo partiendo, no del altru&iacute;smo ( que algunos autores niegan
), sino del resultado de una cooperaci&oacute;n ego&iacute;sta. ( ver
bibliograf&iacute;a en las referencias )</P>
<P>En las listas de correo sobre temas de software libre, se generan
continuamente discusiones sobre el tema &quot;trabajar gratis&quot;,
&quot;hacer las cosas con generosidad&quot;, etc. Para un observador
imparcial, esta discusi&oacute;n carece de sentido: es como preguntar
por las motivaciones de un voluntario en una ONG. De lo que se trata
a efectos pr&aacute;cticos es del resultado: el software se realiza,
y avanza.</P>
<P>No siempre la colaboraci&oacute;n es plena: imaginemos el caso de
una estrategia que se basa en colaborar s&oacute;lo con determinadas
estrategias. En Teor&iacute;a de Juegos se conoce como el &quot;Modelo
del Colaborador Racista&quot;. &iquest; Cual es el resultado de este
modelo ?</P>
<P>Como en el simulador esta estrategia no est&aacute; implementada,
vamos a dar unas pautas para su dise&ntilde;o:</P>
<UL>
	<LI><P>En una primera fase, el colaborador racista se comporta como
	secuencia, una firma de identificaci&oacute;n, a la vez que intenta
	reconocer dicha firma en las dem&aacute;s estrategias que participan
	en el juego</P>
	<LI><P>En una segunda fase, la estrategia consiste en comportarse
	como altru&iacute;sta con las estrategias &quot;hermanas&quot; y
	como ego&iacute;sta con las dem&aacute;s</P>
</UL>
<P>El resultado de esta estrategia depende de la proporci&oacute;n
entre las diversas razas que participen en el juego. Si una raza es
minoritaria se extinguir&aacute;. Si todas las razas tienen
suficiente masa critica, se producen diversas posiciones de
equilibrio, en que la poblaci&oacute;n de cada raza permanece
estable. No  obstante el nivel de colaboraci&oacute;n, como es obvio
no llega nunca al 100% sino que corresponde a los porcentajes de
poblaci&oacute;n. Como corolario:</P>
<TABLE WIDTH=333 BORDER=1 BORDERCOLOR="#000000" CELLPADDING=4 CELLSPACING=0>
	<COL WIDTH=323>
	<THEAD>
		<TR>
			<TD WIDTH=323 VALIGN=TOP>
				<P><B>Es posible encontrar puntos de equilibrio en los que
				coexistan diversas estrategias</B></P>
			</TD>
		</TR>
	</THEAD>
</TABLE>
<P><BR><BR>
</P>
<P><i>&quot;Es perfectamente posible que existan diversos puntos de
equilibrio en los que la colaboraci&oacute;n no es plena, pero la
poblaci&oacute;n permanece estable&quot;</i></P>
<P>Los lectores r&aacute;pidamente identificar&aacute;n este ejemplo
con un caso muy debatido en el mundo Linux: la &quot;guerra&quot;
entre KDE y GNOME. Actualmente no parece que ninguno de estos dos
proyectos vaya a superar al otro. Antes bien avanzan en paralelo,
evolucionando y mejorando continuamente. La Teor&iacute;a de Juegos
postula la existencia de los denominados &quot;Puntos de Equilibrio&quot;,
en que no existe ninguna estrategia ganadora. Sin duda, los
asistentes al II Congreso Hispalinux, celebrado los d&iacute;as 5 y 6
de Noviembre en la Universidad Carlos III de Madrid, recordar&aacute;n
la ponencia &quot;Altru&iacute;smo, Eficiencia y Bienes P&uacute;blicos&quot;,
en la que Felipe P&eacute;rez nos expuso una demostraci&oacute;n
matem&aacute;tica de la existencia de puntos de equilibrio, en
funci&oacute;n de las diferencias de intereses entre los
colaboradores. ( El CD-Rom que acompa&ntilde;a a esta revista,
incluye una copia de dicha ponencia. Los interesados, pueden
obtenerla tambi&eacute;n en el Web )</P>
<TABLE WIDTH=100% BORDER=1 BORDERCOLOR="#000000" CELLPADDING=4 CELLSPACING=0>
	<COL WIDTH=256*>
	<THEAD>
		<TR>
			<TH WIDTH=100% VALIGN=TOP>
				<P><IMG SRC="pequilibrio.jpg" NAME="Imagen5" ALIGN=LEFT WIDTH=344 HEIGHT=243 BORDER=0><BR>
				</P>
			</TH>
		</TR>
	</THEAD>
	<TBODY>
		<TR>
			<TD WIDTH=100% VALIGN=TOP>
				<P>Figura 3: ilustraci&oacute;n gr&aacute;fica de la existencia
				de puntos de equilibrio</P>
			</TD>
		</TR>
	</TBODY>
</TABLE>
<P><BR><BR>
</P>
<P>Evidentemente, la estabilidad que presenta la simulaci&oacute;n,
en la vida real no es completa: La evoluci&oacute;n normal consiste
en el denominado efecto de &quot;Diversificaci&oacute;n&quot;: Dos
empresas estables y que compiten por un mismo mercado, acaban, bien
sucumbiendo alguna, o bien ocupando cada una un diferente nicho de
mercado. Esta diversificaci&oacute;n puede ser geogr&aacute;fica o de
intereses. En el ejemplo de KDE y GNOME, parece ser que cada
escritorio est&aacute; siendo adoptado por dos tipos de usuario: el
que busca un escritorio f&aacute;cil de usar (KDE) o el que busca un
escritorio potente (GNOME). Del mismo modo las empresas que
distribuyen linux tienden a adoptar un escritorio u otro:
diversificaci&oacute;n de usuarios y de mercado. Por contra, las
soluciones minoritarias, especialmente las basadas en c&oacute;digo
cerrado ( Motif, CDE... ) no alcanzan la masa cr&iacute;tica, y est&aacute;n
desapareciendo r&aacute;pidamente del mundo Linux</P>
<P><U>Estrategias avanzadas</U></P>
<P>Como m&aacute;s de un lector avezado podr&aacute; pensar, &quot;ojo
por ojo&quot; no es la estrategia &oacute;ptima. Ni siquiera es la
que m&aacute;s se parece al modelo de desarrollo de Software Libre:</P>
<P>-En primer lugar, no sabe aprovecharse de las debilidades del
oponente: ante una estrategia altru&iacute;sta, la opci&oacute;n
l&oacute;gica consiste en aprovechar la &quot;candidez&quot; del
oponente, defraudando de vez en cuando al contrario</P>
<P>-En segundo lugar no es suficientemente efectiva: ante &quot;errores&quot;
del contrario, suele tender a una estrategia de no colaboraci&oacute;n
que redunda en la imposibilidad de obtener beneficios en posteriores
turnos.</P>
<P>En el primer caso, el algoritmo intenta conseguir beneficios a
partir de la garant&iacute;a de que el oponente no le va a penalizar:
La licencia GPL me permite hacer uso indiscriminado del software GPL,
afectando solo a la redistribuci&oacute;n. Yo como usuario no tengo
ninguna obligaci&oacute;n de contribu&iacute;r al desarrollo de
software GPL, aunque tengo todo el derecho a utilizarlo - siempre que
respete los t&eacute;rminos de la licencia -. Es la comunidad Linux
la que se encargar&aacute; de hacerme entrar en raz&oacute;n..</P>
<TABLE WIDTH=337 BORDER=1 BORDERCOLOR="#000000" CELLPADDING=4 CELLSPACING=0>
	<COL WIDTH=327>
	<THEAD>
		<TR>
			<TD WIDTH=327 VALIGN=TOP>
				<P><B>Las estrategias colaboradoras potencian la captaci&oacute;n
				de nuevos colaboradores</B></P>
			</TD>
		</TR>
	</THEAD>
</TABLE>
<P><BR><BR>
</P>
<P>En el segundo caso, se trata de convencer a alguien que no
colabora para que inicie la colaboraci&oacute;n, a base de ofrecerle
&quot;regalos&quot;. En nuestro caso: regalarle una distribuci&oacute;n
de Linux... a este respecto, y puesto que hemos visto que la potencia
y el futuro del Software Libre reside la cantidad de gente que
participa, existe una tendencia natural al proselitismo entre los
&quot;adeptos&quot; a Linux. No es casualidad la expresi&oacute;n
&quot;Comunidad Linux&quot; .... con todas las connotaciones de secta
y proselitismo que pueda conllevar. De hecho, como se ve en el
simulador, la colaboraci&oacute;n es un fen&oacute;meno que produce
realimentaci&oacute;n positiva. Nadie que disfrute de los beneficios
del Software Libre puede dejar de intentar promocionarlo.</P>
<P>Dejamos al lector como ejercicio la expresi&oacute;n formal de
esta estrategia, y su proyecci&oacute;n en el simulador.</P>
<P><B><U>Resumen. Conclusiones</U></B></P>
<P>Hemos descrito los fundamentos de la Teor&iacute;a de Juegos, su
aplicaci&oacute;n a las interrelaciones humanas, y al desarrollo del
software libre. Mediante simulaci&oacute;n, hemos descrito y
explicado alguno de los efectos que vemos en el mundo del software
libre. Quedan una serie de puntos que no podemos entrar aqu&iacute; a
describir:</P>
<UL>
	<LI><P>No existen en la vida real estrategias definidas: las
	personas, y con ellas sus motivaciones, evolucionan con el tiempo.
	Para simular este comportamiento se precisa de herramientas m&aacute;s
	poderosas, que las descritas aqu&iacute;</P>
	<LI><P>No hemos hecho un an&aacute;lisis del concepto de beneficio,
	ni de los m&eacute;todos de cuantificaci&oacute;n. En el CD-Rom que
	acompa&ntilde;a a la revista se incluyen ensayos de diferentes
	autores que realizan dicha cuantificaci&oacute;n en base a las
	fuentes de costes y beneficios de cada uno de los participantes</P>
</UL>
<P>Invitamos a los lectores a experimentar con el simulador. En las
referencias se incluyen direcciones de p&aacute;ginas web donde se
puede jugar &quot;on-line&quot;, as&iacute; como foros de discusi&oacute;n
sobre la Teor&iacute;a de juegos, el modelo de desarrollo del
Software Libre, y diversos estudios matem&aacute;ticos y sociol&oacute;gicos</P>
<P><B><U>Referencias</U></B></P>
El CD-Rom que acompaña a la revista, incluye tanto el software descrito, como
los artículos citados a continuación
<UL>
	<LI><P>Felipe Perez: &quot;Altru&iacute;smo, Eficiencia y Bienes
	P&uacute;blicos&quot;. Resumenes de ponencias del Segundo Congreso
	Hispalinux. Madrid , 5 y 6 de Noviembre 1999</P>
	<LI><P>Paul Rosemberg: &quot;A Mathematical Analysis of the Bussines
	of Software&quot;</P>
	<LI><P>Juan Antonio Mart&iacute;nez: &quot;La Empresa ante el
	Software Libre&quot;</P>
	<LI><P>Eric S. Raymond: &quot;The Magic Cauldron&quot;</P>
	<LI><P>William Poundstone: &quot;El dilema del prisionero&quot;.
	Alianza Editorial. ISBN 84-206-0747-9</P>
	<LI><P>Fernando Savater: &quot;Etica como amor propio&quot;.
	Editorial Mondadori ISBN 84-397-0259-0</P>
	<LI><P><A HREF="http://www.lifl.fr/">http://www.lifl.fr/</A> (
	paginas web sobre Teor&iacute;a de Juegos )</P>
	<li><p><a href="http://sobre.ati.es">http://sobre.ati.es</a> ( Grupo
	de Software Libre de la Asociación de Técnicos informáticos ) </p>
</UL>
<P><BR><BR>
</P>
</BODY>
</HTML>
