<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Draft//EN">
<HTML>
<HEAD>
<TITLE>Art&iacute;culo para la revista Linux Actual n&uacute;mero 6: Auditores de Seguridad en GNU/Linux.</TITLE>
</HEAD>
<BODY>
<H1>Art&iacute;culo para la revista Linux Actual n&uacute;mero 6: Auditores de Seguridad en GNU/Linux.</H1>

<H2>Javier Fern&aacute;ndez-Sanguino Pe&ntilde;a 
<A HREF="jfs@computer.org">jfs@computer.org</A></H2>15 dic 1998
<P><HR>
<EM> Se ver&aacute;n las distintas herramientas disponibles para
comprobar la seguridad de un sistema GNU/Linux, herramientas que no
son espec&iacute;ficas de Linux y s&iacute; del mundo UNIX general, as&iacute; como las
facilidades y problemas de migrar estas herramientas al mundo Linux.</EM>
<HR>
<H2><A NAME="s1">1. Seguridad en GNU/Linux</A></H2>

<P>A veces se le ha atribuido al sistema GNU/Linux una escasez de
seguridad, a pesar de ser un sistema multiusuario real, y s&iacute; que han
existido conocidos agujeros de seguridad, no en el sistema en su
conjunto sino en diversas aplicaciones. El gestor de correo, enorme y
complejo, <EM>sendmail</EM> tiene el triste prestigio de ser un programa
en el que hab&iacute;a problemas de seguridad frecuentes. Este gestor no era
espec&iacute;fico de Linux, pero s&iacute; de sistemas UNIX en general.
<P>Por esto, y a pesar de que la respuesta de los desarrolladores de las
diversas distribuciones de GNU/Linux, y de los creadores de
aplicaciones ha sido siempre r&aacute;pida, es posible que en un sistema no
se tapen los agujeros de seguridad porque el administrador no ha tenido
tiempo de actualizar a la &uacute;ltima versi&oacute;n, no conoce de la existencia
de aqu&eacute;l, o no ha sabido configurar adecuadamente las aplicaciones o
servicios ofrecidos.
<P>
<P>Las distribuciones basadas en GNU/Linux ofrecen a sus usuarios una
gran cantidad de informaci&oacute;n en sus servidores de WWW referentes a
actualizaciones de paquetes que proporcionaban programas a los cuales
les ha sido detectado un posible peligro de seguridad. RedHat hace
esto frecuentemente, incluso se vi&oacute; obligada a sacar la versi&oacute;n 5.1 de
forma acelerada para tapar el gran n&uacute;mero de agujeros existentes en su
versi&oacute;n estrella, la 5.0. Debian tambi&eacute;n pone avisos de seguridad,
cuando son recibidos, relacionados con los programas que se ofrecen
dentro de la distribuci&oacute;n, aunque con su modelo de desarrollo m&aacute;s
abierto, ve&aacute;se por ejemplo el BTS (Bug Tracking System) consigue
ofrecer antes nuevas versiones de los programas con los problemas de
seguridad resueltos. As&iacute; mismo, Debian, con posterioridad a la salida
de la versi&oacute;n final de su distribuci&oacute;n, crea una nueva secci&oacute;n llamada
<EM>stable-updates</EM> que contiene actualizaciones a paquetes de la
versi&oacute;n estable en su mayor parte relacionadas con problemas de
seguridad.
<P>
<P>Sin embargo los problemas que dan lugar a que una determinada m&aacute;quina
est&eacute; "comprometida" no se limita exclusivamente a que se haya
instalado la &uacute;ltima versi&oacute;n de un determinado programa, tambi&eacute;n es
necesario cuidar la configuraci&oacute;n de ciertos programas, vigilar la
informaci&oacute;n ofrecida a los extra&ntilde;os y el contenido de los
diversos ficheros de un sistema.
<P>El sistema GNU/Linux se surte, desde sus principios, de los programas
surgidos dentro de la comunidad UNIX en muchos &aacute;mbitos, ya que &eacute;ste es
un sistema UNIX para PCs, como ya saben los lectores de la
revista. Desde gestores de correo, a servidores de ftp o servidores de
WWW, algunos de los existentes en GNU/Linux son, o provienen de,
programas dise&ntilde;ados en principio para otros sistemas UNIX, aunque con
el auge actual de GNU/Linux estos programas se dise&ntilde;an espec&iacute;ficamente
para Linux. Es por lo primero que los problemas de seguridad de estos
programas se pueden trasladar a una distribuci&oacute;n de GNU/Linux, pero
tambi&eacute;n es por esto que existen gran cantidad de auditores de
seguridad para Linux.
<P>Se tratar&aacute;n primero en este art&iacute;culo herramientas que no son
espec&iacute;ficas de GNU/Linux, sino del mundo UNIX en general, y tratando
de comentar las particularidades de aquellos en cuanto a GNU/Linux se
refiere. En el pr&oacute;ximo art&iacute;culo de la revista, en esta misma secci&oacute;n,
se comentar&aacute;n tambi&eacute;n herramientas exclusivas, surgidas
posteriormente, para GNU/Linux, y se incidir&aacute; en las facilidades (o
problemas) de portabilidad de estas herramientas a GNU/Linux.
<P>
<P>
<H2><A NAME="s2">2. ¿Qu&eacute; son los programas auditores de seguridad?</A></H2>

<P>
<P>Los programas auditores de seguridad son herramientas tremendamente
&uacute;tiles para la administraci&oacute;n de un sistema, ya que permiten detectar, de
forma rutinaria, problemas de seguridad para los que pudieran existir
ataques conocidos. 
<P>Un programa auditor de seguridad deber&iacute;a ser capaz
de detectarlos sin vulnerar la integridad del sistema, es decir, no
deber&iacute;a, por ejemplo, detectar que un sistema es vulnerable a un
ataque del tipo DoS (Denial of Service), dejando al sistema
"colgado". Este tipo de programas no sustituyen al sentido com&uacute;n ni a
la experiencia de un buen administrador, sino que suponen una ayuda
para realizar algunas tareas rutinarias que pueden llevar mucho tiempo
a un administrador normal.
<P>Estos programas  pueden operar a muchos niveles,
desde la comprobaci&oacute;n de la pertenencia de archivos a usuarios y
grupos del sistema hasta pruebas sobre aplicaciones instaladas para
verificar si &eacute;stas tienen agujeros conocidos. Una forma sencilla de
demonstrarlo ser&iacute;a, por ejemplo, mirar la versi&oacute;n de &eacute;sta &uacute;ltima, y
ver si se trata de una versi&oacute;n que tuviera un problema especialmente
grave.
<P>
<H2><A NAME="s3">3. Los precursores: COPS, Tiger, Tripwire e ISS</A></H2>

<P>Llamamos a estos programas precursores porque fueron los primeros que
empezaron a desarrollarse en la l&iacute;nea de automatizar las tareas del
administrador para vigilar la seguridad de la m&aacute;quina. Todos estos
sugieron en el mundo UNIX al principio de la decada de los 90, aunque
algunos se mantienen a&uacute;n hoy vigentes o han sido "remozados" para
adaptarlos a los nuevos tiempos.
<P>COPS (Computer Oracle and Password System) es un paquete de
herramientas de seguridad disponible de forma p&uacute;blica. Est&aacute;n dise&ntilde;adas
para ayudar a la tarea de un administrador identificando problemas de
seguridad en un sistema UNIX, aunque no pretende arreglar las
discrepancias que encuentra sino que simplemente produce un informe de
lo que ha encontrado y lo almacena o lo env&iacute;a por correo. COPS fue
realizado por Dan Farmer, uno de los creadores de SATAN y distribuido
el 31 de enero de 1989.
<P>El paquete se divide en dos partes: un conjunto de programas que
automatizan comprobaciones rutinarias y la documentaci&oacute;n para
manejarlo e interpretar su salida. COPS requiere ser ejecutado en cada
m&aacute;quina a chequear y es multiplataforma. El programa inicialmente fue
escrito en base a shell scripts (en el intento de asegurar la
portabilidad de &eacute;ste) y en programas en C (para aquellas acciones que
necesitan ejecutarse r&aacute;pidamente), la &uacute;ltima versi&oacute;n de este paquete
(1.0.4, 6 de marzo de 1992) est&aacute; realizada, adem&aacute;s, en Perl.
<P>COPS realiza un buen n&uacute;mero de comprobaciones, con la intenci&oacute;n de
buscar vulnerabilidades:
<UL>
<LI>chequeo de permisos de ficheros, directorios y dispositivos.</LI>
<LI>cracker de passwords a dos niveles, que de hecho ha sido
realizado usando el notorio <EM>Crack</EM> (ver m&aacute;s abajo).</LI>
<LI>comprobaci&oacute;n del contenido, formato y seguridad de los ficheros
de passwords y ge grupo.</LI>
<LI>chequeo de programas que se ejecutan en /etc/rc* y en el cron.</LI>
<LI>b&uacute;squeda de programas setuid root, con permiso de escritura y
avisa si son shell scripts.</LI>
<LI>comprobaci&oacute;n a trav&eacute;s CRC de binarios y ficheros importantes para evitar
modificaciones.</LI>
<LI>comprobaci&oacute;n de permisos de escritura en los directorios de los
usuarios y de sus ficheros de configuraci&oacute;n.</LI>
<LI>comprobacion autom&aacute;tica de avisos del CERT, descarg&aacute;ndolos
previamente y comprobando si existe alg&uacute;n aviso nuevo para el tipo de
m&aacute;quina sobre el que se ejecuta.</LI>
<LI>un sistema experto llamado Kuang que en base a una serie de
reglas indica si el sistema ha sido o no comprometido.</LI>
<LI>chequeos varios: directorios en el patg, hosts.equiv,
exportaciones por NFS...</LI>
</UL>
<P>Dado que no realiza ninguna modificaci&oacute;n, no necesita ser ejecutado
con privilegios de superusuario (como "root") sino que lo puede
ejecutar cualquier usuario. Eso s&iacute;, para descubir parte de la
informaci&oacute;n, como por ejemplo analizar todos los ficheros con el bit
setuid, puede que sea necesario ejecutarlo como superusuario ya que
puede que algunos ficheros (o directorios) no tengan permisos de
lectura para todo el mundo.
<P>Junto con COPS se distribuye CARP (COPS Analysis and Reporting
Program), programa que realiza informes gr&aacute;ficos en base a los
resultados de COPS.
<P>Tiger es similar a COPS, pues se dedica a conseguir informaci&oacute;n que
pueda descubrir problemas de seguridad en m&aacute;quinas UNIX pero est&aacute; m&aacute;s
actualizado que COPS y m&aacute;s configurable. La &uacute;ltima versi&oacute;n disponible
es de marzo de 1994.
<P>Tiger, que toma el nombre de un equipo de futbol americano, es un
conjunto de Bourne shell scripts, programas en C y ficheros de datos
que se usan para realizar una auditor&iacute;a de seguridad de sistemas
UNIX. Es multiplataforma, entre ellas SunOS 4.x y 5.x.
<P>Se desarroll&oacute; para escanear sistemas que se quer&iacute;an fueran accesibles
desde el exterior de un campus, y se ejecuta localmente.
<P>El objetivo primordial de Tiger es analizar el sistema para tratar de
encontrar maneras de obtener privilegios de superusuario. Su dise&ntilde;o
parte de la hip&oacute;tesis de que cualquier otro uid o gid puede ser
obtenido por personas no autorizadas, es decir, que cualquie persona
puede hacerse pasar por un usuario cualquiera de la m&aacute;quina, excepto,
por supuesto, por el superusuario.
<P>Algunos de los chequeos que reliza Tiger son:
<UL>
<LI>aliases de mail.</LI>
<LI>exportaci&oacute;n por NFS.</LI>
<LI>variables de inetd.</LI>
<LI>variables del PATH.</LI>
<LI>ficheros .rhosts y .netrc.</LI>
<LI>permisos de ficheros y directorios.</LI>
<LI>avisa de la existencia de parches de mantenimiento.</LI>
<LI>paths que se encuentren en ficheros que den alg&uacute;n warning.</LI>
<LI>ofrece ayuda sobre todos los temas.</LI>
<LI>lanza autom&aacute;ticamente el CRACK.</LI>
</UL>
<P>Tiger est&aacute; disponible para Linux 2.x, gracias al trabajo realizado por
Robert L. Ziegler, aunque la versi&oacute;n distribuida originalmente ten&iacute;a
soporte para Linux 0.99. Tiger tiene soporte para muchas
arquitecturas, en funci&oacute;n de la arquitectura sobre la que se ejecuta
se define las comprobaciones que va a realizar.
<P>
<P>Por otro lado tenemos a Tripwire, un programa que comprueba la
integridad de ficheros y directorios. Genera, en su primera pasada
informaci&oacute;n sobre &eacute;stos en una base de datos, y posteriormente los
comprueba y avisa de cualquier diferencia (incluso borrados y
a&ntilde;adidos). Ejecutado de manera regular permite encontrar cambios en
ficheros cr&iacute;ticos que podr&iacute;an haber tenido lugar por la entrada de un
"intruso".
<P>Lo que Tripwire hace es marcar en la base de datos tanto los permisos
y usuarios de los ficheros como un c&oacute;digo de redundancia c&iacute;clica (CRC)
con el que luego comprueba si ha sido modificado un determinado
fichero.  Este paquete est&aacute; disponible para Debian GNU/Linux existe un
paquete <EM>tripwire</EM> en su &uacute;ltima versi&oacute;n (slink) que est&aacute;
disponible para instalar.
<P>Finalmente dentro de este tipo de programas y en la misma &eacute;poca, se
encuentra el ISS (Internet Security Scanner), de Christoper Klaus. En
un principio el programa fue realizado por un inter&eacute;s, por parte del
autor, de conocer los problemas de seguridad en Internet en
1993. Posteriormente, el autor cre&oacute; una compa&ntilde;&iacute;a alrededor de este
producto, y distingui&oacute; la versi&oacute;n comercial de la versi&oacute;n de prueba,
que carece de interfaz gr&aacute;fico y de parte de la funcionalidad que
tiene la primera.
<P>En cualquier caso ISS se trata de una de las primeras herramientas
que, a pesar de carecer del interfaz gr&aacute;fico que luego proveer&aacute; SATAN
y otras herramientas posteriores, pone en marcha el desarrollo de
herramientas auditoras de seguridad de redes automatizadas. COPS,
TIGER y Tripwire constituyen el primer paso ya que se tratan de
herramientas que s&oacute;lo ven el sistema sobre el que se ejecutan y
comprueban las vulnerabilidades en &eacute;ste. ISS es capaz de comprobar
vulnerabilidades comunes en una o varias subrededes (en la l&iacute;nea de
comandos se le dar&aacute; un rango de una red que indica las m&aacute;quinas que debe
comprobar)
<P>ISS es un programa monol&iacute;tico escrito en C, que realiza comprobaciones
sobre los puertos abiertos en el servidor y de los
servicios RPC ofrecidos, estudio de las particiones exportadas por
NFS, observaci&oacute;n del servidor de correo, comprobaciones sobre el NIS
(antes llamado YP - Yellow Pages) y accesos mediante telnet haciendo
uso de pares de usuario/password comunes (que en algunos casos ven&iacute;an
de f&aacute;brica y no se modificaban).
<P>ISS se convierte as&iacute; en uno de los primeros programas que implementan
estas bater&iacute;as de pruebas, de forma que para un administrador resulta
m&aacute;s sencillo comprobar todas las m&aacute;quinas a su cargo de un s&oacute;lo
vistazo. M&aacute;s tarde, aunque muy cercano en el tiempo, llegar&iacute;a SATAN,
causando una aut&eacute;ntica revoluci&oacute;n.
<P>
<H2><A NAME="s4">4. SATAN</A></H2>

<P>SATAN es el acr&oacute;nimo de Security Administrator Tool for Analyzing
Networks (ver listado 1 
). Se trata, m&aacute;s que de un
programa, de un conjunto de programas unidos en un interfaz
com&uacute;n. Cuando &eacute;ste fue escrito por Dan Farmen (programador de COPS) y
Wietse Venema de la Universidad de Tecnolog&iacute;a de Eindhoven, lo que se
hizo fue poner una interfaz gr&aacute;fica que ya se preve&iacute;a poderosa, y al
mismo tiempo "amigable", como es el WWW a un conjunto de programas,
algunos ya existentes y otros creados de cero por sus autores, que
probaban vulnerabilidades conocidas.
<P>SATAN no es una herramienta novedosa en el aspecto t&eacute;cnico, pero caus&oacute;
una aut&eacute;ntica revoluci&oacute;n. Las herramientas de este tipo, pueden
convertirse, como todas las herramientas, en utensilios &uacute;tiles o en
armas mort&iacute;feras. Los autores tuvieron la "osad&iacute;a", entonces, de poner
el resultado de su trabajo en Internet y permitiendo la distribuci&oacute;n
libre de binarios y fuentes. Hab&iacute;a otros programas disponibles
libremente como COPS, para probar vulnerabilidades en un s&oacute;lo sistema,
o el ISS, para probarlas en sistemas remotos, pero este &uacute;ltimo, por
ejemplo, carec&iacute;a de suficiente funcionalidad y de un interfaz gr&aacute;fico
en la versi&oacute;n p&uacute;blica, aunque s&iacute; en la versi&oacute;n comercial. Los autores
decidieron distribuirlo de forma libre ya que su experiencia les
indicaba que los esfuerzos de limitar la distribuci&oacute;n de informaci&oacute;n
de seguridad y herramientas para este fin no hab&iacute;a mejorado las cosas,
dado que los elementos "no deseables" los consegu&iacute;an de todas formas y
las personas que deber&iacute;an haber tenido acceso a ellas no lo hab&iacute;an
tenido debido a limitaciones arbitrarias o injustas.
<P>Esto tuvo como consecuencia una grave pol&eacute;mica, por la cual incluso
uno de los creadores fue despedido de su trabajo. SATAN fue concebida
como una herramienta para admininistradores, pero tambi&eacute;n pod&iacute;a ser
usada como un arma por crackers. Incluso se dise&ntilde;aron programas para
detectar "ataques" de SATAN, como por ejemplo Courtney (desarollado
por CIAC) o Gabriel.
<P>El problema entonces, y tambi&eacute;n ahora, es que la mayor parte de los
administradores de sistemas no eran capaces de estar al tanto del
conjunto de agujeros de seguridad que sal&iacute;an en programas de uso
frecuente en muchos sistemas UNIX. Un cracker, bien informado, pod&iacute;a
hacer uso de estas vulnerabilidades reconocidas (pero a&uacute;n no
resueltas), para atacar a sistemas que a&uacute;n no se hab&iacute;an actualizado a
una versi&oacute;n del programa que resolviera los fallos. 
<P>En un sistema concurren muchos servicios que se "ven" en el exterior,
como por ejemplo: servidores de WWW, de correo o de FTP, gestores de
bases de datos, exportaci&oacute;n de discos via NFS, etc... Estar al tanto
de actualizaciones de todos estos y de la forma en que pueden ser
usados para obtener informaci&oacute;n de un servidor que puede servir e
intentar acceder a &eacute;ste puede ocupar gran parte del tiempo de un
administrador de sistemas.
<P>Estar al tanto de listas de distribuci&oacute;n como bugtrack, los avisos del
CERT  no es f&aacute;cil y,
adem&aacute;s, si no se hace de forma cont&iacute;nua se puede dejar un "agujero"
que un intruso puede intentar aprovechar.
<P>SATAN abri&oacute; la pol&eacute;mica al poner en manos de todo el mundo un
programa, de f&aacute;cil uso, que descubriera todas estas vulnerabilidades a
un tiempo, a la vez que pon&iacute;a al descubierto informaci&oacute;n sobre
las relaciones entre m&aacute;quinas, lo que los autores denominaron
"relaci&oacute;n de Confianza".
<P>SATAN obtiene tanta informaci&oacute;n como le es posible de servicios de red
como finger, NFS, NIS, ftp y tftp, rexd, y otros. La informaci&oacute;n
extra&iacute;da no s&oacute;lo indica las fuentes por las que un intruso podr&iacute;a
ganar informaci&oacute;n del sistema, sino tambi&eacute;n fallos potenciales de
seguridad generalmente debidos a una mala configuraci&oacute;n de estos
servicios, problemas conocidos en herramientas de red o malas
pol&iacute;ticas de seguridad.
<P>Pero el concepto novedoso de SATAN es el extraer, de la informaci&oacute;n
inicial y con un conjunto de reglas configurables por el usuario, las
relaciones de dependencia entre m&aacute;quinas o  servicios dados de una a
otra. Esto hace posible el an&aacute;lisis de todos los servidores de una red
para analizar las implicaciones de la pol&iacute;tica de confianza y
servicios ofrecidos que, en palabras de los autores "les permitar&aacute;n
hacer decisiones razonables sobre el nivel de seguridad de los
sistemas involucrados". Los autores de SATAN hablan de confianza
cuando recursos locales de un servidor (discos duros, acceso de
usuarios, servidores de X...) son usados por un cliente con o sin la
autorizaci&oacute;n debida. Si el sistema X conf&iacute;a en el Y, un intruso que
pueda poner en peligro Y podr&aacute; tambi&eacute;n poner en peligro X. Los autores
indican que cualquier tipo de confianza puede ser subvertida, no s&oacute;lo
porque se pueda acceder a Y, sino porque el sistema que valida el
acceso de Y pueda estar fuera del control del administrador. Por
ejemplo, si se identifica a Y por el nombre de la m&aacute;quina y se
subvierte el servidor de nombres (el DNS), o si se hace uso de la
t&eacute;cnica de IP spoofing para hacerle creer a X que otra
m&aacute;quina es Y.
<P>A este respecto los autores de SATAN escribieron un excelente ensayo
sobre seguridad en sistemas UNIX y en Internet en general que se
titula "Improving the Security of Your Site by Breaking Into It"
("Mejorar la seguridad de su servidor entrando a la fuerza en &eacute;l"),
lectura recomendable para todos aquellos interesados en seguridad 
<P>
<P>Hay que decir que SATAN es una herramienta que podr&iacute;a considerarse ya
obsoleta, las vulnerabilidades que intenta descubrir, eran comunes (y
conocidas) cuando fue dise&ntilde;ada, pero se tratan de "agujeros" que, hoy
por hoy, deber&iacute;an estar "tapados", si se detecta algunos de estos es
debido a una incompetencia por parte del administrador de la
m&aacute;quina. Sin embargo, donde a&uacute;n s&iacute; resulta &uacute;til SATAN es en la funci&oacute;n
de recopilaci&oacute;n de informaci&oacute;n y en la aplicabilidad del concepto de
confianza.
<P>
<H2><A NAME="s5">5. Ejecuci&oacute;n de SATAN</A></H2>

<P>SATAN debe ser ejecutado como usuario <EM>root</EM> (superusuario) ya
que algunos de los tests que realiza necesita los requisitos de este
usuario para funcionar (ver listado 2 . Hace uso, por ejemplo, de sockets abri&eacute;ndolos como SOCK_RAW, para
hacer accesos a bajo nivel de &eacute;stos. Es posible ejecutar SATAN como
cualquier otro usuario, pero algunos de los tests, no funcionar&aacute;n en
absoluto.
<P>Han existido algunos problemas a este respecto en la distribuci&oacute;n de
SATAN, ya que si el programa se ejecuta como superusuario, y el c&oacute;digo
fuente est&aacute; disponible, es posible que alg&uacute;n desaprensivo distribuya
una versi&oacute;n de SATAN "modificada" de forma que, al ejecutarla,
se introducir&iacute;a un troyano en el sistema, es decir, la copia modificada
realiza m&aacute;s de lo que deber&iacute;a, enviando informaci&oacute;n, por ejemplo, de
nuestro sistema al exterior. Por ello es una buena medida obtener
SATAN directamente de la fuente original y comprobar que no ha sido
modificado (mediante la suma MD5 del fichero recibido)
<P>Para ejecutar SATAN hace falta Perl 5 (en este lenguaje est&aacute;n
programados los scripts que generan las p&aacute;ginas autom&aacute;ticamente y
algunos de los tests) y un navegador de WWW, bien sea textual (Lynx) o
gr&aacute;fico (Netscape Navigator o similares, para m&aacute;s navegadores ver el
art&iacute;culo "Navegadores de WWW para GNU/Linux", aparecido en Linux
Actual n&uacute;mero 3). Los programas que realizan las tareas de prueba
sobre los diversos sistemas se escribieron en C, perl o lenguaje de la
shell, utilizando c&oacute;digo disponible en los grupos de noticias
(comp.sources.misc.*), y de hecho es posible a&ntilde;adir nuevos programas a
todo el conjunto de la herramienta. Otras herramientas posteriores,
como SAINT, que se comentar&aacute;n m&aacute;s adelante, o NESSUS, que se comentar&aacute;
en un art&iacute;culo en el pr&oacute;ximo n&uacute;mero de la revista, hacen m&aacute;s f&aacute;cil el
introducir nuevos programas mediante la descripci&oacute;n de reglas.
<P>
<P>Cuando se arranca el programa, &eacute;ste obtiene la configuraci&oacute;n de los
ficheros localizados en el directorio <EM>config/</EM>. Estos ficheros
indican d&oacute;nde se encuentran herramientas habituales en entornos UNIX
(como <EM>finger</EM> o <EM>ping</EM>) as&iacute; como el navegador de WWW
que se utilizar&aacute; (almacenado en la variable <EM>$MOSAIC</EM>). Estas
herramientas ser&aacute;n utilizados por los diversos programas de los que
est&aacute; compuesto SATAN, y se pueden configurar a mano o bien utilizando
el <EM>script</EM> proporcionado por los autores (reconfig), que busca la
localizaci&oacute;n de estas utilidades en el servidor en el que se instale SATAN.
<P>Seguidamente, lanzar&aacute; un servidor de WWW y el navegador de WWW que se
haya configurado para acceder directamente a la p&aacute;gina principal de
SATAN. Desde &eacute;sta se seleccionar&aacute; 'Run SATAN', posteriormente
el servidor al que va a acceder, se podr&aacute; limitar si
se va a probar sobre el servidor o sobre su subred, el
nivel del esc&aacute;ner y finalmente  'Start the
scan'. El acceso al servidor de WWW creado por SATAN (y que se
encuentra en un puerto dedicado, en el espacio de usuario, esto es,
por encima del 1024), se realiza mediante una llave de un s&oacute;lo uso que
SATAN genera para cada ejecuci&oacute;n. Dado que esta llave se guarda en los
ficheros HTML generados por SATAN, es importante que estos ficheros
tengan permisos de lectura s&oacute;lo para el superusuario y no para
otros. Si no fuera as&iacute;, cualquier usuario podr&iacute;a acceder al servidor
de WWW con la clave proporcionada en ellos y acceder a toda la
informaci&oacute;n disponible sobre los esc&aacute;ners realizados por el
superusuario mientras SATAN est&aacute; siendo ejecutado.
<P>
<P>En la selecci&oacute;n de Objetivos el usuario puede seleccionar el nivel de
ataque: Ligero, Normal o Duro. Un ataque "Ligero" s&oacute;lo indicar&aacute; los
servidores que existen y qu&eacute; servicios de RPC (llamada remota a
procedimiento) ofrecen. Un ataque "Normal" escanear&aacute; los objetivos
probando conexiones telnnt, FTP, WWW, gopher y SMTP. Se utilizar&aacute; para
establecer qu&eacute; sistema operativo es (aunque para esto es mejor QueSO,
ver listado 3 ). Un ataque "Duro" buscar&aacute; otras
vulnerabilidades, como servidores de FTP que permiten escribir a todos
los usuarios o servidores de confianza.
<P>
<P>SATAN puede ejecutarse con diversas opciones que indiquen qu&eacute; servidor/es
probar y el nivel de ataque a utilizar, as&iacute; como limitaciones en el
n&uacute;mero de servidores a probar. Adem&aacute;s muestra de forma gr&aacute;fica los resultados
ordenando las vulnerabilidades por tipos, organizadas de muy diversas
maneras (por nivel de riesgo, por sistema operativo...), aunque los
autores indican que un trabajo a realizar ser&iacute;a mostrar de forma m&aacute;s
gr&aacute;fica (quiz&aacute;s a trav&eacute;s de un grafo) las interrelaciones entre los
servidores.  Existen adem&aacute;s tutoriales que dan informaci&oacute;n m&aacute;s en
detalle de los problemas concretos de algunas de las vulnerabilidades,
que son &uacute;tiles para que el administrador busque m&aacute;s informaci&oacute;n antes
de tomar una decisi&oacute;n sobre c&oacute;mo arreglar el problema.
<P>Toda la informaci&oacute;n recopilada sobre las distintas m&aacute;quinas se
almacena en una base de datos (se puede tener m&aacute;s de una base de datos
sobre m&aacute;quinas), que se mantiene entre ejecuciones del programa, y es
&uacute;til para inferir relaciones entre m&aacute;quinas que las pueda hacer vulnerables.
<P>Adem&aacute;s SATAN es configurable con reglas (en el directorio <EM>facts/</EM>) que
le permiten inferir nueva informaci&oacute;n y detonar nuevos tests en
funci&oacute;n de los servicios que se ofrezcan. Estas reglas est&aacute;n escritas
en Perl y, a trav&eacute;s de ellas se puede extender el programa con nuevos
tests. De hecho la decisi&oacute;n de qu&eacute; test realizar en funci&oacute;n de la
informaci&oacute;n recibida se encuentra en estas reglas.
<P>
<P>
<H2><A NAME="s6">6. Compilar SATAN para Linux</A></H2>

<P>SATAN no fue desarrollado originalmente para GNU/Linux, sino que su
documentaci&oacute;n indica que funciona en una gran variedad de sistemas
UNIX: SunOS 4.x y 5.x, AIX, IRIX5, HP-UX 9.x, SYSV-R4 y Ultrix
4.x. Sus autores destacan que hace falta modificarlo para hacerlo
funcionar bajo GNU/Linux.
<P>De hecho es as&iacute;, siendo necesario modificar los ficheros que se incluyen
al compilar el c&oacute;digo fuente para hacerlo funcionar con la versi&oacute;n de
la librer&iacute;a de C de GNU/Linux. Aunque los cambios difieren para libc5
y para libc6, b&aacute;sicamente debido a la redefinici&oacute;n de la
implementaci&oacute;n de los formatos de paquete de IP e ICMP en la librer&iacute;a
est&aacute;ndar. Esto se puede arreglar modificando el fichero
<EM>lcompat.h</EM> (que funciona para libc5) y comentando toda la
definici&oacute;n del paquete ip e icmp, para dejar que sea la librer&iacute;a de C
(viene definido en el fichero <EM>/usr/include/netinet/ip.h</EM>) la
que los defina. Asimismo se puede eliminar las referencias en el
c&oacute;digo fuente a la librer&iacute;a proporcionada en el paquete, si se dispone
de las cabeceras de la librer&iacute;a de C (en Debian las proporciona el
paquete libc6-dev) para compilar el programa. En la versi&oacute;n que se
distribuye en el CD las cabeceras de las librer&iacute;as proporcionadas por
los autores han sido modifcadas por las cabeceras de la libc6, a&uacute;n as&iacute;
tambi&eacute;n se entrega un fichero (satan-lib.diff.linux) con las
diferencias entre ambas.
<P>Finalmente, para adaptarse a los "nuevos tiempos" y usar los m&oacute;dulos
de Perl instalados en el sistema en lugar de los proporcionados por el
programa (como es el caso del m&oacute;dulo que proporciona en Perl la
funci&oacute;n <EM>getopts</EM> o <EM>ctime</EM>), es necesario cambiar
ligeramente el programa principal (<EM>satan</EM>) y algunos de los
tests, que est&aacute;n escritos en Perl.
<P>
<P>Tambi&eacute;n los autores asumen el comportamiento de la llamada al sistema
<EM>select</EM> (que sirve para quedarse a la espera de recibir datos
en diversos descriptores) y se ha de modificar el fichero
<EM>tcp_scan.c</EM> que es el responsable de escanear todos los
puertos TCP disponibles en un servidor.
<P>Todos estos cambios se han realizado en la versi&oacute;n de SATAN
distribuida en el CD, aunque para beneficio de los lectores se ha
incluido un fichero que indica todas estas diferencias
(satan-1.1.1.diff.linux). Haciendo uso de estos ficheros (realizados
con el programa <EM>diff</EM>) se podr&iacute;an modificar las fuentes
originales (haciendo uso del programa <EM>patch</EM>, ver p&aacute;gina de manual).
<P>En general, un usuario que instale SATAN dentro de una distribuci&oacute;n de
GNU/Linux no tendr&aacute; que resolver estos problemas, dado que los
responsables de la distribuci&oacute;n, presumiblemente, los habr&aacute;n resuelto
para que se integre dentro de &eacute;sta. Sin embargo no est&aacute; de m&aacute;s
conocerlo, caso de que se desee obtener SATAN de la fuente original y
recompilarlo antes de usarlo, algo bastante aconsejable dado el hecho
de que va a ser el usuario con los m&aacute;ximos privilegios el que va a
hacer uso de &eacute;ste.
<P>Para compilar SATAN para Linux, una vez realizados los cambios arriba
indicados, es necesario, desde el directorio ra&iacute;z, ejecutar <EM>make
linux</EM> seguido de <EM>perl reconfig</EM>. Posteriormente se puede
configurar los valores que ha obtenido autom&aacute;ticamente editando
directamente, como ya se ha dicho antes, los ficheros en el
subdirectorio <EM>config/</EM>.
<P>
<H2><A NAME="s7">7. SAINT</A></H2>

<P>SAINT (Security Administrator's Integrated Network Tool) es un
producto de World Wide Digital Solutions Inc. (WWDSI) derivado de
SATAN, realizado en 1998, no se distribuye bajo la misma licencia sino
bajo una realizada por la compa&ntilde;&iacute;a. Esta nueva licencia no permite su
distribuci&oacute;n por parte de aquellos que lo obtienen ni modificaciones
fuera del uso interno de una compa&ntilde;&iacute;a que haga uso de este.
<P>Las diferencias con SATAN en cuanto a interfaz son m&iacute;nimas, ambos
hacen uso de un navegador de WWW, y los pasos a dar para poner en
marcha el programa son los mismos.
<P>SAINT a&ntilde;ade a SATAN lo que &eacute;ste ahora mismo no tiene y es actualidad.
El programa no s&oacute;lo prueba las vulnerabilidades que contemplaba SATAN,
sino que a&ntilde;ade comprobaciones de las vulnerabilidades conocidas hasta la
fecha de su creaci&oacute;n. Los tests incluyen comprobaciones sobre
servidores de WWW, POP o SMB (ver art&iacute;culo sobre Samba en el n&uacute;mero 1
de Linux Actual), y nuevas reglas para dirigir el funcionamiento de
&eacute;ste. Adem&aacute;s, la compa&ntilde;&iacute;a que lo dise&ntilde;&oacute; lo actualiza con cierta
regularidad.
<P>A todo esto hay que a&ntilde;adir muchos nuevos tutoriales, hasta un total de
43, sobre las distintas vulnerabilidades que se puedan encontrar, que
ayudan al administrador d&aacute;ndole m&aacute;s informaci&oacute;n sobre el peligro de
&eacute;sta y sobre c&oacute;mo eliminarlo. Las vulnerabilidades est&aacute;n clasificadas
en tres categor&iacute;as: Peligrosas (rojo), Proceder con Cautela (amarillo)
o de Categor&iacute;a Desconocida (marrones), no en dos como en SATAN.
<P>SAINT demuestra que es posible realizar un producto comercial sobre un
producto que se distribuye de forma gratuita, y con excelentes resultados.
<P>
<P>
<P>
<H2><A NAME="s8">8. Resumen</A></H2>

<P>
<P>En este art&iacute;culo se han visto algunas herramientas de seguridad &uacute;tiles
para los sistemas GNU/Linux, si bien algunas de ellas primitivas. As&iacute;
como algunos de los problemas de utilizar estar herramientas bajo
GNU/Linux, en el pr&oacute;ximo art&iacute;culo se estudiar&aacute;n con m&aacute;s detenimiento
algunas herramientas similares, nacidas para GNU/Linux, como es el
caso de NESSUS (ver 
<A HREF="http://www.nessus.org">http://www.nessus.org</A>) y otras
herramientas relacionadas con auditor&iacute;as de seguridad disponibles en
el mundo UNIX.
<P>
<H2><A NAME="s9">9. Sumarios</A></H2>

<P>
<P>Es posible que existan agujeros de seguridad debido a la mala
administraci&oacute;n.
<P>Las distribuciones basadas en GNU/Linux dan mucha informaci&oacute;n relativa
a seguridad.
<P>Los programas auditores de seguridad ayudan a detectar
vulnerabilidades.
<P>COPS y Tiger comprueban la integridad del sistema haciendo chequeos
sobre &eacute;ste.
<P>SATAN es un conjunto de programas para comprobar la seguridad de
servidores remotos.
<P>SATAN caus&oacute; una aut&eacute;ntica revoluci&oacute;n por poner a disposici&oacute;n de todos
una herramienta poderosa.
<P>Existen programas para detectar ataques de SATAN.
<P>Es dif&iacute;cil mantenerse al tanto de todos los problemas de seguridad de
los programas.
<P>
<P>SATAN debe ser ejecutado como superusuario.
<P>Para ejecutar SATAN en Linux es necesario adaptarlo adecuadamente.
<P>SAINT es un desarrollo comercial realizado sobre SATAN.
<P>
<P>En un pr&oacute;ximo art&iacute;culo se estudiar&aacute;n otros programas de seguridad.
<P>
<P>
<H2><A NAME="s10">10. Listados</A></H2>

<P>
<P>
<P>
<P>
<P>LISTADO 1-
<P>Existen ciertas curiosidades relacionadas con SATAN, que se reflejan
aqu&iacute; para informaci&oacute;n de los lectores.
<P>La imagen de SATAN, un personaje humanoide con una cara ca&oacute;tica y
extra&ntilde;a, no ha sido fruto de la imaginaci&oacute;n de sus programadores. Se
trata de una aportaci&oacute;n del dibujante Neil Gaiman, autor del comic
Sandman, al proyecto. El boceto original, firmado por &eacute;ste, forma
parte de la distribuci&oacute;n de SATAN.
<P>
<P>************* INSERTAR IMAGEN DE SATAN ****************
<P>El nombre SATAN tambi&eacute;n puede resultar ofensivo a algunas personas,
los programadores, para evitar discrepancias aunque piensan que el
nombre del programa se ajusta muy bien a su herramienta, facilitaron
el que se pudiera cambiar el nombre de &eacute;ste. Existe un programa en la
distribuci&oacute;n de SANTA <EM>repent</EM> (arrepentir) que, si se ejecuta,
cambia todas las menciones del angel ca&iacute;do a SANTA (Security Analysis
Network Tool for Administrators).
<P>Otra curiosidad algo m&aacute;s molesta es que debido al modelo de dise&ntilde;o de
SATAN, las p&aacute;ginas de WWW vistas en el navegador son en realidad
scripts en Perl que ejecuta &eacute;ste. Por ello la extensi&oacute;n de todas estas
p&aacute;ginas es <EM>.pl</EM> esto puede causar problemas en navegadores que
tengan configurado esta extensi&oacute;n como un tipo MIME determinado
(application/x-perl). El navegador de Netscape, por ejemplo, por no
saber qu&eacute; hacer con este tipo de documentos pedir&aacute; al usuario un lugar
donde guardarlos. Desde luego &eacute;ste no es el comportamiento deseado, ya
que uno quiere ver el resultado directamente sobre el navegador. Para
conseguir esto, es necesario ir (en el Navigator) al men&uacute; de
Preferencias/Aplicaciones, eliminar el tipo MIME asociado a la
extensi&oacute;n <EM>pl</EM> y a&ntilde;adir dentro de los documentos del tipo
<EM>text/html</EM> (que son interpretados por el navegador) la
extensi&oacute;n <EM>pl</EM>. En el Communicator se ha de modificar esto en el
men&uacute; Preferencias/Avanzadas/Aplicaciones.
<P>Esto se debe a que cuando Dan Farmer y Wietse Venema dise&ntilde;aron SATAN,
a&uacute;n no estaba extendido el uso de tipos MIME para todo y tampoco, desde
luego, estaba asignado esta extensi&oacute;n al lenguaje Perl ya que por
entonces andaba en sus or&iacute;genes y no se hab&iacute;a extendido tanto como
hasta ahora.
<P>
<P>PIE LISTADO 1: Curiosidades de SATAN 
<A NAME="satan-curiosidad"></A> <P>
<P>LISTADO 2-
<P>Es un riesgo indudable ejecutar binarios como superusuario, aunque es
algo de lo m&aacute;s com&uacute;n para muchos usuarios, que encuentran que un
determinado programa no se ejecuta como usuario normal y s&iacute;  lo
ejecutan como superusuario. Es el caso, por ejemplo, de muchos juegos
que hacen uso de la librer&iacute;a <EM>svgalib</EM>, ya que para el manejo a
bajo nivel del hardware (indispensable en muchos juegos) hace falta
ejecutar el juego como root (o poner &eacute;ste <EM>setuid</EM>).
<P>En el caso de SATAN se conoce una distribuci&oacute;n de binarios de la
versi&oacute;n de este para Linux que era en realidad un troyano. Realizaba
todas las funciones de SATAN perfectamente pero el que la distribuy&oacute;
a&ntilde;adi&oacute; c&oacute;digo que pon&iacute;a en compromiso el sistema en el que fuera
ejecutado. Curiosamente, aquella persona (que dicho sea de paso perdi&oacute;
su trabajo por su "haza&ntilde;a") tambi&eacute;n distribuy&oacute; el c&oacute;digo fuente, que
se puede poner como ejemplo de un troyano.
<P>Los cambios al c&oacute;digo ten&iacute;an lugar en el programa <EM>fping</EM>, al que
a&ntilde;ad&iacute;a una nueva funci&oacute;n llamada <EM>backdoor()</EM> que era ejecutada por
<EM>main()</EM> despu&eacute;s de comprobar que hab&iacute;a sido ejecutada por el
superusuario. Esta funci&oacute;n ten&iacute;a como tarea a&ntilde;adir un nuevo usuario a
la base de datos de usuarios (el fichero <EM>/etc/passwd</EM>), llamado
suser despu&eacute;s de comprobar que no exist&iacute;a. Posteriormente hace
setuid el binario <EM>fping</EM>, y abre una conexi&oacute;n remota a un servidor
cuyos ficheros de registro eran accesibles por todo el mundo. Se
conecta a un puerto abierto por el demonio <EM>inetd</EM>, que no est&aacute;
conectado a ninguna aplicaci&oacute;n, pero que sin embargo se registra como
acceso. Esto posiblemente lo hac&iacute;a para poder ver quienes ejecutaban
esta versi&oacute;n "modificada" de SATAN, y poder acceder a ellos como
usuario 'suser' y con la password conocida. 
<P>La segunda parte del troyano, dentro del c&oacute;digo de <EM>fping</EM> en la
funci&oacute;n main, hac&iacute;a que, si &eacute;ste era ejecutado por el usuario 'suser'
y fijaba una determinada variable de entorno, el programa
inmediatamente arrancaba una shell. Dado que el programa ahora ten&iacute;a
setuid del superusuario (si era el propietario del fichero) lo que
se obten&iacute;a al ejectuar <EM>fping</EM> con esta modificaci&oacute;n que era una shell
de root.
<P>El c&oacute;digo de este troyano, comentado por ldoolit@cebaf.gov, est&aacute;
disponible en el CD de la revista, junto a la distribuci&oacute;n de SATAN.
<P>PIE LISTADO 2: El problema de la ejecuci&oacute;n de binarios como root
<P>
<P>LISTADO 3-
<P>Los programas auditores de seguridad vistos utilizan m&eacute;todos
rudimentarios para "adivinar" el sistema operativo que utiliza la
m&aacute;quina sobre la que se est&aacute;n haciendo los tests. NESSUS (como se ver&aacute;
en el pr&oacute;ximo art&iacute;culo), por ejemplo, lo hace en base a dos
conexiones: una conexi&oacute;n al puerto de FTP (21) y otra al puerto de
telnet (23- login remoto). Con la primera identifica si es un sistema
Windows o un UNIX, bas&aacute;ndose en la cadena de bienvenida recibida; si
contiene a la palabra "Microsoft" se trata de un NT y si contiene la
palabra "wu-" decide que es un UNIX (el servidor <EM>wu-ftp</EM>, es el
m&aacute;s utilizado en el mundo UNIX). Mirando en el puerto de telnet busca
determinadas cadenas de caracteres para adivinar si es un Linux, IRIX,
FreeBSD, etc.. Esto est&aacute; implementado como un "plugin" llamado
<EM>guess_os</EM>.
<P>SATAN implementa algo parecido en su lista de reglas
<EM>rules/hosttype</EM>, en la que simplemente busca expresiones
regulares en las respuestas de los programas que utiliza para
monitorizar el servidor remoto y en funci&oacute;n de &eacute;stas decide si es un
SGI, SUN, APOLLO, VMS, Linux..
<P>Ambos m&eacute;todos pueden ser enga&ntilde;ados por un administrador que cambie las
cabeceras de sus servicios para indentificarse de forma distinta, y
adem&aacute;s fallar&aacute;n si no existe ning&uacute;n servicio que proporcione esta
informaci&oacute;n textual.
<P>Un m&eacute;todo t&eacute;cnicamente m&aacute;s avanzado, y con m&aacute;s estilo, es el
implementado por QueSO de Jordi Murgo. Se trata de una idea apuntada por otros
programas como por ejemplo <EM>tft</EM> de Lamont Granquist (enviado a
rootshell el 7 de julio de 1998), que realiza pruebas sobre la
respuesta de una m&aacute;quina a las 64 "banderas" del protocolo TCP. 
<P>QueSO (tambi&eacute;n llamado WathOS) identifica el sistema operativo en
funci&oacute;n de la implementaci&oacute;n TCP/IP; en particular en funci&oacute;n de la
respuesta a paquetes "extra&ntilde;os" cuyo comportamiento no est&aacute; definido
en ning&uacute;n RFC y por tanto cuya respuesta depende de la programaci&oacute;n de
la pila de protocolos en el sistema operativo concreto. En total
env&iacute;a siete paquetes, y compara la respuesta con una base de datos de
respuestas t&iacute;picas por sistemas operativos entregada con el programa.
<P>El programa est&aacute; disponible en c&oacute;digo fuente, bajo la licencia GNU en
<A HREF="http://apostols.org/projectz/queso/">http://apostols.org/projectz/queso/</A>, ha sido
programado por un espa&ntilde;ol y es capaz de reconocer entre m&aacute;s de ochenta
implementaciones distintas en diversos sistemas operativos.
<P>PIE LISTADO 3: QueSO, un programa que indica el SO 
<A NAME="queso"></A> <P>LISTADO 4
<P>En el CD se han incluido todas las herramientas comentadas en el
art&iacute;culo y las que se ver&aacute;n el siguiente, al menos aquellas cuya
licencia permite su distribuci&oacute;n en dicho CD. Est&aacute;n en el
subdirectorio <EM>la6/security</EM>. Asimismo, y por considerarlo de
inter&eacute;s para los lectores, se han incluido tambi&eacute;n otras herramientas
de seguridad de sistemas UNIX en general y GNU/Linux en particular,
haciendo una r&eacute;plica de los servidores de sunsite (ahora
metalab.unc.edu) y de CIAC.
<P>Con intenci&oacute;n de hacer m&aacute;s accesible la instalaci&oacute;n de estos paquetes,
el autor ha creado, un paquete para Debian GNU/Linux que
permite instalar la &uacute;ltima version de SATAN (1.1.1). Este paquete,
ofrecido en primicia para los lectores de Linux Actual, formar&aacute;, si
es posible, parte de la distribuci&oacute;n de Debian en un futuro. Est&aacute;
localizado en el directorio <EM>debian/</EM>.
<P>
<P>PIE LISTADO 4: Contenido del CD
<P>
<P>
<H2><A NAME="s11">11. Capturas</A></H2>

<P>
<P>Capturas incluidas con el articulo y sus pies de p&aacute;ginas:
<P>- satan-cara.gif: CARA del personaje del programa SATAN (insertar en el listado 1)
- satan-main.gif: "Paso 1: P&aacute;gina inicial de SATAN."
<P>
<P>- saint-main.gif: P&aacute;gina inicial de SAINT.
<P>
<P>- satan-select.gif: "Paso 2: Selecci&oacute;n de servidor sobre el que realizar los
tests."
<P>- satan-data.gif: "Paso 3: Recolecci&oacute;n de datos realizada por SATAN"
<P>- satan-result.gif: "Paso 4: Resultados de SATAN para un servidor."
<P>- satan-result2.gif: "Paso 5: Resultados de SATAN ordenados por tipo de servicios."
<P>
<P>
<P>
<P>
<H2><A NAME="s12">12. Notas de maquetaci&oacute;n</A></H2>

<P>
<P>Las capturas de SATAN conviene que est&eacute;n alineadas en la misma
posici&oacute;n de la p&aacute;ginas, porque son consecutivas es decir, primero va
satan-main, luego satan-select, despu&eacute;s satan-data y luego
satan-result y satan-result2.
<P>La captura de la "cara" de SATAN debe ir dentro del listado en el que
se indica.
<P>AVISO!: Si las capturas se reducen mucho es posible que no se pueda leer (no
lo se), si es as&iacute; contactar con el autor y pedir capturas nuevas
relacionadas con el art&iacute;culo. Sustituir&eacute; las capturas del
funcionamiento del Programa por otras.
<P>
<H2><A NAME="s13">13. Notas de coordinaci&oacute;n</A></H2>

<P>
<P>Este art&iacute;culo ir&aacute; seguido de otro contando nuevas cosas al respecto,
ya que el art&iacute;culo original era demasiado largo (11 p&aacute;ginas). As&iacute; que
el siguiente que ser&aacute; entregado m&aacute;s tarde tendr&aacute; las cosas a las que
se alude en &eacute;ste (NESSUS y m&aacute;s cosas), aun as&iacute; los contenidos en el CD
son del total de los dos art&iacute;culos (salvo una sorpresa que me reservo
para el siguiente)
<P>En resumen, para LA7 reservar 5 p&aacute;ginas para la continuaci&oacute;n.
<P>No hay problema en eliminar listados si la maquetaci&oacute;n lo precisa (se
incluir&iacute;an en el siguiente), pero se DEBEN mirar las referencias que
haya a &eacute;stos en el art&iacute;culo. En cualquier caso NUNCA quitar el listado
4, y si es posible, el 1. El orden de preferencia para la inclusi&oacute;n de
listados es: 4, 1, 2, y 3.
<P>
</BODY>
</HTML>
