<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Draft//EN">
<HTML>
<HEAD>
<TITLE>Art&iacute;culo para la revista Linux Actual n&uacute;mero 6: Auditores de Seguridad en GNU/Linux.</TITLE>
</HEAD>
<BODY>
<H1>Art&iacute;culo para la revista Linux Actual n&uacute;mero 6: Auditores de Seguridad en GNU/Linux.</H1>

<H2>Javier Fern&aacute;ndez-Sanguino Pe&ntilde;a 
<A HREF="jfs@computer.org">jfs@computer.org</A></H2>15 dic 1998
<P><HR>
<EM> Se ver&aacute;n las distintas herramientas disponibles para
comprobar la seguridad de un sistema GNU/Linux, herramientas que no
son espec&iacute;ficas de Linux y s&iacute; del mundo UNIX general, as&iacute; como las
facilidades y problemas de migrar estas herramientas al mundo Linux.</EM>
<HR>
<H2><A NAME="s1">1. Seguridad en GNU/Linux</A></H2>

<P>A veces se le ha atribuido al sistema GNU/Linux una escasez de
seguridad, a pesar de ser un sistema multiusuario real, y s&iacute; que han
existido conocidos agujeros de seguridad, no en el sistema en su
conjunto sino en diversas aplicaciones. El gestor de correo, enorme y
complejo, <EM>sendmail</EM> tiene el triste prestigio de ser un programa
en el que hab&iacute;a problemas de seguridad frecuentes. Este gestor no era
espec&iacute;fico de Linux, pero s&iacute; de sistemas UNIX en general.
<P>Por esto, y a pesar de que la respuesta de los desarrolladores de las
diversas distribuciones de GNU/Linux, y de los creadores de
aplicaciones ha sido siempre r&aacute;pida, es posible que en un sistema no
se tapen los agujeros de seguridad porque el administrador no ha tenido
tiempo de actualizar a la &uacute;ltima versi&oacute;n, no conoce de la existencia
de aqu&eacute;l, o no ha sabido configurar adecuadamente las aplicaciones o
servicios ofrecidos.
<P>
<P>Las distribuciones basadas en GNU/Linux ofrecen a sus usuarios una
gran cantidad de informaci&oacute;n en sus servidores de WWW referentes a
actualizaciones de paquetes que proporcionaban programas a los cuales
les ha sido detectado un posible peligro de seguridad. RedHat hace
esto frecuentemente, incluso se vi&oacute; obligada a sacar la versi&oacute;n 5.1 de
forma acelerada para tapar el gran n&uacute;mero de agujeros existentes en su
versi&oacute;n estrella, la 5.0. Debian tambi&eacute;n pone avisos de seguridad,
cuando son recibidos, relacionados con los programas que se ofrecen
dentro de la distribuci&oacute;n, aunque con su modelo de desarrollo m&aacute;s
abierto, ve&aacute;se por ejemplo el BTS (Bug Tracking System) consigue
ofrecer antes nuevas versiones de los programas con los problemas de
seguridad resueltos. As&iacute; mismo, Debian, con posterioridad a la salida
de la versi&oacute;n final de su distribuci&oacute;n, crea una nueva secci&oacute;n llamada
<EM>stable-updates</EM> que contiene actualizaciones a paquetes de la
versi&oacute;n estable en su mayor parte relacionadas con problemas de
seguridad.
<P>Sin embargo los problemas que dan lugar a que una determinada m&aacute;quina
est&eacute; "comprometida" no se limita exclusivamente a que se haya
instalado la &uacute;ltima versi&oacute;n de un determinado programa, tambi&eacute;n es
necesario cuidar la configuraci&oacute;n de ciertos programas, vigilar la
informaci&oacute;n ofrecida a los extra&ntilde;os y el contenido de los
diversos ficheros de un sistema.
<P>El sistema GNU/Linux se surte, desde sus principios, de los programas
surgidos dentro de la comunidad UNIX en muchos &aacute;mbitos, ya que &eacute;ste es
un sistema UNIX para PCs, como ya saben los lectores de la
revista. Desde gestores de correo, a servidores de ftp o servidores de
WWW, algunos de los existentes en GNU/Linux son, o provienen de,
programas dise&ntilde;ados en principio para otros sistemas UNIX, aunque con
el auge actual de GNU/Linux estos programas se dise&ntilde;an espec&iacute;ficamente
para Linux. Es por lo primero que los problemas de seguridad de estos
programas se pueden trasladar a una distribuci&oacute;n de GNU/Linux, pero
tambi&eacute;n es por esto que existen gran cantidad de auditores de
seguridad para Linux.
<P>Se tratar&aacute;n primero en este art&iacute;culo herramientas que no son
espec&iacute;ficas de GNU/Linux, sino del mundo UNIX en general, y tratando de
comentar las particularidades de aquellos en cuanto a GNU/Linux se
refiere, incidiendo en las facilidades (o problemas) de portabilidad
de estas herramientas a GNU/Linux. Se comentar&aacute;n tambi&eacute;n herramientas
exclusivas, surgidas posteriormente, para GNU/Linux.
<P>
<P>
<H2><A NAME="s2">2. ¿Qu&eacute; son los programas auditores de seguridad?</A></H2>

<P>
<P>Los programas auditores de seguridad son herramientas tremendamente
&uacute;tiles para la administraci&oacute;n de un sistema, ya que permiten detectar, de
forma rutinaria, problemas de seguridad para los que pudieran existir
ataques conocidos. 
<P>Un programa auditor de seguridad deber&iacute;a ser capaz
de detectarlos sin vulnerar la integridad del sistema, es decir, no
deber&iacute;a, por ejemplo, detectar que un sistema es vulnerable a un
ataque del tipo DoS (Denial of Service), dejando al sistema
"colgado". Este tipo de programas no sustituyen al sentido com&uacute;n ni a
la experiencia de un buen administrador, sino que suponen una ayuda
para realizar algunas tareas rutinarias que pueden llevar mucho tiempo
a un administrador normal.
<P>Estos programas  pueden operar a muchos niveles,
desde la comprobaci&oacute;n de la pertenencia de archivos a usuarios y
grupos del sistema hasta pruebas sobre aplicaciones instaladas para
verificar si &eacute;stas tienen agujeros conocidos. Una forma sencilla de
demonstrarlo ser&iacute;a, por ejemplo, mirar la versi&oacute;n de &eacute;sta &uacute;ltima, y
ver si se trata de una versi&oacute;n que tuviera un problema especialmente
grave.
<P>
<H2><A NAME="s3">3. Los precursores: COPS, Tiger, Tripwire e ISS</A></H2>

<P>Llamamos a estos programas precursores porque fueron los primeros que
empezaron a desarrollarse en la l&iacute;nea de automatizar las tareas del
administrador para vigilar la seguridad de la m&aacute;quina. Todos estos
sugieron en el mundo UNIX al principio de la decada de los 90, aunque
algunos se mantienen a&uacute;n hoy vigentes o han sido "remozados" para
adaptarlos a los nuevos tiempos.
<P>COPS (Computer Oracle and Password System) es un paquete de
herramientas de seguridad disponible de forma p&uacute;blica. Est&aacute;n dise&ntilde;adas
para ayudar a la tarea de un administrador identificando problemas de
seguridad en un sistema UNIX, aunque no pretende arreglar las
discrepancias que encuentra sino que simplemente produce un informe de
lo que ha encontrado y lo almacena o lo env&iacute;a por correo. COPS fue
realizado por Dan Farmer, uno de los creadores de SATAN y distribuido
el 31 de enero de 1989.
<P>El paquete se divide en dos partes: un conjunto de programas que
automatizan comprobaciones rutinarias y la documentaci&oacute;n para
manejarlo e interpretar su salida. COPS requiere ser ejecutado en cada
m&aacute;quina a chequear y es multiplataforma. El programa inicialmente fue
escrito en base a shell scripts (en el intento de asegurar la
portabilidad de &eacute;ste) y en programas en C (para aquellas acciones que
necesitan ejecutarse r&aacute;pidamente), la &uacute;ltima versi&oacute;n de este paquete
(1.0.4, 6 de marzo de 1992) est&aacute; realizada, adem&aacute;s, en Perl.
<P>COPS realiza un buen n&uacute;mero de comprobaciones, con la intenci&oacute;n de
buscar vulnerabilidades:
<UL>
<LI>chequeo de permisos de ficheros, directorios y dispositivos.</LI>
<LI>cracker de passwords a dos niveles, que de hecho ha sido
realizado usando el notorio <EM>Crack</EM> (ver m&aacute;s abajo).</LI>
<LI>comprobaci&oacute;n del contenido, formato y seguridad de los ficheros
de passwords y ge grupo.</LI>
<LI>chequeo de programas que se ejecutan en /etc/rc* y en el cron.</LI>
<LI>b&uacute;squeda de programas setuid root, con permiso de escritura y
avisa si son shell scripts.</LI>
<LI>comprobaci&oacute;n a trav&eacute;s CRC de binarios y ficheros importantes para evitar
modificaciones.</LI>
<LI>comprobaci&oacute;n de permisos de escritura en los directorios de los
usuarios y de sus ficheros de configuraci&oacute;n.</LI>
<LI>comprobacion autom&aacute;tica de avisos del CERT, descarg&aacute;ndolos
previamente y comprobando si existe alg&uacute;n aviso nuevo para el tipo de
m&aacute;quina sobre el que se ejecuta.</LI>
<LI>un sistema experto llamado Kuang que en base a una serie de
reglas indica si el sistema ha sido o no comprometido.</LI>
<LI>chequeos varios: directorios en el patg, hosts.equiv,
exportaciones por NFS...</LI>
</UL>
<P>Dado que no realiza ninguna modificaci&oacute;n, no necesita ser ejecutado
con privilegios de superusuario (como "root") sino que lo puede
ejecutar cualquier usuario. Eso s&iacute;, para descubir parte de la
informaci&oacute;n, como por ejemplo analizar todos los ficheros con el bit
setuid, puede que sea necesario ejecutarlo como superusuario ya que
puede que algunos ficheros (o directorios) no tengan permisos de
lectura para todo el mundo.
<P>Junto con COPS se distribuye CARP (COPS Analysis and Reporting
Program), programa que realiza informes gr&aacute;ficos en base a los
resultados de COPS.
<P>Tiger es similar a COPS, pues se dedica a conseguir informaci&oacute;n que
pueda descubrir problemas de seguridad en m&aacute;quinas UNIX pero est&aacute; m&aacute;s
actualizado que COPS y m&aacute;s configurable. La &uacute;ltima versi&oacute;n disponible
es de marzo de 1994.
<P>Tiger, que toma el nombre de un equipo de futbol americano, es un
conjunto de Bourne shell scripts, programas en C y ficheros de datos
que se usan para realizar una auditor&iacute;a de seguridad de sistemas
UNIX. Es multiplataforma, entre ellas SunOS 4.x y 5.x.
<P>Se desarroll&oacute; para escanear sistemas que se quer&iacute;an fueran accesibles
desde el exterior de un campus, y se ejecuta localmente.
<P>El objetivo primordial de Tiger es analizar el sistema para tratar de
encontrar maneras de obtener privilegios de superusuario. Su dise&ntilde;o
parte de la hip&oacute;tesis de que cualquier otro uid o gid puede ser
obtenido por personas no autorizadas, es decir, que cualquie persona
puede hacerse pasar por un usuario cualquiera de la m&aacute;quina, excepto,
por supuesto, por el superusuario.
<P>Algunos de los chequeos que reliza Tiger son:
<UL>
<LI>aliases de mail.</LI>
<LI>exportaci&oacute;n por NFS.</LI>
<LI>variables de inetd.</LI>
<LI>variables del PATH.</LI>
<LI>ficheros .rhosts y .netrc.</LI>
<LI>permisos de ficheros y directorios.</LI>
<LI>avisa de la existencia de parches de mantenimiento.</LI>
<LI>paths que se encuentren en ficheros que den alg&uacute;n warning.</LI>
<LI>ofrece ayuda sobre todos los temas.</LI>
<LI>lanza autom&aacute;ticamente el CRACK.</LI>
</UL>
<P>Tiger est&aacute; disponible para Linux 2.x, gracias al trabajo realizado por
Robert L. Ziegler, aunque la versi&oacute;n distribuida originalmente ten&iacute;a
soporte para Linux 0.99. Tiger tiene soporte para muchas
arquitecturas, en funci&oacute;n de la arquitectura sobre la que se ejecuta
se define las comprobaciones que va a realizar.
<P>
<P>Por otro lado tenemos a Tripwire, un programa que comprueba la
integridad de ficheros y directorios. Genera, en su primera pasada
informaci&oacute;n sobre &eacute;stos en una base de datos, y posteriormente los
comprueba y avisa de cualquier diferencia (incluso borrados y
a&ntilde;adidos). Ejecutado de manera regular permite encontrar cambios en
ficheros cr&iacute;ticos que podr&iacute;an haber tenido lugar por la entrada de un
"intruso".
<P>Lo que Tripwire hace es marcar en la base de datos tanto los permisos
y usuarios de los ficheros como un c&oacute;digo de redundancia c&iacute;clica (CRC)
con el que luego comprueba si ha sido modificado un determinado
fichero.  Este paquete est&aacute; disponible para Debian GNU/Linux existe un
paquete <EM>tripwire</EM> en su &uacute;ltima versi&oacute;n (slink) que est&aacute;
disponible para instalar.
<P>Finalmente dentro de este tipo de programas y en la misma &eacute;poca, se
encuentra el ISS (Internet Security Scanner), de Christoper Klaus. En
un principio el programa fue realizado por un inter&eacute;s, por parte del
autor, de conocer los problemas de seguridad en Internet en
1993. Posteriormente, el autor cre&oacute; una compa&ntilde;&iacute;a alrededor de este
producto, y distingui&oacute; la versi&oacute;n comercial de la versi&oacute;n de prueba,
que carece de interfaz gr&aacute;fico y de parte de la funcionalidad que
tiene la primera.
<P>En cualquier caso ISS se trata de una de las primeras herramientas
que, a pesar de carecer del interfaz gr&aacute;fico que luego proveer&aacute; SATAN
y otras herramientas posteriores, pone en marcha el desarrollo de
herramientas auditoras de seguridad de redes automatizadas. COPS,
TIGER y Tripwire constituyen el primer paso ya que se tratan de
herramientas que s&oacute;lo ven el sistema sobre el que se ejecutan y
comprueban las vulnerabilidades en &eacute;ste. ISS es capaz de comprobar
vulnerabilidades comunes en una o varias subrededes (en la l&iacute;nea de
comandos se le dar&aacute; un rango de una red que indica las m&aacute;quinas que debe
comprobar)
<P>ISS es un programa monol&iacute;tico escrito en C, que realiza comprobaciones
sobre los puertos abiertos en el servidor y de los
servicios RPC ofrecidos, estudio de las particiones exportadas por
NFS, observaci&oacute;n del servidor de correo, comprobaciones sobre el NIS
(antes llamado YP - Yellow Pages) y accesos mediante telnet haciendo
uso de pares de usuario/password comunes (que en algunos casos ven&iacute;an
de f&aacute;brica y no se modificaban).
<P>ISS se convierte as&iacute; en uno de los primeros programas que implementan
estas bater&iacute;as de pruebas, de forma que para un administrador resulta
m&aacute;s sencillo comprobar todas las m&aacute;quinas a su cargo de un s&oacute;lo
vistazo. M&aacute;s tarde, aunque muy cercano en el tiempo, llegar&iacute;a SATAN,
causando una aut&eacute;ntica revoluci&oacute;n.
<P>
<H2><A NAME="s4">4. SATAN</A></H2>

<P>SATAN es el acr&oacute;nimo de Security Administrator Tool for Analyzing
Networks (ver listado 2 
). Se trata, m&aacute;s que de un
programa, de un conjunto de programas unidos en un interfaz
com&uacute;n. Cuando &eacute;ste fue escrito por Dan Farmen (programador de COPS) y
Wietse Venema de la Universidad de Tecnolog&iacute;a de Eindhoven, lo que se
hizo fue poner una interfaz gr&aacute;fica que ya se preve&iacute;a poderosa, y al
mismo tiempo "amigable", como es el WWW a un conjunto de programas,
algunos ya existentes y otros creados de cero por sus autores, que
probaban vulnerabilidades conocidas.
<P>SATAN no es una herramienta novedosa en el aspecto t&eacute;cnico, pero caus&oacute;
una aut&eacute;ntica revoluci&oacute;n. Las herramientas de este tipo, pueden
convertirse, como todas las herramientas, en utensilios &uacute;tiles o en
armas mort&iacute;feras. Los autores tuvieron la "osad&iacute;a", entonces, de poner
el resultado de su trabajo en Internet y permitiendo la distribuci&oacute;n
libre de binarios y fuentes. Hab&iacute;a otros programas disponibles
libremente como COPS, para probar vulnerabilidades en un s&oacute;lo sistema,
o el ISS, para probarlas en sistemas remotos, pero este &uacute;ltimo, por
ejemplo, carec&iacute;a de suficiente funcionalidad y de un interfaz gr&aacute;fico
en la versi&oacute;n p&uacute;blica, aunque s&iacute; en la versi&oacute;n comercial. Los autores
decidieron distribuirlo de forma libre ya que su experiencia les
indicaba que los esfuerzos de limitar la distribuci&oacute;n de informaci&oacute;n
de seguridad y herramientas para este fin no hab&iacute;a mejorado las cosas,
dado que los elementos "no deseables" los consegu&iacute;an de todas formas y
las personas que deber&iacute;an haber tenido acceso a ellas no lo hab&iacute;an
tenido debido a limitaciones arbitrarias o injustas.
<P>Esto tuvo como consecuencia una grave pol&eacute;mica, por la cual incluso
uno de los creadores fue despedido de su trabajo. SATAN fue concebida
como una herramienta para admininistradores, pero tambi&eacute;n pod&iacute;a ser
usada como un arma por crackers. Incluso se dise&ntilde;aron programas para
detectar "ataques" de SATAN, como por ejemplo Courtney (desarollado
por CIAC) o Gabriel.
<P>El problema entonces, y tambi&eacute;n ahora, es que la mayor parte de los
administradores de sistemas no eran capaces de estar al tanto del
conjunto de agujeros de seguridad que sal&iacute;an en programas de uso
frecuente en muchos sistemas UNIX. Un cracker, bien informado, pod&iacute;a
hacer uso de estas vulnerabilidades reconocidas (pero a&uacute;n no
resueltas), para atacar a sistemas que a&uacute;n no se hab&iacute;an actualizado a
una versi&oacute;n del programa que resolviera los fallos. 
<P>En un sistema concurren muchos servicios que se "ven" en el exterior,
como por ejemplo: servidores de WWW, de correo o de FTP, gestores de
bases de datos, exportaci&oacute;n de discos via NFS, etc... Estar al tanto
de actualizaciones de todos estos y de la forma en que pueden ser
usados para obtener informaci&oacute;n de un servidor que puede servir e
intentar acceder a &eacute;ste puede ocupar gran parte del tiempo de un
administrador de sistemas.
<P>Estar al tanto de listas de distribuci&oacute;n como bugtrack, los avisos
del CERT  (para m&aacute;s informaci&oacute;n ver listado 6 ) no es f&aacute;cil y, adem&aacute;s, si no se hace de forma
cont&iacute;nua se puede dejar un "agujero" que un intruso puede intentar
aprovechar.
<P>SATAN abri&oacute; la pol&eacute;mica al poner en manos de todo el mundo un
programa, de f&aacute;cil uso, que descubriera todas estas vulnerabilidades a
un tiempo, a la vez que pon&iacute;a al descubierto informaci&oacute;n sobre
las relaciones entre m&aacute;quinas, lo que los autores denominaron
"relaci&oacute;n de Confianza".
<P>SATAN obtiene tanta informaci&oacute;n como le es posible de servicios de red
como finger, NFS, NIS, ftp y tftp, rexd, y otros. La informaci&oacute;n
extra&iacute;da no s&oacute;lo indica las fuentes por las que un intruso podr&iacute;a
ganar informaci&oacute;n del sistema, sino tambi&eacute;n fallos potenciales de
seguridad generalmente debidos a una mala configuraci&oacute;n de estos
servicios, problemas conocidos en herramientas de red o malas
pol&iacute;ticas de seguridad.
<P>Pero el concepto novedoso de SATAN es el extraer, de la informaci&oacute;n
inicial y con un conjunto de reglas configurables por el usuario, las
relaciones de dependencia entre m&aacute;quinas o  servicios dados de una a
otra. Esto hace posible el an&aacute;lisis de todos los servidores de una red
para analizar las implicaciones de la pol&iacute;tica de confianza y
servicios ofrecidos que, en palabras de los autores "les permitar&aacute;n
hacer decisiones razonables sobre el nivel de seguridad de los
sistemas involucrados". Los autores de SATAN hablan de confianza
cuando recursos locales de un servidor (discos duros, acceso de
usuarios, servidores de X...) son usados por un cliente con o sin la
autorizaci&oacute;n debida. Si el sistema X conf&iacute;a en el Y, un intruso que
pueda poner en peligro Y podr&aacute; tambi&eacute;n poner en peligro X. Los autores
indican que cualquier tipo de confianza puede ser subvertida, no s&oacute;lo
porque se pueda acceder a Y, sino porque el sistema que valida el
acceso de Y pueda estar fuera del control del administrador. Por
ejemplo, si se identifica a Y por el nombre de la m&aacute;quina y se
subvierte el servidor de nombres (el DNS), o si se hace uso de la
t&eacute;cnica de IP spoofing para hacerle creer a X que otra
m&aacute;quina es Y.
<P>A este respecto los autores de SATAN escribieron un excelente ensayo
sobre seguridad en sistemas UNIX y en Internet en general que se
titula "Improving the Security of Your Site by Breaking Into It"
("Mejorar la seguridad de su servidor entrando a la fuerza en &eacute;l"),
lectura recomendable para todos aquellos interesados en seguridad (ver
)
<P>
<P>Hay que decir que SATAN es una herramienta que podr&iacute;a considerarse ya
obsoleta, las vulnerabilidades que intenta descubrir, eran comunes (y
conocidas) cuando fue dise&ntilde;ada, pero se tratan de "agujeros" que, hoy
por hoy, deber&iacute;an estar "tapados", si se detecta algunos de estos es
debido a una incompetencia por parte del administrador de la
m&aacute;quina. Sin embargo, donde a&uacute;n s&iacute; resulta &uacute;til SATAN es en la funci&oacute;n
de recopilaci&oacute;n de informaci&oacute;n y en la aplicabilidad del concepto de
confianza.
<P>
<H2><A NAME="s5">5. Ejecuci&oacute;n de SATAN</A></H2>

<P>SATAN debe ser ejecutado como usuario <EM>root</EM> (superusuario) ya
que algunos de los tests que realiza necesita los requisitos de este
usuario para funcionar. Hace uso, por ejemplo, de sockets
abri&eacute;ndolos como SOCK_RAW, para hacer accesos a bajo nivel de
&eacute;stos. Es posible ejecutar SATAN como cualquier otro usuario, pero
algunos de los tests, no funcionar&aacute;n en absoluto.
<P>Han existido algunos problemas a este respecto en la distribuci&oacute;n de
SATAN, ya que si el programa se ejecuta como superusuario, y el c&oacute;digo
fuente est&aacute; disponible, es posible que alg&uacute;n desaprensivo distribuya
una versi&oacute;n de SATAN "modificada" de forma que, al ejecutarla,
se introducir&iacute;a un troyano en el sistema, es decir, la copia modificada
realiza m&aacute;s de lo que deber&iacute;a, enviando informaci&oacute;n, por ejemplo, de
nuestro sistema al exterior. Por ello es una buena medida obtener
SATAN directamente de la fuente original y comprobar que no ha sido
modificado (mediante la suma MD5 del fichero recibido)
<P>Para ejecutar SATAN hace falta Perl 5 (en este lenguaje est&aacute;n
programados los scripts que generan las p&aacute;ginas autom&aacute;ticamente y
algunos de los tests) y un navegador de WWW, bien sea textual (Lynx) o
gr&aacute;fico (Netscape Navigator o similares, para m&aacute;s navegadores ver el art&iacute;culo
"Navegadores de WWW para GNU/Linux", aparecido en Linux Actual n&uacute;mero
3). Los programas que realizan las tareas de prueba sobre los diversos
sistemas se escribieron en C, perl o lenguaje de la shell, utilizando
c&oacute;digo disponible en los grupos de noticias (comp.sources.misc.*), y
de hecho es posible a&ntilde;adir nuevos programas a todo el conjunto de la
herramienta. Otras herramientas posteriores, como SAINT o NESSUS, que
se comentar&aacute;n m&aacute;s adelante, hacen m&aacute;s f&aacute;cil el introducir nuevos
programas mediante la descripci&oacute;n de reglas.
<P>
<P>Cuando se arranca el programa, &eacute;ste obtiene la configuraci&oacute;n de los
ficheros localizados en el directorio <EM>config/</EM>. Estos ficheros
indican d&oacute;nde se encuentran herramientas habituales en entornos UNIX
(como <EM>finger</EM> o <EM>ping</EM>) as&iacute; como el navegador de WWW
que se utilizar&aacute; (almacenado en la variable <EM>$MOSAIC</EM>). Estas
herramientas ser&aacute;n utilizados por los diversos programas de los que
est&aacute; compuesto SATAN, y se pueden configurar a mano o bien utilizando
el <EM>script</EM> proporcionado por los autores (reconfig), que busca la
localizaci&oacute;n de estas utilidades en el servidor en el que se instale SATAN.
<P>Seguidamente, lanzar&aacute; un servidor de WWW y el navegador de WWW que se
haya configurado para acceder directamente a la p&aacute;gina principal de
SATAN. Desde &eacute;sta se seleccionar&aacute; 'Run SATAN', posteriormente
el servidor al que va a acceder, se podr&aacute; limitar si
se va a probar sobre el servidor o sobre su subred, el
nivel del esc&aacute;ner y finalmente  'Start the
scan'. El acceso al servidor de WWW creado por SATAN (y que se
encuentra en un puerto dedicado, en el espacio de usuario, esto es,
por encima del 1024), se realiza mediante una llave de un s&oacute;lo uso que
SATAN genera para cada ejecuci&oacute;n. Dado que esta llave se guarda en los
ficheros HTML generados por SATAN, es importante que estos ficheros
tengan permisos de lectura s&oacute;lo para el superusuario y no para
otros. Si no fuera as&iacute;, cualquier usuario podr&iacute;a acceder al servidor
de WWW con la clave proporcionada en ellos y acceder a toda la
informaci&oacute;n disponible sobre los esc&aacute;ners realizados por el
superusuario mientras SATAN est&aacute; siendo ejecutado.
<P>
<P>En la selecci&oacute;n de Objetivos el usuario puede seleccionar el nivel de
ataque: Ligero, Normal o Duro. Un ataque "Ligero" s&oacute;lo indicar&aacute; los
servidores que existen y qu&eacute; servicios de RPC (llamada remota a
procedimiento) ofrecen. Un ataque "Normal" escanear&aacute; los objetivos
probando conexiones telnnt, FTP, WWW, gopher y SMTP. Se utilizar&aacute; para
establecer qu&eacute; sistema operativo es (aunque para esto es mejor QueSO,
ver listado 4). Un ataque "Duro" buscar&aacute; otras
vulnerabilidades, como servidores de FTP que permiten escribir a todos
los usuarios o servidores de confianza.
<P>
<P>SATAN puede ejecutarse con diversas opciones que indiquen qu&eacute; servidor/es
probar y el nivel de ataque a utilizar, as&iacute; como limitaciones en el
n&uacute;mero de servidores a probar. Adem&aacute;s muestra de forma gr&aacute;fica los resultados
ordenando las vulnerabilidades por tipos, organizadas de muy diversas
maneras (por nivel de riesgo, por sistema operativo...), aunque los
autores indican que un trabajo a realizar ser&iacute;a mostrar de forma m&aacute;s
gr&aacute;fica (quiz&aacute;s a trav&eacute;s de un grafo) las interrelaciones entre los
servidores.  Existen adem&aacute;s tutoriales que dan informaci&oacute;n m&aacute;s en
detalle de los problemas concretos de algunas de las vulnerabilidades,
que son &uacute;tiles para que el administrador busque m&aacute;s informaci&oacute;n antes
de tomar una decisi&oacute;n sobre c&oacute;mo arreglar el problema.
<P>Toda la informaci&oacute;n recopilada sobre las distintas m&aacute;quinas se
almacena en una base de datos (se puede tener m&aacute;s de una base de datos
sobre m&aacute;quinas), que se mantiene entre ejecuciones del programa, y es
&uacute;til para inferir relaciones entre m&aacute;quinas que las pueda hacer vulnerables.
<P>Adem&aacute;s SATAN es configurable con reglas (en el directorio <EM>facts/</EM>) que
le permiten inferir nueva informaci&oacute;n y detonar nuevos tests en
funci&oacute;n de los servicios que se ofrezcan. Estas reglas est&aacute;n escritas
en Perl y, a trav&eacute;s de ellas se puede extender el programa con nuevos
tests. De hecho la decisi&oacute;n de qu&eacute; test realizar en funci&oacute;n de la
informaci&oacute;n recibida se encuentra en estas reglas.
<P>
<P>
<H2><A NAME="s6">6. Compilar SATAN para Linux</A></H2>

<P>SATAN no fue desarrollado originalmente para GNU/Linux, sino que su
documentaci&oacute;n indica que funciona en una gran variedad de sistemas
UNIX: SunOS 4.x y 5.x, AIX, IRIX5, HP-UX 9.x, SYSV-R4 y Ultrix
4.x. Sus autores destacan que hace falta modificarlo para hacerlo
funcionar bajo GNU/Linux.
<P>De hecho es as&iacute;, siendo necesario modificar los ficheros que se incluyen
al compilar el c&oacute;digo fuente para hacerlo funcionar con la versi&oacute;n de
la librer&iacute;a de C de GNU/Linux. Aunque los cambios difieren para libc5
y para libc6, b&aacute;sicamente debido a la redefinici&oacute;n de la
implementaci&oacute;n de los formatos de paquete de IP e ICMP en la librer&iacute;a
est&aacute;ndar. Esto se puede arreglar modificando el fichero
<EM>lcompat.h</EM> (que funciona para libc5) y comentando toda la
definici&oacute;n del paquete ip e icmp, para dejar que sea la librer&iacute;a de C
(viene definido en el fichero <EM>/usr/include/netinet/ip.h</EM>) la
que los defina. Asimismo se puede eliminar las referencias en el
c&oacute;digo fuente a la librer&iacute;a proporcionada en el paquete, si se dispone
de las cabeceras de la librer&iacute;a de C (en Debian las proporciona el
paquete libc6-dev) para compilar el programa. En la versi&oacute;n que se
distribuye en el CD las cabeceras de las librer&iacute;as proporcionadas por
los autores han sido modifcadas por las cabeceras de la libc6, a&uacute;n as&iacute;
tambi&eacute;n se entrega un fichero (satan-lib.diff.linux) con las
diferencias entre ambas.
<P>Finalmente, para adaptarse a los "nuevos tiempos" y usar los m&oacute;dulos
de Perl instalados en el sistema en lugar de los proporcionados por el
programa (como es el caso del m&oacute;dulo que proporciona en Perl la
funci&oacute;n <EM>getopts</EM> o <EM>ctime</EM>), es necesario cambiar
ligeramente el programa principal (<EM>satan</EM>) y algunos de los
tests, que est&aacute;n escritos en Perl.
<P>
<P>Tambi&eacute;n los autores asumen el comportamiento de la llamada al sistema
<EM>select</EM> (que sirve para quedarse a la espera de recibir datos
en diversos descriptores) y se ha de modificar el fichero
<EM>tcp_scan.c</EM> que es el responsable de escanear todos los
puertos TCP disponibles en un servidor.
<P>Todos estos cambios se han realizado en la versi&oacute;n de SATAN
distribuida en el CD, aunque para beneficio de los lectores se ha
incluido un fichero que indica todas estas diferencias
(satan-1.1.1.diff.linux). Haciendo uso de estos ficheros (realizados
con el programa <EM>diff</EM>) se podr&iacute;an modificar las fuentes
originales (haciendo uso del programa <EM>patch</EM>, ver p&aacute;gina de manual).
<P>En general, un usuario que instale SATAN dentro de una distribuci&oacute;n de
GNU/Linux no tendr&aacute; que resolver estos problemas, dado que los
responsables de la distribuci&oacute;n, presumiblemente, los habr&aacute;n resuelto
para que se integre dentro de &eacute;sta. Sin embargo no est&aacute; de m&aacute;s
conocerlo, caso de que se desee obtener SATAN de la fuente original y
recompilarlo antes de usarlo, algo bastante aconsejable dado el hecho
de que va a ser el usuario con los m&aacute;ximos privilegios el que va a
hacer uso de &eacute;ste.
<P>Para compilar SATAN para Linux, una vez realizados los cambios arriba
indicados, es necesario, desde el directorio ra&iacute;z, ejecutar <EM>make
linux</EM> seguido de <EM>perl reconfig</EM>. Posteriormente se puede
configurar los valores que ha obtenido autom&aacute;ticamente editando
directamente, como ya se ha dicho antes, los ficheros en el
subdirectorio <EM>config/</EM>.
<P>
<H2><A NAME="s7">7. SAINT</A></H2>

<P>SAINT (Security Administrator's Integrated Network Tool) es un
producto de World Wide Digital Solutions Inc. (WWDSI) derivado de
SATAN, realizado en 1998, no se distribuye bajo la misma licencia sino
bajo una realizada por la compa&ntilde;&iacute;a. Esta nueva licencia no permite su
distribuci&oacute;n por parte de aquellos que lo obtienen ni modificaciones
fuera del uso interno de una compa&ntilde;&iacute;a que haga uso de este.
<P>Las diferencias con SATAN en cuanto a interfaz son m&iacute;nimas, ambos
hacen uso de un navegador de WWW, y los pasos a dar para poner en
marcha el programa son los mismos.
<P>SAINT a&ntilde;ade a SATAN lo que &eacute;ste ahora mismo no tiene y es actualidad.
El programa no s&oacute;lo prueba las vulnerabilidades que contemplaba SATAN,
sino que a&ntilde;ade comprobaciones de las vulnerabilidades conocidas hasta la
fecha de su creaci&oacute;n. Los tests incluyen comprobaciones sobre
servidores de WWW, POP o SMB (ver art&iacute;culo sobre Samba en el n&uacute;mero 1
de Linux Actual), y nuevas reglas para dirigir el funcionamiento de
&eacute;ste. Adem&aacute;s, la compa&ntilde;&iacute;a que lo dise&ntilde;&oacute; lo actualiza con cierta
regularidad.
<P>A todo esto hay que a&ntilde;adir muchos nuevos tutoriales, hasta un total de
43, sobre las distintas vulnerabilidades que se puedan encontrar, que
ayudan al administrador d&aacute;ndole m&aacute;s informaci&oacute;n sobre el peligro de
&eacute;sta y sobre c&oacute;mo eliminarlo. Las vulnerabilidades est&aacute;n clasificadas
en tres categor&iacute;as: Peligrosas (rojo), Proceder con Cautela (amarillo)
o de Categor&iacute;a Desconocida (marrones), no en dos como en SATAN.
<P>SAINT demuestra que es posible realizar un producto comercial sobre un
producto que se distribuye de forma gratuita, y con excelentes resultados.
<P>
<P>
<H2><A NAME="s8">8. NESSUS</A></H2>

<P>Se han visto herramientas, quiz&aacute;s ya algo antiguas, para intentar
introducir el concepto de auditores de seguridad. Ahora toca el turno
de hablar de una herramienta de &uacute;ltima generaci&oacute;n, y este es el caso
de NESSUS.
<P>NESSUS da un paso m&aacute;s alla en el dise&ntilde;o de herramientas de este
estilo. Con SATAN (y SAINT) se ha visto que se pod&iacute;a introducir
una gran capacidad para detectar fallos comunes haciendo uso de un
sencillo interfaz. Sin embargo, quiz&aacute;s el lector no se haya dado
cuenta, pero el uso de un interfaz WWW, aunque bueno por su facilidad de
manejo (y porque quiz&aacute;s sea el interfaz gen&eacute;rico m&aacute;s usado) plantea un
problema respecto a la autentificaci&oacute;n de los administradores que
hagan uso de SATAN en una m&aacute;quina.
<P>Por un lado obliga a que SATAN sea ejecutado localmente por parte del
administrador y a que luego &eacute;ste lanze el navegador en la misma
m&aacute;quina, de hecho es el primer paso que realiza SATAN. El problema
puede darse cuando se quiera instalar SATAN en una m&aacute;quina que carece
de interfaz gr&aacute;fico, es necesario exportar la aplicaci&oacute;n (el cliente
de WWW) a trav&eacute;s de la red a otra que s&iacute; lo tenga. Esto no es problema
si el administrador usa <EM>lynx</EM> ya que puede seguir utilizando
un interfaz textual para la aplicaci&oacute;n.
<P>Si se desea tambi&eacute;n acceder desde un servidor a otro para ejecutar
SATAN en aqu&eacute;l, es necesario que el navegador de WWW env&iacute;e en todas
las peticiones al servidor de WWW que SATAN lanza, el n&uacute;mero m&aacute;gico
que ha generado al arrancar y se encuentra almacenado en los ficheros
HTML. Por ello la primera petici&oacute;n del navegador es a un fichero (su
URL es file://) y posteriormente al servidor (con el URL
http://). Este n&uacute;mero es la &uacute;nica prueba para SATAN de que el cliente
es quien dice ser, si cualquier otro intercepta este n&uacute;mero y accede
al servidor de SATAN podr&aacute; acceder a toda la informaci&oacute;n almacenada en
este, e incluso ¡hacer sus propias pruebas de seguridad sobre otros
servidores! Esto se podr&iacute;a evitar haciendo uso del protocolo que se
usa en <EM>https</EM> (que usa el SSL de Netscape).
<P>Esta situaci&oacute;n no es del todo insospechada, ya que si el cliente y el
servidor est&aacute;n separados, los paquetes enviados de uno a otro, las
solicitudes HTTP y las respuestas mediante p&aacute;ginas en HTML, no est&aacute;n
cifradas. Cualquier "esp&iacute;a" en el camino de estos datos podr&iacute;a sacar
f&aacute;cilmente el n&uacute;mero utilizado.
<P>NESSUS es una herramienta que consta de dos m&oacute;dulos separados. De un
lado el servidor, que debe ser ejecutado como superusuario, que es el
encargado de realizar los tests y que funciona como un demonio en la
m&aacute;quina en la que se lanza, y en el otro  el cliente, que puede
estar en otra m&aacute;quina distinta. La comunicaci&oacute;n entre ambos se hace a
trav&eacute;s de un protocolo (que los autores han llamado NTP: Nessus
Transfer Protocol) que, con poco esfuerzo pues no est&aacute; as&iacute; a&uacute;n, podr&iacute;a
estar encriptado de forma que el servidor no podr&iacute;a ser usado por
alguien que "espiara" la red y fuera capaz de obtener la palabra clave
utilizada. Esta funcionalidad se prev&eacute; para la pr&oacute;xima versi&oacute;n que
estar&aacute; disponible a principios de Enero.
<P>Actualmente, sin embargo, la autenticaci&oacute;n entre el
cliente y el servidor se realiza mediante un nombre de usuario y una
palabra clave cuyo intercambio debe darse antes de solicitarle ninguna
acci&oacute;n al servidor. Las palabras clave est&aacute;n almacenadas en un fichero
en el servidor, y es posible limitar sobre qu&eacute; m&aacute;quinas puede realizar
pruebas de seguridad a un usuario dado.
<P>Existen clientes para GNU/Linux, usando la librer&iacute;a gr&aacute;fica <EM>gtk</EM>,
con la que se ha dise&ntilde;ado el famosos <EM>Gimp</EM>, pero tambi&eacute;n los hay
escritos en Java y para Windows NT. El servidor, sin embargo, ha de
ejecutarse en un servidor Linux. La interfaz gr&aacute;fica con <EM>gtk</EM> es
expl&eacute;ndida, con un buen aspecto y muy sencilla de manejar. Adem&aacute;s de
todo esto, NESSUS est&aacute; siendo desarrollado bajo la licencia GPL.
<P>
<P>El dise&ntilde;o de NESSUS, como se puede ver en el c&oacute;digo fuente, es muy
modular. Todos los tests (algunos los llamar&iacute;an "ataques") est&aacute;n
escritos por separado, y es f&aacute;cil insertar nuevos
programas. Actualmente tiene m&aacute;s de 120 pruebas de seguridad de diversa
&iacute;ndole, que el interfaz agrupa por tipos seg&uacute;n sean, por ejemplo:
agujeros de sendmail, problemas con servidores de FTP, problemas con
servidores de WWW... Aunque las vulnerabilidades no est&aacute;n tan
detalladas como en otras herramientas (ve&aacute;se las anteriores), si se da
una breve descripci&oacute;n del problema y una ayuda de c&oacute;mo solucionarlas.
<P>Al igual que SATAN o SAINT, NESSUS puede expandir los servidores que
conoce de varias maneras: v&iacute;a subredes de un dominio, haciendo uso del
DNS o cuando ve nuevos servidores a los que se les da acceso mediante
NFS. Se pueden definir reglas para limitar a los servidores que va a
acceder, de una forma m&aacute;s compleja que hac&iacute;a SATAN (y por ende SAINT),
en &eacute;ste es posible definir la "profundidad" de la prueba y servidores
que nunca ser&aacute;n probados, pero en NESSUS es posible limitar de tres
formas: no probar ('n'), s&iacute; probar ('y') y no probar <EM>nunca</EM>
('N'). Por ejemplo la regla: "n:*; y:*.foo.org; N:ppp*.foo.org"
probar&iacute;a s&oacute;lo sobre las m&aacute;quinas en el dominio foo.org (y:*.foo.org),
excepto todas las m&aacute;quinas en este dominio cuyo nombre empezara por
ppp (N:ppp*.foo.org), otras m&aacute;quinas que se puedan encontrar no ser&aacute;n
probadas (n:*).
<P>Los usuarios puede definir sus propias reglas, aunque existen unas
reglas predefinidas por defecto. Las reglas se almacenan en el fichero
<EM>/usr/local/share</EM> (aunque si se instala un paquete de una
distribuci&oacute;n en lugar de las fuentes originales, seguramente lo instale
en <EM>/usr/share</EM>).
<P>
<P>
<H2><A NAME="s9">9. Instalar NESSUS</A></H2>

<P>Si la distribuci&oacute;n que usa el lector provee el paquete NESSUS, la
instalaci&oacute;n de &eacute;ste se limitar&aacute; a instalar dicho paquete y
configurarlo apropiadamente. Sin embargo, si &eacute;ste no es el caso, ser&aacute;
necesario obtener las fuentes originales (ver listado 1 ).
<P>Una vez obtenidas, se deben seguir los siguientes pasos para instalar
el programa:
<P>
<UL>
<LI>ejecutar <EM>configure</EM>, que har&aacute; uso de la herramienta GNU
<EM>autoconf</EM> para configurar el programa a nuestro sistema. En la
documentaci&oacute;n indica que debe ser el superusuario el que ejecute este
programa, ya que para probar el tipo de ordenaci&oacute;n de los sockets, es
necesario privilegios especiales.</LI>
<LI>ejecutar <EM>make</EM> para que compile los programas. Este es un
proceso largo ya que ha de compilar cada uno de los tests de seguridad
que luego se convertir&aacute;n en librer&iacute;as que cargar&aacute; din&aacute;micamente. Para
compilar el programa es necesario tener la versi&oacute;n de desarrollo de
<EM>gtk</EM>, que incluye las cabeceras (ficheros .h) para compilar
programas que utilizen esta librer&iacute;a.</LI>
<LI>ejecutar <EM>make install</EM>. Los programas (<EM>nessus</EM> y
<EM>nessusd</EM>) as&iacute; como las librer&iacute;as y las p&aacute;ginas de manual ser&aacute;n
instaladas en el sistema.</LI>
</UL>
<P>Una vez hecho esto la configuraci&oacute;n, seg&uacute;n indica la p&aacute;gina de manual,
ser&aacute; creada al arrancar el programa <EM>nessusd</EM> en el directorio
<EM>/usr/local/share/nessus</EM>. La forma de configurar el programa
est&aacute; perfectamente documentada en el Manual que acompa&ntilde;a el programa.
<P>NESSUS no es el &uacute;nico programa de este estilo dise&ntilde;ado para GNU/Linux,
tambi&eacute;n existe <EM>Gate Security</EM>, de Stan Lanford, con un interfaz
del tipo curses (en consola). El autor indica que es muy modular y que
ser&iacute;a f&aacute;cil de ampliar con nuevos tests, ya que actualmente cuenta con
tan s&oacute;lo tres sobre los servicios de: finger, NFS y WWW. Est&aacute; a&uacute;n en
fase de desarrollo (la &uacute;ltima versi&oacute;n de mayo de 1998 es la 0.1.4),
as&iacute; que quiz&aacute;s en su versi&oacute;n final sea un programa a valorar.
<P>
<H2><A NAME="s10">10. Detectar esc&aacute;neres remotos</A></H2>

<P>Dado que las herramientas de seguridad mediante tests remotos (SAINT,
SATAN...) pueden convertirse en un arma en manos de una persona que
pretenda utilizarla para fines il&iacute;citos, es necesario disponer de
programas que sean capaces de avisar al administrador cuando se
detecte accesso a la m&aacute;quina realizados por estos programas con la
intenci&oacute;n de obtener informaci&oacute;n o de probar vulnerabilidades.
<P>Este es el caso de <EM>Courtney</EM> y <EM>Gabriel</EM>, se ver&aacute; algo m&aacute;s de
&eacute;ste &uacute;ltimo m&aacute;s adelante. El primero de ellos es un programa
desarrollado en la Universidad de California por Marvin
J. Christensen. Est&aacute; dise&ntilde;ado para detectar este tipo de
paquetes. Aunque se distribuya indicando que dectar&aacute; ataques de SATAN
en realidad ser&aacute; capaz de detectar un tipo de ataques concreto,
denominado <EM>port scanning</EM>, consistente en probar todos (o un gran
n&uacute;mero) de los puertos de una m&aacute;quina (cada puerto est&aacute; ligado a un
servicio, ver <EM>inetd.conf(5)</EM>). Los programas pueden as&iacute; encontrar
servicios vulnerables o no usados para hacerse una idea m&aacute;s precisa de
los servicios ofrecidos por una m&aacute;quina.
<P>Se va a estudiar <EM>Courtney</EM> para observar el funcionamiento de
estos detectores. Este programa est&aacute; escrito en Perl, con lo que es
m&aacute;s f&aacute;cil de interpretar. El flujo de control del programa es como
sigue: una vez le&iacute;das e interpretadas las opciones, ejecuta el
programa <EM>tcpdump</EM> junto con una reglas de filtro de paquetes. El
programa <EM>tcpdump</EM> devolver&aacute; todos los paquetes que se lean en una
interfaz de red dada que cumplan alguna de las reglas, estas reglas
especifican que, por ejemplo, se deben mostrar los paquetes dirigidos
a diversos puertos. <EM>Courtney</EM> leer&aacute; de &eacute;ste todas las conexiones
de inter&eacute;s cuando se produzca alguna, y se apuntar&aacute; su origen,
posteriormente comprobar&aacute; si ese mismos origen ha hecho acciones
similares y, si es as&iacute;, avisa al sistema mediante la llamada a
<EM>logger</EM> y env&iacute;a un mensaje de correo al administrador.
<P>As&iacute; pues, si un ordenador accediera uno detr&aacute;s de otro a todos los
puertos de una m&aacute;quina que tuviera <EM>Courtney</EM>, &eacute;ste empezar&iacute;a a
"hacer saltar las alarmas" del sistema. Posteriormente el
administrador podr&iacute;a tomar la decisi&oacute;n de cerrar el acceso a la
m&aacute;quina atacante o no, en funci&oacute;n de la pol&iacute;tica de seguridad de &eacute;ste.
<P>Se puede ajustar el "nivel de alarma" del programa, que indica bajo
qu&eacute; condiciones se disparar&aacute; esta. Hay que fijar adecuadamente este
nivel ya que si es muy bajo se disparar&aacute; ante eventos que son
perfectamente normales (un usuario de una m&aacute;quina hace una conexi&oacute;n
v&iacute;a slogin y posteriormente una conexi&oacute;n de FTP), y si es muy alta no
se disparar&aacute; con los denominados "ataques ligeros", que esperan un
determinado tiempo antes de realizar la siguiente conexi&oacute;n.
<P>Otro programa de las mismas caracter&iacute;sticas es <EM>Gabriel</EM>, dise&ntilde;ado
originalmente para Solaris 1 y 2. &Eacute;ste hace algo similar pero
utilizando los filtros de paquetes de estas plataformas
(<EM>etherfind</EM> y <EM>snoop</EM> respectivamente), pero adem&aacute;s incorpora
en su configuraci&oacute;n otras formas de avisar al administrador (ver m&aacute;s
abajo)
<P>
<H2><A NAME="s11">11. Adaptar Gabriel a GNU/Linux</A></H2>

<P>
<P><EM>Gabriel</EM> es un programa de Los Altos Technologies, Inc., como ya
se ha indicado detecta esc&aacute;neres en la red
como SATAN. Pero tiene el aliciente de que es distribuido, los
clientes (implementados en <EM>gabriel_client.c</EM>) avisan de un execeso
de accesos a la red y el servidor (implementado en
<EM>gabriel_server.c</EM>) integra la informaci&oacute;n de estos y avisa de
diversas formas al administador: mediante correo electr&oacute;nico, v&iacute;a el
demonio <EM>talk</EM>, en la pantalla e incluso a trav&eacute;s del tel&eacute;fono o el
beeper si existen las pasarlelas adecuadas (y un m&oacute;dem).
<P>La idea que da lugar a que exista un cliente y un servidor parte del
hecho de que SATAN es capaz de realizar tests sobre m&aacute;s de un host de
una misma red, e incluso descubrirlos a medida que realiza los
tests. As&iacute;, puede ser m&aacute;s f&aacute;cil localizar el segmento de red en que se
encuentra el ordenador que est&aacute; ejecutando SATAN si se recibe la
informaci&oacute;n de todos los ordenadores en varios segmentos.
<P>El cliente esta escrito enteramente en C y muy ligado a su plataforma
original, ya que utiliza filtros de paquetes ya existentes, para poder
comprobar todos los paquetes iniciales de conexi&oacute;n (ICMP, UDP y
TCP). En principio s&oacute;lo tiene soporte Solaris 1.x o 2.x, y a&uacute;n no ha
sido portado a Linux. Sin embargo este programa sirve como muestra
bot&oacute;n de la manera en que se portan este tipo de programas al sistema
GNU/Linux. Una de las ventajas fundamentales es que la librer&iacute;a de C
de los sistemas UNIX es bastante compatible entre diversas
plataformas, con lo que el c&oacute;digo original no es necesario casi
tocarlo si hace uso de &eacute;sta. Otra ventaja es que no hace falta
modificar casi el servidor, ya que &eacute;ste es un shell script que hace
uso de programas com&uacute;nes en la comunidad UNIX (como awk)
<P>Por tanto las modificaciones para poder portar este programa a Linux
ser&iacute;an modificar el cliente para soportar la plataforma Linux haciendo
uso de tcpdump, modificar los scripts de shell caso de que hubiera
diferencias entre &eacute;stas, y modificar el fichero <EM>Makefile</EM> para
poder compilar la versi&oacute;n de Linux.
<P>En el CD se ofrecen tanto una versi&oacute;n modificada por el escritor como
la versi&oacute;n original, para hacer posible la  comparaci&oacute;n entre ambas.
<P>
<P>
<P>
<H2><A NAME="s12">12. CRACK, comprobar la seguridad de las passwords adivin&aacute;ndolas</A></H2>

<P>Finalmente, se va a ver una de las herramientas m&aacute;s usadas en
auditor&iacute;as de seguridad, y no es para menos, ya que una de las formas
habituales de tener acceso a una m&aacute;quina UNIX es directamente
accediendo a cuentas (v&iacute;a telnet, rlogin o slogin) con passwords que
se han descubierto f&aacute;cilmente (o inexistentes). Es por tanto
importante probar los mismos m&eacute;todos que probar&iacute;a un cracker para
asegurar que una m&aacute;quina es segura a estos intentos. Aunque esto no
impide que los usuarios puedan dejarse las password escrita, olvidada
por alg&uacute;n lado, si servir&aacute; para asegurar que las passwords del
sistemas no son f&aacute;cilmente vulnerables.
<P>Aunque atr&aacute;s quedan los tiempos en que los sistemas UNIX no
registraban los accesos no autorizados y los sistemas VMS eran
considerados m&aacute;s seguros por hacerlo, uno de los m&eacute;todos empleados por
posibles "intrusos" es obtener el fichero de passwords del sistema a
trav&eacute;s de cualquier agujero de seguridad de la m&aacute;quina, por ejemplo,
un PHP/FI en el servidor de WWW mal configurado. El conjunto de
herramientas <EM>shadow</EM> ha hecho esto m&aacute;s dif&iacute;cil a posibles intrusos
dado que por un lado se almacena la informaci&oacute;n del usuario en el
fichero <EM>/etc/passwd</EM> y por otro las passwords de los usuarios
en el fichero <EM>/etc/shadow</EM>. El primero puede ser le&iacute;do por
cualquier usuario del sistema, el segundo s&oacute;lo por root.
<P>Este fichero contiene las passwords de los usuarios encriptadas, es
decir, no est&aacute;n en claro, pero la funci&oacute;n que utilizan los sistemas
UNIX (un triple DES), que, aunque es dif&iacute;cil de romper por fuerza bruta, s&iacute;
es posible "atacarla" mediante el uso ingenioso de un diccionario y
de reglas. El ataque consiste en encriptar una palabra dada con la
funci&oacute;n (que es p&uacute;blica) y compararla con el valor encriptado de la
password (que es el que contiene el fichero), el algoritmo de
encriptaci&oacute;n asegura que si ambos son iguales entonces la palabra
usada es la password que se quiere adivinar.
<P>El programa <EM>Crack</EM> realizar&aacute; esta funci&oacute;n. Dado un fichero de
claves, intentar&aacute; "adivinar" las claves de todos los usuarios que en
ella encuentre usando un diccionario de palabras comunes y un conjunto
de reglas que indican cambios frecuentes que se realizan sobre
ellas. Ser&iacute;an reglas, por ejemplo, el poner la primera y la &uacute;ltima
letra en may&uacute;sculas, o el cambiar todas las vocales por su n&uacute;mero
correspondiente (la 'a' por '1', la 'e' por '2'...). Con estas reglas
<EM>Crack</EM> realiza manipulaciones con las palabras: las invierte,
mezcla, cambia la capitalizaci&oacute;n, transpone letras.. seg&uacute;n una serie
de reglas. El programa viene con unas 240 reglas de manipulaci&oacute;n
aunque se pueden construir otras nuevas. Adem&aacute;s, es posible conseguir
abundantes diccionarios por FTP, y no s&oacute;lo de palabras comunes, sino
de hobbies, pel&iacute;culas, argot...
<P>As&iacute; mismo es capaz de realizar ataques de fuerza bruta, aunque se
estima que para poder adivinar una password de ocho caracteres (el
m&aacute;ximo) con la actual potencia de un ordenador se tardar&iacute;an varias
decenas de a&ntilde;os (debido al gran n&uacute;mero de posibilidades, m&aacute;s de cien
billones, teniendo en cuenta todos los caracteres ASCII imprimibles),
si se limita el ataque a un menor n&uacute;mero de caracteres (por ejemplo
4), y de menor rango (por ejemplo s&oacute;lo n&uacute;meros) el n&uacute;mero desciende
considerablemente (diez mil en el caso propuesto).
<P>Este tipo de ataque puede dar resultados sorprendentes, en poco
tiempo, ya que si no se ha obligado a los usuarios a hacer uso de
passwords dif&iacute;ciles ser&aacute; capaz de adivinar un buen n&uacute;mero de ellas. El
programa incopora una funci&oacute;n para poder avisar a un usuario de que su
password es excesivamente f&aacute;cil, para lograr que la cambie, al tiempo
que almacena sus resultados en una base de datos para consulta
posterior del administrador.
<P>Este auditor&iacute;a sobre la seguridad de las passwords se puede evitar (o
se pueden evitar "sorpresas") de varias formas:
<P>
<UL>
<LI>adiestrando a los usuarios en la b&uacute;squeda de palabras claves
f&aacute;ciles de recordar pero d&iacute;ficiles de adivinar por estos m&eacute;todos.</LI>
<LI>entregando al usuario al principio una password del estilo
arriba mencionado.</LI>
<LI>sustituyendo el programa de cambio de passwords por uno que
impida el uso de passwords inseguras, como por ejemplo, de menos de
tres cifras, o s&oacute;lo con letras o s&oacute;lo con n&uacute;meros. Muchas de las
distribuciones de GNU/Linux existentes traen un programa de estas
caracter&iacute;sticas.</LI>
<LI>habilitar un mecanismo de "envejicimiento" de passwords, de
forma que el usuario se vea obligado a cambiar su password cada cierto
tiempo.</LI>
</UL>
<P>
<P>
<H2><A NAME="s13">13. Otros auditores para de GNU/Linux</A></H2>

<P>Aunque parezca complicado portar este tipo de programas a GNU/Linux,
la experiencia demuestra lo contrario. Por ejemplo, Robert L. Ziegler,
como ya se ha comentado, modific&oacute; <EM>Tiger</EM> para que pudiera ser usado en
RedHat 5.2 el 14 de septiembre de este mismo a&ntilde;o.
<P>Y tambi&eacute;n es posible dise&ntilde;ar auditores de forma que sean portables
entre plataformas, como es el caso del  denominado <EM>gomagog</EM> de
C. Parisel, que ha sido probado sobre AIX 4.2, HP-UX 10 y Linux 2.0
<P>Este paquete de seguridad se divide en tres m&oacute;dulos: un cliente
<EM>gog</EM>, un servidor <EM>magog</EM>, y un interfaz para el servidor v&iacute;a
HTML llamado <EM>gogview</EM>.
<P>El cliente <EM>gog</EM>, es un script en shell que recoge informaci&oacute;n
sobre los directorios indicados en la configuraci&oacute;n, que, por ejemplo,
pueden ser el directorio <EM>/etc</EM> y los directorios donde se
almacen los binarios del sistema. Sobre estos extrae la informaci&oacute;n de
permisos y pertenencia, al tiempo que extrae una firma del documento a
trav&eacute;s de la funci&oacute;n <EM>md5</EM>. Toda esta informaci&oacute;n es almacenada en
un directorio determinado. Se supone que esta informaci&oacute;n se recrea
cada cierto tiempo, la documentaci&oacute;n sugiere que mediante una entrada
en el <EM>cron</EM>.
<P>El servidor <EM>magog</EM> accede v&iacute;a FTP a los clientes identific&aacute;ndose
con un nombre de usuario y password y recupera los ficheros que &eacute;stos
han dejado con la informaci&oacute;n sobre cada uno de sus
sistemas. Comprueba esta informaci&oacute;n con los hist&oacute;ricos que ha
almacenado y avisa de alg&uacute;n cambio.
<P>De esta forma es posible saber si se ha modificado un binario (quiz&aacute;s
indique que un intruso ha instalado un troyano), o si se han
modificado los permisos (quiz&aacute;s alguien le ha puesto el bit de
<EM>setuid</EM> a alguno de los ficheros).
<P>La idea general es que los clientes ejecuten rutinariamente <EM>gog</EM> y
que cada cierto tiempo se ejecute <EM>magog</EM> para comprobar los
cambios. Adem&aacute;s, la filosof&iacute;a de descentralizaci&oacute;n permite que todos
los clientes sean gestioados desde una s&oacute;la m&aacute;quina.
<P>El interfaz a&ntilde;adido en la segunda versi&oacute;n del paquete (que fue
distribuida el 21 de diciembre de este a&ntilde;o) llamado <EM>gogview</EM>, permite
configurar el programa servidor a&ntilde;adiendo y eliminando clientes a los
que debe acceder, y ver la integridad de cada uno de los clientes, que
puede estar en uno de cuatro estados: en buen estado, con una
alteraci&oacute;n en el perfil, con varias alteraciones en el perfil o
inalcanzable. Los programas que lo forman deben ser instalados en el
directorio <EM>/cgi-bin/</EM> de un servidor de WWW ya funcional. Los
programas de configuraci&oacute;n del programa que acompa&ntilde;an la distribuci&oacute;n
realizan autom&aacute;ticamente esta tarea.
<P>
<H2><A NAME="s14">14. Resumen</A></H2>

<P>Se han visto m&uacute;ltiples herramientas de seguridad, haciendo un largo
recorrido desde las primeras herramientas disponibles para los
sistemas UNIX en general, hasta herramientas ya espec&iacute;ficas de
GNU/Linux, como es el caso de NESSUS con su interfaz gtk.
<P>Se recomienda en cualquier caso encarecidamente al lector que acuda a
la informaci&oacute;n recomendada y que "meta la cabeza" en las fuentes de
los programas ofrecidos, ya que &eacute;stos son la mejor muestra de c&oacute;mo
funcionan este tipo de programas.
<P>
<P>
<H2><A NAME="s15">15. Contenido del CD</A></H2>

<P>En el CD se han incluido todas las herramientas comentadas en el
art&iacute;culo, al menos aquellas cuya licencia permite su distribuci&oacute;n en
dicho CD. Asimismo, y por considerarlo de inter&eacute;s para los lectores, se
han incluido otras herramientas de seguridad de sistemas UNIX en
general y GNU/Linux en particular, haciendo una r&eacute;plica de los servidores
de sunsite (ahora metalab.unc.edu) y de CIAC.
<P>Con intenci&oacute;n de hacer m&aacute;s accesible la instalaci&oacute;n de estos paquetes,
el autor ha creado dos paquetes de para Debian GNU/Linux que permiten
instalar la &uacute;ltima version de SATAN (1.1.1) y de NESSUS
(981016). Estos dos paquetes, ofrecidos en primicia para los lectores
de Linux Actual formaran, si es posible, parte de la distribuci&oacute;n de
Debian en un futuro.
<P>
<P>
<H2><A NAME="s16">16. Sumarios</A></H2>

<P>
<P><-- hacer -->
<P>
<H2><A NAME="s17">17. Listados</A></H2>

<P>
<P>
<P>
<P>
<P>LISTADO 1-
<P>He aqu&iacute; el listado de los programas que se comentan en este art&iacute;culo y
d&oacute;nde est&aacute; la fuente original:
<P>
<UL>
<LI> COPS, disponible en 
<A HREF="ftp://info.cert.org/pub/tools/cops/">ftp://info.cert.org/pub/tools/cops/</A>.

</LI>
<LI>TIGER, disponible en 
<A HREF="ftp://net.tamu.edu/pub/security/TAMU/">ftp://net.tamu.edu/pub/security/TAMU/</A>
</LI>
<LI>ISS, disponible en 
<A HREF="ftp://info.cert.org/pub/tools/iss/">ftp://info.cert.org/pub/tools/iss/</A>, m&aacute;s informaci&oacute;n en 
<A HREF="ftp://info.cert.org/pub/cert_advisories/CA-93:14.Internet.Security.Scanner">ftp://info.cert.org/pub/cert_advisories/CA-93:14.Internet.Security.Scanner</A>
</LI>
<LI>Tripwire, disponible en 
<A HREF="ftp://info.cert.org/pub/tools/tripwire/">ftp://info.cert.org/pub/tools/tripwire/</A>
</LI>
<LI>SATAN, la 
p&aacute;gina original (de Wietse Venema) est&aacute; situada en Los Paises Bajos y
se puede acceder en
<A HREF="http://wzv.win.tue.nl/satan/">http://wzv.win.tue.nl/satan/</A>, Dan Farmer mantiene otra
p&aacute;gina en Estados Unidos en 
<A HREF="http://www.fish.com/satan/">http://www.fish.com/satan/</A>. El programa puede obtenerse en
<A HREF="ftp://ftp.win.tue.nl/pub/security/satan-1.1.1.tar.Z">ftp://ftp.win.tue.nl/pub/security/satan-1.1.1.tar.Z</A>,
los avisos del CERT sobre SATAN est&aacute;n en 
<A HREF="ftp://info.cert.org/pub/cert_advisories/CA-95:06.satan">ftp://info.cert.org/pub/cert_advisories/CA-95:06.satan</A> y 
<A HREF="ftp://info.cert.org/pub/cert_advisories/CA-95:07a.REVISED.satan.vul">ftp://info.cert.org/pub/cert_advisories/CA-95:07a.REVISED.satan.vul</A>.
Est&aacute; en preparaci&oacute;n un paquete Debian para SATAN.
</LI>
<LI>Courtney, programa para detectar escaners tipo SATAN, de
CIAC. Se puede obtener en 
<A HREF="ftp://ciac.llnl.gov/pub/ciac/sectools/unix/courtney">ftp://ciac.llnl.gov/pub/ciac/sectools/unix/courtney</A>, m&aacute;s
informaci&oacute;n en 
<A HREF="http://www.alw.nih.gov/Security/CIAC-Notes/CIAC-Notes-08.html">http://www.alw.nih.gov/Security/CIAC-Notes/CIAC-Notes-08.html</A>.
Existe un paquete Debian para Courtney.
</LI>
<LI>Merlin, se trata de un programa desarrollado por CIAC que sirve
de interfaz a otros programas de seguridad (COPS, CRACK, TAMU-tiger..)
a trav&eacute;s de un navegador de WWW. Se puede obtener en 
<A HREF="ftp://ciac.llnl.gov/pub/ciac/sectools/unix/merlin/">ftp://ciac.llnl.gov/pub/ciac/sectools/unix/merlin/</A>
</LI>
<LI>SAINT, lamentablemente no puede distribuirse libremente (por
ello no se incluye en el CD) pero puede obtenerse de 
<A HREF="http://www.wwwdsi.com/saint">http://www.wwwdsi.com/saint</A>
</LI>
<LI>NESSUS, puede obtenerse en 
<A HREF="http://www.nessus.org">http://www.nessus.org</A>
Est&aacute; en preparaci&oacute;n un paquete Debian, el CD se incluye &eacute;ste, aunque
no se asegura su buen funcionamiento.
</LI>
<LI>Gate security, puede obtenerse en 
<A HREF="http://tishina.home.ml.org /products/gate">http://tishina.home.ml.org /products/gate</A>.
</LI>
<LI>Gabriel, se puede obtener en 
<A HREF="http://www.lat.com">http://www.lat.com</A>,
m&aacute;s informaci&oacute;n en 
<A HREF="http://ciac.llnl.gov/ciac/ToolsUnixNetMon.html">http://ciac.llnl.gov/ciac/ToolsUnixNetMon.html</A>
</LI>
<LI>Crack, est&aacute; disponible en 
<A HREF="ftp://info.cert.org/tools/crack">ftp://info.cert.org/tools/crack</A></LI>
</UL>
<P>En general se pueden encontrar muchos programas de seguridad en los
siguientes servidores, aunque el contenido de algunos de &eacute;stos se
incluye en el CD, se recomienda su visita para buscar nuevas
herramientas de seguridad:
<P>
<UL>
<LI>Los archivos del grupo de noticias <EM>comp.source.misc</EM> en
<A HREF="ftp://ftp.uu.net">ftp://ftp.uu.net</A>
</LI>
<LI>El almacen de herramientas de seguridad del CERT: 
<A HREF="ftp://info.cert.org/pub/tools">ftp://info.cert.org/pub/tools</A></LI>
<LI>El almac&eacute;n de herramientas de seguridad de CIAC: 
<A HREF="ftp://ciac.llnl.gov/pub/ciac/sectools/unix">ftp://ciac.llnl.gov/pub/ciac/sectools/unix</A>
</LI>
<LI>El almacen de herramientas de seguridad de Sunsite: 
<A HREF="ftp://sunsite.unc.edu/pub/linux/system/security">ftp://sunsite.unc.edu/pub/linux/system/security</A>
</LI>
<LI>"Unix security tools":
<A HREF="http://www.aenigma.net/resources/tools/index.htm">http://www.aenigma.net/resources/tools/index.htm</A>
</LI>
<LI>"Security links":
<A HREF="http://www.txdirect.net/~wall/seclinks.htm">http://www.txdirect.net/~wall/seclinks.htm</A></LI>
<LI>"Networking references - Security": 
<A HREF="http://www.dc.net/ilazar/security.htm">http://www.dc.net/ilazar/security.htm</A>
</LI>
</UL>
<P>
<P>PIE LISTADO 1: Programas relacionados con la seguridad y d&oacute;nde encontrarlos.
<A NAME="programas"></A> <P>
<P>
<P>
<P>
<P>LISTADO 2-
<P>Existen ciertas curiosidades relacionadas con SATAN, que se reflejan
aqu&iacute; para informaci&oacute;n de los lectores.
<P>La imagen de SATAN, un personaje humanoide con una cara ca&oacute;tica y
extra&ntilde;a, no ha sido fruto de la imaginaci&oacute;n de sus programadores. Se
trata de una aportaci&oacute;n del dibujante Neil Gaiman, autor del comic
Sandman, al proyecto. El boceto original, firmado por &eacute;ste, forma
parte de la distribuci&oacute;n de SATAN.
<P>
<P>************* INSERTAR IMAGEN DE SATAN ****************
<P>El nombre SATAN tambi&eacute;n puede resultar ofensivo a algunas personas,
los programadores, para evitar discrepancias aunque piensan que el
nombre del programa se ajusta muy bien a su herramienta, facilitaron
el que se pudiera cambiar el nombre de &eacute;ste. Existe un programa en la
distribuci&oacute;n de SANTA <EM>repent</EM> (arrepentir) que, si se ejecuta,
cambia todas las menciones del angel ca&iacute;do a SANTA (Security Analysis
Network Tool for Administrators).
<P>Otra curiosidad algo m&aacute;s molesta es que debido al modelo de dise&ntilde;o de
SATAN, las p&aacute;ginas de WWW vistas en el navegador son en realidad
scripts en Perl que ejecuta &eacute;ste. Por ello la extensi&oacute;n de todas estas
p&aacute;ginas es <EM>.pl</EM> esto puede causar problemas en navegadores que
tengan configurado esta extensi&oacute;n como un tipo MIME determinado
(application/x-perl). El navegador de Netscape, por ejemplo, por no
saber qu&eacute; hacer con este tipo de documentos pedir&aacute; al usuario un lugar
donde guardarlos. Desde luego &eacute;ste no es el comportamiento deseado, ya
que uno quiere ver el resultado directamente sobre el navegador. Para
conseguir esto, es necesario ir (en el Navigator) al men&uacute; de
Preferencias/Aplicaciones, eliminar el tipo MIME asociado a la
extensi&oacute;n <EM>pl</EM> y a&ntilde;adir dentro de los documentos del tipo
<EM>text/html</EM> (que son interpretados por el navegador) la
extensi&oacute;n <EM>pl</EM>. En el Communicator se ha de modificar esto en el
men&uacute; Preferencias/Avanzadas/Aplicaciones.
<P>Esto se debe a que cuando Dan Farmer y Wietse Venema dise&ntilde;aron SATAN,
a&uacute;n no estaba extendido el uso de tipos MIME para todo y tampoco, desde
luego, estaba asignado esta extensi&oacute;n al lenguaje Perl ya que por
entonces andaba en sus or&iacute;genes y no se hab&iacute;a extendido tanto como
hasta ahora.
<P>
<P>PIE LISTADO 2: Curiosidades de SATAN 
<A NAME="satan-curiosidad"></A> <P>
<P>LISTADO 3-
<P>Es un riesgo indudable ejecutar binarios como superusuario, aunque es
algo de lo m&aacute;s com&uacute;n para muchos usuarios, que encuentran que un
determinado programa no se ejecuta como usuario normal y s&iacute;  lo
ejecutan como superusuario. Es el caso, por ejemplo, de muchos juegos
que hacen uso de la librer&iacute;a <EM>svgalib</EM>, ya que para el manejo a
bajo nivel del hardware (indispensable en muchos juegos) hace falta
ejecutar el juego como root (o poner &eacute;ste <EM>setuid</EM>).
<P>En el caso de SATAN se conoce una distribuci&oacute;n de binarios de la
versi&oacute;n de este para Linux que era en realidad un troyano. Realizaba
todas las funciones de SATAN perfectamente pero el que la distribuy&oacute;
a&ntilde;adi&oacute; c&oacute;digo que pon&iacute;a en compromiso el sistema en el que fuera
ejecutado. Curiosamente, aquella persona (que dicho sea de paso perdi&oacute;
su trabajo por su "haza&ntilde;a") tambi&eacute;n distribuy&oacute; el c&oacute;digo fuente, que
se puede poner como ejemplo de un troyano.
<P>Los cambios al c&oacute;digo ten&iacute;an lugar en el programa <EM>fping</EM>, al que
a&ntilde;ad&iacute;a una nueva funci&oacute;n llamada <EM>backdoor()</EM> que era ejecutada por
<EM>main()</EM> despu&eacute;s de comprobar que hab&iacute;a sido ejecutada por el
superusuario. Esta funci&oacute;n ten&iacute;a como tarea a&ntilde;adir un nuevo usuario a
la base de datos de usuarios (el fichero <EM>/etc/passwd</EM>), llamado
suser despu&eacute;s de comprobar que no exist&iacute;a. Posteriormente hace
setuid el binario <EM>fping</EM>, y abre una conexi&oacute;n remota a un servidor
cuyos ficheros de registro eran accesibles por todo el mundo. Se
conecta a un puerto abierto por el demonio <EM>inetd</EM>, que no est&aacute;
conectado a ninguna aplicaci&oacute;n, pero que sin embargo se registra como
acceso. Esto posiblemente lo hac&iacute;a para poder ver quienes ejecutaban
esta versi&oacute;n "modificada" de SATAN, y poder acceder a ellos como
usuario 'suser' y con la password conocida. 
<P>La segunda parte del troyano, dentro del c&oacute;digo de <EM>fping</EM> en la
funci&oacute;n main, hac&iacute;a que, si &eacute;ste era ejecutado por el usuario 'suser'
y fijaba una determinada variable de entorno, el programa
inmediatamente arrancaba una shell. Dado que el programa ahora ten&iacute;a
setuid del superusuario (si era el propietario del fichero) lo que
se obten&iacute;a al ejectuar <EM>fping</EM> con esta modificaci&oacute;n que era una shell
de root.
<P>El c&oacute;digo de este troyano, comentado por ldoolit@cebaf.gov, est&aacute;
disponible en el CD de la revista, junto a la distribuci&oacute;n de SATAN.
<P>PIE LISTADO 3: El problema de la ejecuci&oacute;n de binarios como root
<P>LISTADO 4-
<P>Los programas auditores de seguridad vistos utilizan m&eacute;todos
rudimentarios para "adivinar" el sistema operativo que utiliza la
m&aacute;quina sobre la que se est&aacute;n haciendo los tests. NESSUS, por ejemplo,
lo hace en base a dos conexiones: una conexi&oacute;n al puerto de FTP (21) y otra
al puerto de telnet (23- login remoto). Con la primera identifica si
es un sistema Windows o un UNIX, bas&aacute;ndose en la cadena de bienvenida
recibida; si contiene a la palabra "Microsoft" se trata de un NT y si
contiene la palabra "wu-" decide que es un UNIX (el servidor <EM>wu-ftp</EM>,
es el m&aacute;s utilizado en el mundo UNIX). Mirando en el puerto de telnet
busca determinadas cadenas de caracteres para adivinar si es un Linux,
IRIX, FreeBSD, etc.. Esto est&aacute; implementado como un "plugin" llamado <EM>guess_os</EM>.
<P>SATAN implementa algo parecido en su lista de reglas
<EM>rules/hosttype</EM>, en la que simplemente busca expresiones
regulares en las respuestas de los programas que utiliza para
monitorizar el servidor remoto y en funci&oacute;n de &eacute;stas decide si es un
SGI, SUN, APOLLO, VMS, Linux..
<P>Ambos m&eacute;todos pueden ser enga&ntilde;ados por un administrador que cambie las
cabeceras de sus servicios para indentificarse de forma distinta, y
adem&aacute;s fallar&aacute;n si no existe ning&uacute;n servicio que proporcione esta
informaci&oacute;n textual.
<P>Un m&eacute;todo t&eacute;cnicamente m&aacute;s avanzado, y con m&aacute;s estilo, es el
implementado por QueSO de Jordi Murgo. Se trata de una idea apuntada por otros
programas como por ejemplo <EM>tft</EM> de Lamont Granquist (enviado a
rootshell el 7 de julio de 1998), que realiza pruebas sobre la
respuesta de una m&aacute;quina a las 64 "banderas" del protocolo TCP. 
<P>QueSO (tambi&eacute;n llamado WathOS) identifica el sistema operativo en
funci&oacute;n de la implementaci&oacute;n TCP/IP; en particular en funci&oacute;n de la
respuesta a paquetes "extra&ntilde;os" cuyo comportamiento no est&aacute; definido
en ning&uacute;n RFC y por tanto cuya respuesta depende de la programaci&oacute;n de
la pila de protocolos en el sistema operativo concreto. En total
env&iacute;a siete paquetes, y compara la respuesta con una base de datos de
respuestas t&iacute;picas por sistemas operativos entregada con el programa.
<P>El programa est&aacute; disponible en c&oacute;digo fuente, bajo la licencia GNU en
<A HREF="http://apostols.org/projectz/queso/">http://apostols.org/projectz/queso/</A>, ha sido
programado por un espa&ntilde;ol y es capaz de reconocer entre m&aacute;s de ochenta
implementaciones distintas en diversos sistemas operativos.
<P>PIE LISTADO 4: QueSO, un programa que indica el SO 
<A NAME="queso"></A> <P>
<P>LISTADO 5-
<P>Los programas que se han visto en el art&iacute;culo tienen limitaciones,
propias o impuestas por el usuario (esto es, configurables) para poner
l&iacute;mite a los ordenadores a los que van a inspeccionar. Esto es as&iacute;
porque es muy posible, sobre todo debido a una mala configuraci&oacute;n, que
se inspeccionen ordenadores fuera de la red que uno est&aacute;
administrando, es decir fuera de su "jurisdicci&oacute;n".
<P>Evidentemte nadie quiere que sus ordenadores sean inspeccionados de
esta forma sin haber dado su consentimiento, y este tipo de acciones
puede ser considerado un ataque contra sus equipos inform&aacute;ticos, es
posible que incluso sea consideraod ilegal. Los autores de SATAN
advierten de estos peligros en la documentaci&oacute;n del programa.
<P>Este tipo de escaneres "despertar&aacute;n", adem&aacute;s, muchas alarmas en los
sistemas (incluyo en aquellos que no tengan programas espec&iacute;ficos para
detectarlos) y que estar&aacute;n a la vista de cualquier administrador.
<P>En resumen, tener cuidado cuando se hace uso de estos programas y
limitar al m&aacute;ximo la "libertad" que se les da para acceder a otros
servidores. En todos ellos (SATAN, SAINT y NESSUS) es posible definir
un "l&iacute;mite de profundidad", as&iacute; como servidores sobre los que nunca
realizar&aacute; las pruebas; es conveniente usar estas facilidades.
<P>Como dicen los autores:
"Last but not least, SATAN was written to improve Internet security.
Don't put our work to shame."
<P>PIE LISTADO 5: Por qu&eacute; no auditar TODOS los ordenadores
<P>
<P>LISTADO 6-
<P>Existen invaluables fuentes de informaci&oacute;n en la Red concernientes a
seguridad de GNU/Linux, en particular, y de cualquier otro sistema
operativo en general. Servidores como "rootshell" (www.rootshell.com)
ponen a disposici&oacute;n del usuario una gran cantidad de informaci&oacute;n
aplicable a problemas de seguridad. Algunos de estos servidores
han sido instalados por agencias gubernamentales y otros pertenecen al
lado algo m&aacute;s "oscuro" de Internet:
<P>
<UL>
<LI>El texto "Improving the Security of Your Site by Breaking Into It"
("Mejorar la seguridad de su servidor entrando a la fuerza en &eacute;l"), se
puede encontrar en la distribuci&oacute;n de SATAN.
</LI>
<LI>El Centro de Coordinaci&oacute;n CERT (Computer Emergency Response
Team), que ahora celebra su d&eacute;cimo cumplea&ntilde;os, estudia vulnerabilidades
de Seguridad en Internet, dan servicios de respuesta de incidentes a
servidores que han sido v&iacute;ctimas de un ataque y publican informaci&oacute;n
relativa a seguridad como avisos, desarrollos o informaci&oacute;n general
para mejorar la seguridad de los servidores : 
<A HREF="http://www.cert.org">http://www.cert.org</A>
</LI>
<LI>El &iacute;ndice com&uacute;n de vulnerabilidades del CERT (la "lista de la compra"):
<A HREF="ftp://info.cert.org/pub/tech_tips/AUSCERT_checklist1.1">ftp://info.cert.org/pub/tech_tips/AUSCERT_checklist1.1</A>
</LI>
<LI> CIAC (US DOE's computer Incident Advisory Capability);
establecido en 1989, poco despu&eacute;s del Gusano de Internet, proporciona
servicios relacionados con seguridad sin coste a empleados y
contratistas del Departamento de Defensa (DOE) Estadounidense: 
<A HREF="http://ciac.llnl.gov/ciac/">http://ciac.llnl.gov/ciac/</A>
</LI>
<LI>Roothsell es un servidor que comenz&oacute; como base de datos de
informaci&oacute;n sobre c&oacute;mo podr&iacute;a un usuario convertirse en superusuario
en una m&aacute;quina. Actualmente cuenta con una base de datos inmensa sobre
seguridad para muchos sistemas operativos y aplicaciones: 
<A HREF="http://www.rootshell.com">http://www.rootshell.com</A>
</LI>
<LI>Bugtrack, el repositorio general de problemas de seguridad de UNIX m&aacute;s grande del mundo:
<A HREF="http://www.geek-girl.com/bugtraq/index.html">http://www.geek-girl.com/bugtraq/index.html</A>
</LI>
<LI>La revista "underground" Phrak.
</LI>
<LI>La revista "Computer Underground Digest".
</LI>
<LI>El servidor de los hackers: 
<A HREF="http://www.hackers.com">http://www.hackers.com</A>
</LI>
<LI>Ejemplos de agujeros de seguridad:
<A HREF="http://oliver.efri.hr/~crv/security/">http://oliver.efri.hr/~crv/security/</A>
</LI>
<LI>El paquete de seguridad COPS viene acompa&ntilde;ado con una buena
cantidad de informaci&oacute;n relativa a seguridad, que, si bien un tanto
antigua, en su mayor&iacute;a sigue a&uacute;n vigente.
</LI>
</UL>
<P>PIE LISTADO 6: D&oacute;nde buscar informaci&oacute;n relativa a la seguridad
<A NAME="mas-info"></A> <P>
<P>
<H2><A NAME="s18">18. Capturas</A></H2>

<P>Poner captura de SAINT, poner captura de Nessus y de SATAN: de la cara
y de cada una las fases de prueba.
<P>Poner captura de las p&aacute;ginas de WWW Rootshell y bugtrack.
<P>?Poner captura de ejecuci&oacute;n del Crack.
<P>
<H2><A NAME="s19">19. Notas de maquetaci&oacute;n</A></H2>

<P>
<P>
<H2><A NAME="s20">20. Notas de coordinaci&oacute;n</A></H2>

<P>
</BODY>
</HTML>
