<TITLE>Tutorial de Perl, Capitulo Primero</TITLE>
<Tutorial escrito por Daniel Sol Llaven :) >
</HEAD>
<BODY>
<center><H1>Proyecto de Tutorial de Perl </H1>
<a href="http://lince.dgsca.unam.mx:8080/zgate/lacertus/hola">
Daniel Sol Llaven. 
<H2>Viernes 18 de Abril de 1997</H2>
<H1>Tabla de contenidos del primer capitulo:</H1><P></center>
<H1><A HREF="#1">1- Introducci&oacute;n</A></H1><BR>
<BLOCKQUOTE><H2><A HREF="#1.1">1.1-PERL</A></H2><BR>
<BLOCKQUOTE><H3><A HREF="#1.1.1">1.1.1-¿Que es PERL?</A></H3><BR>
<H3><A HREF="#1.1.2">1.1.2- Para que sirve</A></H3><BR>
<H3><A HREF="#1.1.3">1.1.3- Donde puede usarse</A></H3><BR>
<H3><A HREF="#1.1.4">1.1.4- Que fuentes de informaci&oacute;n existen</A></H3>
</BLOCKQUOTE><BR>
<H2><A HREF="#1.2">1.2- Filosof&iacute;a de PERL</A></H2><BR>
<H2><A HREF="#1.3">1.3- Diferencias entre PERL 4.3 y 5.X, Como elegir Versi&oacute;n</A></H2><P>
</BLOCKQUOTE>

<HR>

<A NAME="1"><H1>1- Introducci&oacute;n</H1></A>
<blockquote>
<A NAME="1.1"><H2>1.1- PERL</H2></A>
<blockquote>
<A NAME="1.1.1"><H3>1.1.1- Que es PERL</H3>
</blockquote></blockquote>
<P>
Perl (Practical Extraction and Report Languaje) es un lenguaje
de programaci&oacute;n surgido a inicios de los noventas, que
busca antes que nada el facilitar la elaboraci&oacute;n de tareas
comunes en sistemas tipo UNIX, donde tradicionalmente las tareas
de administraci&oacute;n y proceso de datos se realiza con herramientas
muy rudimentarias y por dem&aacute;s hostiles al usuario o administrador.
Pero que se aplican sobre grandes cantidades de informaci&oacute;n
(por lo regular texto) por lo que se requiere que sean de alto
rendimiento.
<P>
Su autor, Larry Wall (lwall@netlabs.com) realiz&oacute; Perl casi
como una obra altruista, de modo que hasta PERL 5.X su distribuci&oacute;n
es gratuita, sin que por eso tenga menos poder o consistencia.
<A NAME="1.1.2"><H3>1.1.2- Para que sirve</H3></A>

<P>
Perl surgi&oacute; como una opci&oacute;n para una gran cantidad
de herramientas de UNIX en las cuales basa su propia sintaxis,
buscando el m&iacute;nimo sacrificio de su desempe&ntilde;o por
una m&aacute;xima facilidad de programaci&oacute;n e integraci&oacute;n,
sigue la filosof&iacute;a de mantener un ambiente que sea capaz
de detectar y corregir peque&ntilde;as omisiones del programador,
y de proporcionarle una forma abreviada de realizar m&uacute;ltiples
tareas. En una palabra, es una utiler&iacute;a que pretende facilitar
el proceso de grandes vol&uacute;menes de informaci&oacute;n sin
sacrificar el rendimiento.
<blockquote><blockquote>
<A NAME="1.1.3"><H3>1.1.3- Donde Puede Usarse</H3></A>
</blockquote></blockquote>
<P>
Las plataformas donde Perl se ha desarrollado mas son los servidores
UNIX, por sus necesidades de administraci&oacute;n y lo robusto
de su manejo de memoria y de procesos (requisitos de PERL hacia
el S.O.) adem&aacute;s de la facilidad de Perl para realizar los
as&iacute; llamados CGIs, interfaces para comunicar recursos del
servidor con un servicio de internet particular (como podr&iacute;a
ser WWW o gopher), En otras plataformas, PC en particular, se
han desarrollado versiones que mantienen un razonable grado de
funcionalidad, pero en realidad, el sistema DOS no tiene un manejo
lo bastante bueno de los procesos o de la memoria para permitir
a PERL dar un buen desempe&ntilde;o, adem&aacute;s de que no es
com&uacute;n ver en PC necesidades de administraci&oacute;n de
la magnitud de un servidor institucional. Sin embargo, puede practicarse
la programaci&oacute;n en PERL de PC, o incluso elaborar programas
de reporteo en el , sin embargo, es algo que no se ha popularizado
hasta hoy.
<blockquote><blockquote>
<A NAME="1.1.4"><H3>1.1.4- Que fuentes de informaci&oacute;n existen</H3></A>
</blockquote></blockquote>
<P>
Los libros que son ya cl&aacute;sicos sobre Perl son los libros
del camello y la llama de la editorial Nutshell, adem&aacute;s,
existen magn&iacute;ficas introducciones y manuales de referencia
que se pueden obtener v&iacute;a internet. Aun cuando es imposible
mencionar con precisi&oacute;n las fuentes de informaci&oacute;n
de un medio tan din&aacute;mico con algo tan est&aacute;tico como
este documento. Debe notarse, adem&aacute;s que estas referencias
est&aacute;n en ingl&eacute;s.
<P>
Para buscar informaci&oacute;n, Yahoo! por supuesto:
<P>
http://www.yahoo.com/Computers_and_Internet/Languajes/Perl/
<P>
Fuente de informaci&oacute;n general y referencia de documentos:
<P>
http://pubweb.nexor.co.uk/public/perl/perl.html
<P>
http://www.khoros.unm.edu:80/staff/neilb/perl/perl5.html
<P>
Una buena formada introducci&oacute;n:
<P>
http://www.khoros.unm.edu:80/staff/neilb/perl/introduction/home.html
<P>
Documentaci&oacute;n:
<P>
http://www-cgi.cs.cmu.edu/cgi-bin/perl-man
<P>
http://www.perl.com/perl/info/documentation.html
<P>
ftp://ftp.cdrom.com/pub/perl/CPAN/doc/manual/html/index.html
<P>
ftp://ftp.uoknor.edu/mirrors/CPAN/doc/manual/html/index.html
<P>
Debo recalcar que por la misma naturaleza de Perl, los recursos
disponibles y las herramientas que se pueden utilizar cambian
muy a menudo, por lo que es indispensable dedicar alg&uacute;n
esfuerzo a mantenerse al d&iacute;a para evitar un desperdicio
mayor de esfuerzo por no utilizar los nuevos recursos disponibles.
<blockquote>
<A NAME="1.2"><H2>1.2- Filosof&iacute;a de Perl</H2></A>
</blockquote>
<P>
<I><B>&quot;Hay mas de una forma de hacerlo&quot;</B></I> 
<P>
<I><B>-Larry Wall, autor del lenguaje de programaci&oacute;n Perl.</B></I><P>
Perl no establece ninguna filosof&iacute;a de programaci&oacute;n
(de hecho, no se puede decir que sea orientado a objetos, modular
o estructurado aun cuando soporta directamente todos estos paradigmas),
los objetivos que se tuvieron en cuenta al dise&ntilde;ar la sintaxis
de Perl fueron la facilidad de aprendizaje y de uso y la claridad
de c&oacute;digo, las cuales, considero que son necesarias (aunque
pueden escribirse programas en Perl complejos e inteligibles si
as&iacute; se desea).
<P>
Por si fuese poco, Perl no es ni un compilador ni un interprete,
esta en un punto intermedio, cuando mandamos a ejecutar un programa
en Perl, se compila el c&oacute;digo fuente a un c&oacute;digo
intermedio en memoria, se le optimiza (como si fu&eacute;semos
a elaborar un programa ejecutable) pero es ejecutado por un motor,
como si se tratase de un interprete. El resultado final, es que
utilizamos algo que se comporta como un interprete pero que tiene
un rendimiento comparativo al de programas compilados. Sin embargo,
ya existen compiladores de Perl con la versi&oacute;n 5.
<P>
En fin, Perl no nos forza a nada, pero como es l&oacute;gico hay
ciertas reglas que recomiendo seguir para facilitar nuestro trabajo:
<UL>
<LI><B>Claridad.</B> En la mec&aacute;nica de programaci&oacute;n
actual, los programas deben de ser entendibles por la persona
que nos suceda en tareas de mantenimiento, de lo contrario perjudicamos
tanto a nuestros compa&ntilde;eros de trabajo como a nuestra propia
libertad para progresar y mantenernos libres de preocupaciones.
<LI><B>Indentaci&oacute;n.</B> Una costumbre ya cl&aacute;sica
de la programaci&oacute;n, en lo personal, y a lo largo de los
ejemplos de este documento, indento el c&oacute;digo dos espacios
hacia adelante al abrir cada bloque, y termino la indentaci&oacute;n
al terminar el bloque, de modo que las llaves de apertura y cierre
quedan a la vista y en la misma columna, solas en sus renglones
(esto incrementa algo el numero de l&iacute;neas, pero facilita
sobremanera la b&uacute;squeda y correcci&oacute;n de los diversos
bloques de control).
<LI><B>Nombres de variables y dem&aacute;s</B>. En lo personal,
procuro dar la m&aacute;xima claridad a los nombres de las variables
sin hacerlos demasiado grandes, el nombre de los contadores y
variables que guardan valores concernientes a un peque&ntilde;o
segmento de c&oacute;digo por lo regular son de un par de letras
(c1, c2, ... cx para los contadores, s1, s2, etc para cadenas
de entrada etc.) mientras que las variables que afectan a diversos
segmentos (a modo de regla, que tienen su definici&oacute;n en
una pantalla distinta a donde se usan) tienen nombres explicativos
que procuro no excedan los 12 caracteres. Adem&aacute;s, los nombres
de archivos se usan con may&uacute;sculas (ARCHENT, ARCHSAL, etc)
y las clases tienen su primera letra may&uacute;scula.
<LI><B>Comentarios</B>. Para facilitar la comprensi&oacute;n de
un programa no hay como explicarlo, y los comentarios son el medio
ideal para hacerlo, hay por lo menos tres comentarios que considero
que siempre deben incluirse en un programa: Que hace el programa,
Quien lo escribi&oacute; y Cuando inicio y termino de escribirlo,
sobretodo en el contexto de una organizaci&oacute;n, estos tres
simples comentarios pueden hacer la diferencia entre desechar
un programa como indescifrable o dedicarle alg&uacute;n tiempo
para revisarlo. Adem&aacute;s, considero prudente comentar dentro
del c&oacute;digo la forma en que el programa deber&aacute; ejecutarse,
par&aacute;metros, y su sintaxis, as&iacute; como comentar las
estructuras de control como un modo de explicar la funcionalidad
al detalle y recalcar con comentarios las funciones que cumplen
las variables.
<LI><B>Sencillez</B>. Es c&oacute;modo en ocasiones el comprimir
una serie de instrucciones en una sola l&iacute;nea, queda al
criterio decidir cuando se gana en claridad con un c&oacute;digo
mas o menos extenso, pero no debe titubearse en comentar el c&oacute;digo
que sea &quot;comprimido&quot;.
</UL>
<blockquote>
<A NAME="1.3"><H2>1.3- Diferencias entre Perl 4.3 y 5.X, Como elegir versi&oacute;n</H2></A>
</blockquote>
<P>
Actualmente existen dos versiones altamente populares de Perl,
la 4.3 y la 5.0X, de hecho hay diferencias importantes entre una
versi&oacute;n y otra. Seguramente el lector se pregunta porque
surge la duda entre usar una versi&oacute;n vieja y una nueva,
por regla general las nuevas versiones son mejores que las anteriores
de modo que las opacan en todo sentido, Perl no es la excepci&oacute;n
a esta regla, el &uacute;nico factor que impide una transici&oacute;n
inmediata es que no son 100% compatibles. La versi&oacute;n 5
de Perl es una reescritura total que ya incluye un manejo de estructuras
abstractas de datos mucho mas poderoso, incluso, soporta la orientaci&oacute;n
a objetos a su manera (tema que no trato en esta introducci&oacute;n).
De modo que las librer&iacute;as, por ejemplo para creaci&oacute;n
de CGIs no funcionan de una funci&oacute;n a otra por lo que la
migraci&oacute;n es poco practica.
<P>
As&iacute; pues, la decisi&oacute;n sobre que versi&oacute;n utilizar
depende del trabajo que haya sido realizado con anterioridad,
si ya se tiene un sistema completo o grande en Perl 4, es recomendable
mantenerlo en Perl 4 por el resto de su vida &uacute;til, pero
para desarrollos nuevos es por mucho, mas recomendable iniciarlos
con Perl 5 o en su caso, la versi&oacute;n mas reciente que este
disponible, por experiencia se que la capacitaci&oacute;n para
adaptarse a la nueva versi&oacute;n es extraordinariamente corta
dada la importancia de las mejoras. Una tercera opci&oacute;n
(que es por mucho la mas recomendable si se tienen los recursos)
consiste en instalar las dos versiones de modo que convivan en
el sistema.<P>

<BODY>
