<!doctype html public "-//IETF//DTD HTML//EN">
<HTML>

<HEAD>

<TITLE>        3.1- Uso de Perl en linea, Tareas Comunes</TITLE>

</HEAD>

<BODY>
<A HREF="#3">
<H1>3- PROGRAMACI&Oacute;N ESPECIAL</H1></A>
<blockquote>
<H2><A HREF="#3.1">
3.1- Uso de Perl en l&iacute;nea, Tareas Comunes</A></H2>
<blockquote>
<H3><A HREF="#3.1.1">
3.1.1- Formas de Especificar el programa</A></H3>
<H3><A HREF="#3.1.2">
3.1.2- Interruptores</A></H3>
<H3><A HREF="#3.1.3">
3.1.3- Tareas Comunes de Perl en L&iacute;nea de Comando</A></H3>
<blockquote>
<H4><A HREF="#3.1.3.1">
3.1.3.1- Reemplazar una cadena en un archivo por otra</A></H4>
<H4><A HREF="#3.1.3.2">
3.1.3.2- Imprimir alg&uacute;n campo de un archivo</A></H4>
</blockquote></blockquote></blockquote>
<hr>

<A NAME="3"><H1>3- PROGRAMACIÓN ESPECIAL</H1></A>
En la <a href="tutorial_perl2.html">Seccion 2</a>, revisamos la 
programaci&oacute;n b&aacute;sica
en Perl, pero la programaci&oacute;n en este lenguaje se basa, sobretodo, en 
gran cantidad de optimizaciones y formas alternativas de realizar tareas comunes
lo que le d&aacute; una funcionalidad adicional que lo hace en extremo valioso
en la realizaci&oacute;n de estas tareas o aquellas que las requieran.<BR>
Por eso es que dedico toda una secci&oacute;n de este tutorial a tratar estas
caracter&iacute;sticas y el modo de emplearlas, para que el nuevo programador,
no solo pueda elaborar programas en Perl, sino que pueda explotarlo para
facilitar la realizaci&oacute;n de sus tareas mas usuales.<p>
<blockquote>
<A NAME="3.1"><H2>3.1- Uso de Perl en l&iacute;nea, Tareas Comunes</H2></A>
</blockquote>
<P>
Una de las caracter&iacute;sticas de Perl dada su semi naturaleza
de interprete es que puede ser ejecutado y actuar como un interprete
de comandos (aunque los ejecuta hasta el momento de terminar todas
las instrucciones con un fin de archivo desde teclado.
<P>
Adem&aacute;s, Perl tiene varias opciones en l&iacute;nea que
son de extraordinaria utilidad, por ejemplo, para substituir cadenas
a lo largo de todo un archivo, o indicar que los errores se expresen
en un formato mas entendible (en caso de que no este como default
desde que lo compilamos), etc.
<P>
Esta secci&oacute;n, se dedica a revisar algunos de estos par&aacute;metros
de Perl enfocado a usos espec&iacute;ficos.
<blockquote><blockquote>
<A NAME="3.1.1"><H3>3.1.1- Formas de Especificar el programa</H3></A>
</blockquote></blockquote>
<P>
Existen tres m&eacute;todos de indicar a Perl cual ha de ser el
script a ejecutar:
<P>
1- Ejecutando un script directamente que especifique la colocaci&oacute;n
de Perl con una l&iacute;nea que inicie con &quot;<TT>#!</TT>&quot;
<P>
2- Pasando el script por la entrada est&aacute;ndar a Perl (completo
con todo y fin de archivo), Pero esta opci&oacute;n no admitir&aacute;
par&aacute;metros para el script.
<P>
3- Especificado las instrucciones en l&iacute;nea de comando con
el interruptor -e. Esta la revisaremos con cuidado cuando veamos
los interruptores.
<blockquote><blockquote>
<A NAME="3.1.2"><H3>3.1.2- Interruptores</H3></A>
</blockquote></blockquote>
<P>
En esta secci&oacute;n no intento revisar todos los interruptores
descritos en la secci&oacute;n PERLRUN de la referencia, sino
solo algunos de ellos enfocados a comprender mejor el como se
realizan algunas tareas con Perl en l&iacute;nea de comando, y
el orden tambi&eacute;n ha sido modificado tratando de hacer mas
f&aacute;cil su comprensi&oacute;n.
<PRE>
<B>-e comando</B>
</PRE>

<P>
Este interruptor se usa para indicar una l&iacute;nea de c&oacute;digo
en Perl a ejecutar (nota solo una, completa con &quot;<TT>;</TT>&quot;),
si se da este interruptor, Perl no buscara un nombre de script
en la lista de argumentos ,ni la recibir&aacute; por la entrada
est&aacute;ndar. Para formar un script de varias l&iacute;neas,
se puede dar varias veces este interruptor con l&iacute;neas distintas.
<PRE>
<B>-n </B>
</PRE>

<P>
Hace que Perl asuma que existe el ciclo siguiente alrededor del
script que le damos:
<PRE>
<B>while(&lt;&gt;)
{
   #aqui va el script
}
-p</B>
</PRE>

<P>
Al igual que &quot;<TT>-n</TT>&quot; hace que Perl asuma un ciclo
alrededor del script, pero adem&aacute;s, hace que imprima autom&aacute;ticamente
el ultimo valor evaluado de cada ciclo del script, lo que equivale
al siguiente ciclo:
<PRE>
<B>while(&lt;&gt;)
{
  #El script va aqu&iacute;
} continue
{
  print;
}</B>
</PRE>

<P>
El uso del interruptor -p inhibe al interruptor <TT>-n</TT>.
<PRE>
<B>-a</B>
</PRE>

<P>
Al estar usando un interruptor &quot;<TT><B>-e</B></TT>&quot;
o &quot;<TT><B>-p</B></TT>&quot; hace que los renglones que se
van leyendo en el ciclo del &quot;<TT><B>-n</B></TT>&quot; o &quot;<TT><B>-p</B></TT>&quot;
pasen por un &quot;<TT><B>split</B></TT>&quot; con el delimitador
especificado con el interruptor <TT><B>-F</B></TT> y sean asignados,
ya como arreglos a <TT><B>@F</B></TT>, resultando en la siguiente
estructura del <TT><B>while</B></TT>:
<PRE>
<B>while(&lt;&gt;){
  @f=split(' ');
  #aqui va el script
}
-F</B>
</PRE>

<P>
Con este interruptor determina una expresi&oacute;n regular la
cual se usara como delimitado para el split del switch &quot;<TT><B>-a</B></TT>&quot;,
se puede poner el patr&oacute;n entre &quot;<TT><B>/</B></TT>&quot;
siendo estos ignorados. Nota: los interruptores <TT><B>-a</B></TT>
y <TT><B>-F</B></TT> son exclusivos de Perl 5.
<PRE>
<B>-iextencion</B>
</PRE>

<P>
Especifica que los archivos procesados por &quot;<TT><B>&lt;&gt;</B></TT>&quot;
sean editados en su lugar, esto es, que el archivo de entrada
sea movido a otro archivo con la extensi&oacute;n especificada,
y que en el archivo original se vayan escribiendo los resultados
que generemos. Si no se especifica ninguna extensi&oacute;n, al
final del proceso no habr&aacute; ning&uacute;n archivo con la
informaci&oacute;n original.
<PRE>
<B>-v</B>
</PRE>

<P>
Imprime la versi&oacute;n y nivel de parches del ejecutable de
Perl.
<PRE>
<B>-w</B>
</PRE>

<P>
Imprime advertencias sobre identificadores que se usen solo una
vez, escalares que se usan sin haber recibido valor, subrutinas
indefinidas, archivos sobre los que intentemos de realizar operaciones
para las que no fueron abiertos, etc. Se recomienda para diagnosticas
problemas en los programas.
<P>
Habiendo revisado algunos interruptores, ahora vamos a ver algunos
ejemplos de las cosas que podemos hacer con ellos.
<blockquote><blockquote>
<A NAME="3.1.3"><H3>3.1.3- Tareas Comunes de Perl en L&iacute;nea de Comando</H3></A>
</blockquote></blockquote>
<P>
Enti&eacute;ndase por L&iacute;nea de Comando, que desde nuestro
interprete de comandos, invocamos Perl con los par&aacute;metros
adecuados para que realice una funci&oacute;n sin necesidad de
haber escrito un script, por supuesto, no son tareas muy complejas,
pero llegan a ser deslumbrantemente &uacute;tiles.
<blockquote><blockquote><blockquote>
<A NAME="3.1.3.1"><H4>3.1.3.1- Reemplazar una cadena en un archivo por otra</H4></A>
</blockquote></blockquote></blockquote>
<P>
Es muy com&uacute;n que, por ejemplo, deseemos reemplazar todas
las ocurrencias de, digamos, un camino y nombre de programa, por
otro en un archivo de texto que podr&iacute;a ser el c&oacute;digo
fuente de un programa o alguna otra cosa, muchos procesadores
de palabra soportan este tipo de procesos, pero con Perl no se
requieren herramientas extra y podemos trabajar de un solo golpe
grandes cantidades de archivos.
<P>
el comando seria de la forma:
<PRE>
<B>Perl -pi.bak -e &quot;s/CADENA1/CADENA2/g;&quot; archivo1 archivo2 archivo3</B>
</PRE>

<P>
Recordando lo que significan los interruptores:
<P>
<TT><B>-p</B></TT> indica que alrededor de la instrucci&oacute;n
tenemos un ciclo que revisara todas las l&iacute;neas de todos
los archivos que se pasen como par&aacute;metros a script, adem&aacute;s,
que los resultados se  imprimir&aacute;n (a la salida est&aacute;ndar).
Como este interruptor no recibe valores, puede acompa&ntilde;arse
de otro interruptor (en este caso, &quot;<TT><B>-p -i</B></TT>&quot;
es equivalente a &quot;<TT><B>-pi</B></TT>&quot;).
<P>
<TT><B>-i</B></TT> Los archivos procesados ser&aacute;n editados
en l&iacute;nea, generando respaldos de estos con la extensi&oacute;n
<TT><B>.bak</B></TT>, la salida est&aacute;ndar del bloque de
&quot;<TT><B>-p</B></TT>&quot; se redirecciona a los archivos
origianles, de modo que los resultados del script ser&aacute;n
el nuevo contenido de los archivos originales.
<P>
<TT><B>-e</B></TT> El comando a ejecutar dentro del ciclo, y cuyo
resultado ser&aacute; el nuevo contenido de los archivos es una
substituci&oacute;n (usamos impl&iacute;citamente el argumento
default <TT><B>$_</B></TT> para indicar sobre que se hace la substituci&oacute;n),
el comando, es una substituci&oacute;n del patr&oacute;n en toda
la l&iacute;nea le&iacute;da.
<P>
<TT><B>archivo1 archivo2 archivo3</B></TT> Son los archivos que
usa el ciclo de &quot;<TT><B>-p</B></TT>&quot; que, como en el
caso de cualquier otro script que usa &quot;<TT><B>&lt;&gt;</B></TT>&quot;
son recibidos como par&aacute;metros.
<P>
El resultado final es que generamos <TT><B>archivo1.bak, archivo2.bak,
archivo3.bak</B></TT> y <TT><B>archivo1, archivo2</B></TT> y <TT><B>archivo3
</B></TT>y en los &uacute;ltimos la <TT><B>CADENA1</B></TT> ha
sido reemplazada por <TT><B>CADENA2</B></TT>.
<blockquote><blockquote><blockquote>
<A NAME="3.1.3.2"><H4>3.1.3.2- Imprimir alg&uacute;n campo de un archivo</H4></A>
</blockquote></blockquote></blockquote>
<P>
En UNIX, gran parte de la informaci&oacute;n del sistema se almacena
en archivos de texto con separadores para indicar campos, siendo
cada rengl&oacute;n un registro, adem&aacute;s, como un ejemplo
sencillo, planteemos una ejecuci&oacute;n en l&iacute;nea de Perl
que imprima todos los logins del etc/passwd que pertenezcan a
un cierto grupo, digamos, el 100.
<PRE>
<B>Perl -anF: -e 'if($F[3]==100){print &quot;$F[0]\n&quot;;}' /etc/passwd</B>
</PRE>
</BODY>

