<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Art&iacute;culo para la revista Linux Actual n&uacute;mero 17:"Gesti&oacute;n SNMP con Linux"</TITLE>


</HEAD>
<BODY>
<H1>Art&iacute;culo para la revista Linux Actual n&uacute;mero 17:"Gesti&oacute;n SNMP con Linux"</H1>

<H2>Javier Fern&aacute;ndez-Sanguino Pe&ntilde;a</H2>12 Febrero 2001
<P><HR>
<EM> En este art&iacute;culo se ver&aacute;n a ver las distintas herramientas
para utilizar un sistema GNU/Linux dentro de una red de gesti&oacute;n SNMP,
tanto en la parte de agente como gestor.</EM>
<HR>
<H2><A NAME="s1">1. Introducci&oacute;n a SNMP</A></H2>

<P>SNMP (<EM>Simple Network Management Protocol</EM>) es el protocolo
definido por los comit&eacute;s t&eacute;cnicos de Internet para ser utilizado como
una herramienta de gesti&oacute;n de los distintos dispositivos en cualquier
red. El funcionamiento de SNMP es sencillo, como dice el protocolo,
aunque su implementaci&oacute;n es tremendamente compleja. SNMP utiliza la
capa de transporte de TCP/IP mediante el env&iacute;o de datagramas UPD, sin
embargo, el hecho de usar UDP hace que el protocolo no sea fiable (en
UDP no se garantiza la recepci&oacute;n de los paquetes enviados, como en
TCP).
<P>El protocolo SNMP est&aacute; cubierto por un gran n&uacute;mero de RFCs
(<EM>Request For Comments</EM>), entre ellos el RFC 1157, 1215
(versi&oacute;n 1), del 1441 al 1452 (versi&oacute;n 2), del 2271 al 2275 y del 2570
al 2575 (para SNMP v3). El listado completo est&aacute; disponible en
http://wwwsnmp.cs.utwente.nl/General/mngt-rfc.html.
<P>SNMP se basa en un conglomerado de agentes. Cada agente es un elemento
de la red que ofrece unas determinadas variables al exterior, para ser
le&iacute;das o modificadas. Asimismo, un agente puede enviar "alertas" a
otros agentes para avisar de eventos que tengan lugar. Generalmente se
llama "gestor" al agente encargado de recibir estos eventos.
<P>El esquema es sencillo, sin embargo su complejidad se incrementa a la
hora de definir las variables (y su formato). Las variables ofrecidas
para consulta por los agentes SNMP se definen a trav&eacute;s de una MIB
(<EM>Management Information Base</EM>, Base de Informaci&oacute;n de
Gesti&oacute;n). La MIB (hay s&oacute;lo una aunque existen m&uacute;ltiples extensiones a
&eacute;sta) es una forma de determinar la informaci&oacute;n que ofrece un
dispositivo SNMP y la forma en que se representa. La MIB actual es
MIB-II y est&aacute; definida en el RFC 1213, aunque hay m&uacute;ltiples
extensiones definidas en otros RFCs. La MIB est&aacute; descrita en ASN.1
para facilitar su transporte transparente por la capa de red.
<P>Cada agente SNMP ofrece informaci&oacute;n dentro de una MIB, tanto de la
general (definida en los distintos RFCs) como de aquellas extensiones
que desee proveer cada uno de los fabricantes. As&iacute;, los fabricantes
de routers han extendido las MIBs est&aacute;ndar incluyendo informaci&oacute;n
espec&iacute;fica de sus equipos.
<P>¿Qu&eacute; se puede hacer con SNMP? Con SNMP se puede monitorizar el estado
de un enlace punto a punto para detectar cuando est&aacute; congestionado y
tomar as&iacute; medidas oportunas, se puede hacer que una impresora alerte
al administrador cuando se ha quedado sin papel, o que un servidor
env&iacute;e una alerta cuando la carga de su sistema incrementa
significativamente. SNMP tambi&eacute;n permite la modificaci&oacute;n remota de la
configuraci&oacute;n de dispositivos, de forma que se podr&iacute;a modificar las
direcciones IP de un ordenador a trav&eacute;s de su agente SNMP, u obligar a
la ejecuci&oacute;n de comandos (si el agente ofrece las funcionalidades
necesarias)
<P>
<H2><A NAME="s2">2. SNMP en GNU/Linux</A></H2>

<P>Ahora bien, SNMP es un mundo muy complejo y amplio y el lector
posiblemente est&aacute; interesado con saber qu&eacute; puede hacer con SNMP en su
servidor GNU/Linux y de qu&eacute; herramientas dispone para hacerlo. Pues
bien, con GNU/Linux y con herramientas de software libre se pueden
hacer, entre otras cosas, las siguientes:
<P>
<UL>
<LI>instalar un agente SNMP para monitorizar variables en un
servidor con GNU/Linux.
</LI>
<LI>utilizar en una estaci&oacute;n con GNU/Linux una herramienta de
gesti&oacute;n para observar variables de agentes SNMP.
</LI>
<LI>programar un interfaz para tomar medidas en base a la consulta
(monitorizaci&oacute;n de variables de un elemento SNMP).
</LI>
<LI>programar un interfaz para recibir alertas SNMP y tratarlas como
sea necesario.</LI>
</UL>
<P>Existen, tambi&eacute;n, herramientas propietarias para llevar a cabo estas
funciones. Algunas de las m&aacute;s conocidas, como HP OpenView, SunNet
Manager e IBM Netview, soportan muchas de las funciones que se van a
tratar aqu&iacute;. Sin embargo se va a entrar en detalle en herramientas de
software libre, por considerarse que ser&aacute;n las herramientas m&aacute;s
utiles para un desarrollador que quiera conocer "por dentro" el 
funcionamiento de los protocolos. 
<P>El estar en posesi&oacute;n del c&oacute;digo fuente ayuda en gran medida a la
persona que tiene que entrar en contacto con la tecnolog&iacute;a ya que,
r&aacute;pidamente, puede familiarizarse con &eacute;sta a trav&eacute;s de una
implementaci&oacute;n, o la puede poner a prueba compil&aacute;ndola e instal&aacute;ndola.
<P>
<H2><A NAME="s3">3. Agentes SNMP</A></H2>

<P>En la mayor&iacute;a de los sistemas GNU/Linux, se incluye un agente de SNMP
que se trata de uno de los m&aacute;s desarrollados en la actualidad. Se
trata de la actualizaci&oacute;n de la librer&iacute;a SNMP de la Universidad de
California en Davis (que a su vez se basa en la librer&iacute;a de la
Universidad de Carnegie Mellon).  La librer&iacute;a se llamaba, en
versiones previas <CODE>ucd-snmp</CODE>, ahora se denomina
<CODE>net-snmp</CODE>. La versi&oacute;n actual ha sido portada a GNU/Linux de la
librer&iacute;a original por Juergen Schoenwaelder y Erik Schoenfelder, el
desarrollador principal es Wes Hardaker.
<P>Esta librer&iacute;a ha sido muy actualizada y desarrollada e incluye las
herramientas de SNMP "tradicionales". Las &uacute;ltimas versiones parten de
la base de c&oacute;digo de la versi&oacute;n 2.1 y han sido tremendamente
mejoradas.
<P>La versi&oacute;n actual, la 4.1, incluye soporte para todas las versiones de
SNMP (desde la uno, a la tres). Los agentes de SNMP que instala son
perfectamente extensibles, tanto a trav&eacute;s del propio c&oacute;digo (con la
API proporcionada) como a trav&eacute;s de comandos definidos en la
configuraci&oacute;n.
<P>Al tratarse de un software de agentes tan extendido, es conveniente
detenerse un poco en su instalaci&oacute;n y configuraci&oacute;n, as&iacute; como en las
herramientas que proporciona.
<P>
<H2>3.1 Instalaci&oacute;n de net-smp</H2>

<P>El primer paso ser&aacute;, sin duda, obtener el c&oacute;digo fuente de la
distribuci&oacute;n. Anteriormente estaba disponible en http://ucd-snmp.ucdavis.edu, pero
ahora se ha movido a sourceforge (para aprovechar los recursos
que &eacute;ste ofrece para proyectos libres) y est&aacute; disponible en
http://www.sourceforge.net/proyects/net-snmp.
<P>Una vez descargado y descomprimido en un directorio, se puede proceder
a compilar el c&oacute;digo fuente para ello se hace desde el ra&iacute;z:
<P>
<BLOCKQUOTE><CODE>
<PRE>
 
$ configure 
$ make all
</PRE>
</CODE></BLOCKQUOTE>
 
<P>y, con suerte, quedar&aacute; compilado y preparado para instalar. Esta
libreria no depende de otras, es autocontenida, lo que facilita su
compilacion Lo cual se podr&aacute; hacer con <CODE>make install</CODE>. Ahora
queda poner una configuraci&oacute;n adecuada en el fichero
<CODE>/etc/snmp/snmpd.conf</CODE>
<P>Las distribuciones actuales, por ejemplo Debian &oacute; RedHat, incorporan
ya el paquete de <CODE>ucd-snmp</CODE> de forma que su instalaci&oacute;n es mucho m&aacute;s
sencilla (son binarios ya compilados) y su configuraci&oacute;n r&aacute;pida. Por
ejemplo, para el paquete Debian de <CODE>ucd-snmp</CODE>, basta con instalarlo para
tener ya un agente ejecut&aacute;ndose de forma transparente al usuario.
<P>De hecho en la distribuci&oacute;n se incluyen dos agentes. El primero
<CODE>snmpd</CODE> es un agente que permanece escuchando en el puerto 161
(udp) esperando recibir peticiones, cuando le llega una solicitud la
procesa y devuelve la informaci&oacute;n. El segundo, <CODE>snmptrapd</CODE> se
trata de un agente que procesa las alertas de otros agentes. Para ello
permanece escuchando en el puerto 162 (udp), cuando recibe una alerta
por este puerto procede a guardarla en el registro (syslog). Sin
embargo tambi&eacute;n puede ser configurado para utilizar programas externos
en el tratamiento de las alertas.
<P>Los agentes de Net-snmp incluyen una serie de extensiones para poder
obtener informaci&oacute;n espec&iacute;fica del sistema como son:
<P>
<UL>
<LI>informaci&oacute;n general del sistema</LI>
<LI>conexiones tcp/udp/ip/snmp abiertas y estado</LI>
<LI>discos duros </LI>
<LI>procesos y carga del procesador</LI>
</UL>
<P>
<P>
<H2>3.2 Configuraci&oacute;n de los agentes</H2>

<P>Una vez instalados los agentes s&oacute;lo ser&aacute; necesario adaptarlo a las
necesidades del equipo en el que va a estar instalado. La librer&iacute;a
incluye una buena documentaci&oacute;n que describe el formato de los
ficheros de configuraci&oacute;n.
<P>En la p&aacute;gina de manual <CODE>snmpd_config</CODE> se describe el funcionamiento
general de los ficheros de configuraci&oacute;n.  En la instalaci&oacute;n en
sistemas Debian, el agente queda instalado con un fichero de ejemplo
de configuraci&oacute;n, en otros caso sera necesario copiar (o crear) uno en
<CODE>/etc/snmp/snmpd.conf</CODE>. Pero muchos de los problemas pueden venir
por no entender correctamente el modo de funcionamiento de la
autenticaci&oacute;n en SNMP.
<P>Las primeras definiciones en el fichero de configuraci&oacute;n definen las
limitaciones para el acceso al agente desde cualquier servidor.  Uno
de los problemas m&aacute;s comunes es no ser capaz de acceder al agente por
que estas restricciones son muy fuertes o no se han definido
correctamente. El funcionamiento es, quiz&aacute;s, un tanto complejo, pero
esto se debe a que el agente tiene soporte para la autenticaci&oacute;n en
SNMPv1, en SNMPv2c (con comunidades) y en SNMPv3 (a trav&eacute;s de usuarios
y grupos).  Net-snmp implementa el Modelo de Control de Accesos
Basados en Vistas (VACM, <EM>View-Access Control Model</EM>) definido
como RFC.
<P>Lo primero que se debe definir es una relaci&oacute;n entre comunidades y
modelos de seguridad en el agente SNMP, tras esto se define una
relaci&oacute;n entre modelos de seguridad y grupos, se definen vistas (que
son zonas del &aacute;rbol de la MIB) y, finalmente, se indica el acceso
permitido de los grupos a las vistas.
<P>Esto puede parecer complejo, pero quedar&aacute; m&aacute;s claro con un ejemplo. Si
se tiene definida la siguiente relaci&oacute;n:
<P>
<BLOCKQUOTE><CODE>
<PRE>
 
#     sec.name source community 
com2sec readonly default public 
com2sec readwrite 127.0.0.1 private

# sec.model sec.name group 
MyROSystem v1 paranoid group 
MyROSystem v2c paranoid group 
MyROSystem usm paranoid group 
MyROGroup v1 readonly group 
MyROGroup v2c readonly group 
MyROGroup usm readonly group
MyRWGroup v1 readwrite group 
MyRWGroup v2c readwrite group 
MyRWGroup usm readwrite
</PRE>
</CODE></BLOCKQUOTE>
<P>Se est&aacute; incluyendo todos los accesos como comunidad "public" desde
cualquier lugar al grupo <CODE>MyROGroup</CODE>, mientras que los accesos
como comunidad "private" desde el servidor local se vinculan al grupo
<CODE>MyRWGroup</CODE>. Con las siguientes vistas definidas se termina
la definici&oacute;n de los accesos a los agentes:
<P>
<BLOCKQUOTE><CODE>
<PRE>
 
# incl/excl subtree mask 
view all included .1 80 
view system included .iso.org.dod.internet.mgmt.mib-2.system

# context sec.model sec.level match read write notif 
access MyROSystem "" any noauth exact all none none 
access MyROGroup "" any noauth exact all none none 
access MyRWGroup "" any noauth exact all all none
</PRE>
</CODE></BLOCKQUOTE>
<P>Con esta configuraci&oacute;n garantizamos el acceso de escritura al grupo
definido anteriormente (<CODE>MyRWGroup</CODE>) a cualquier parte de la
MIB, mientras que s&oacute;lo se permite leer dentro de la vista
<EM>system</EM> (que est&aacute; definida como una parte limitada de la MIB
disponible) al grupo de s&oacute;lo lectura.
<P>Sin embargo a trav&eacute;s de la configuraci&oacute;n permite adaptar mucho m&aacute;s
que s&oacute;lo el acceso al agente. Entre otras cosas se puede:
<UL>
<LI>Hacer que el agente monitorize la existencia de procesos:
<CODE>proc</CODE>. De esta forma se puede controlar que, por ejemplo, el
proceso <CODE>apache</CODE> tenga m&aacute;s de 100 procesos. Tambi&eacute;n es posible
tomar acciones en caso de que las limitaciones impuestas a los
procesos no se cumplan, defini&eacute;ndolas con <CODE>procfix</CODE>.
</LI>
<LI>Hacer que el agente ejecute comandos con la funci&oacute;n funci&oacute;n
<CODE>exec</CODE>. El agente ejecutar&aacute; estos comandos cuando se consulte
la variable de la MIB que se defina. De esta forma se puede utilizar
el agente como una herramienta de gesti&oacute;n que tome acciones dentro del
sistema, ampliando su comportamiento a algo m&aacute;s all&aacute; que un mero
elemento que monitoriza variables en el sistema.
</LI>
<LI>Hacer que el agente controle la carga de la m&aacute;quina para que se
mantenga en unos l&iacute;mites determinados con el par&aacute;metro <CODE>load</CODE>.
</LI>
<LI>Definir algunos de los par&aacute;metros internos del agente en la MIB,
como la ubicaci&oacute;n del sistema (<CODE>syslocation</CODE>) o la persona de
contacto (<CODE>syscontact</CODE>).
</LI>
<LI>Configurar el agente para enviar alertas a otros agentes cuando
se den las condiciones necesarias. Para ello se tiene que definir la
comunidad a utilizar con <CODE>trapcommunity</CODE> y el servidor concreto
a utilizar con <CODE>trapsink</CODE>, <CODE>trap2sink</CODE>, &oacute;
<CODE>informsink</CODE>.
</LI>
</UL>
<P>
<P>El formato en detalle de la configuraci&oacute;n de los agentes se puede
consultar en la p&aacute;gina de manual <CODE>snmpd.conf</CODE>
<P>
<P>
<H2>3.3 Familiariz&aacute;ndose con el agente</H2>

<P>Ya se deber&iacute;a tener el agente configurado y funcionando, hecho que se
puede comprobar mirando el listado de procesos (con, por ejemplo,
<CODE>ps aux |grep snmp</CODE>) y de conexiones para ver que hay un
proceso <EM>escuchando</EM> en el puerto 161 (con, <CODE>netstat -anp
-u</CODE>). Si no se ha lanzado a&uacute;n habr&aacute; que lanzarlo ejecutando
<CODE>/usr/sbin/snmpd</CODE>, la mayor&iacute;a de las distribuciones instalar&aacute;n
un programa para poder parar y lanzar el demonio de forma sencilla. En
el caso de Debian esto se consigue llamando el script
<CODE>/etc/init.d/snmp</CODE> con la orden <EM>start</EM>.
<P>Tras esto, llega el momento de familiarizarse con las herramientas de
gesti&oacute;n SNMP incluidas dentro de <CODE>net-snmp</CODE>.  Estas son:
<P>
<UL>
<LI><CODE>snmpstatus</CODE> que permite acceder a la situaci&oacute;n del
agente.
</LI>
<LI><CODE>snmpwalk</CODE> que permite <EM>recorrer</EM> la MIB del
agente y sus variables.
</LI>
<LI><CODE>snmpget</CODE> y <CODE>snmpset</CODE> que permiten,
respectivamente, consultar y fijar atributos de SNMP.
</LI>
<LI><CODE>snmptranslate</CODE> permite traducir de un identificador de
objeto (OID) de la MIB a una cadena de caracteres representativa de
&eacute;ste.
</LI>
<LI><CODE>snmpdelta</CODE>, establece un proceso de monitorizaci&oacute;n sobre
una o m&aacute;s variables del agente, de forma que recuperar el valor de
estas variables en periodos de tiempo definidos.
</LI>
<LI><CODE>snmptest</CODE> es una herramienta de prueba del agente, al
conectarse permite, a trav&eacute;s de un interfaz de l&iacute;nea de comandos,
recuperar cualquier variable que este contenga. Indica los m&eacute;todos de
comunicaci&oacute;n usados contra el agente, por si fuera necesaria su
depuraci&oacute;n.
</LI>
<LI><CODE>snmpnetstat</CODE>, es un comando at&iacute;pico en las
distribuciones de SNMP ya que es particular de la distribuci&oacute;n
<CODE>net-snmp</CODE>. Nos permite obtener un listado de los canales de
comunicaci&oacute;n abiertos en una m&aacute;quina, al igual que <CODE>nestat</CODE>,
pero utilizando un agente SNMP para recuperar la informaci&oacute;n.
</LI>
</UL>
<P>Muchas de estas funciones son comunes de cualquier implementaci&oacute;n de
SNMP y el desarrollador las encontrar&aacute; en cualquier distribuci&oacute;n.
<P>As&iacute;, si se desea saber si el agente est&aacute; activo se har&iacute;a:
<BLOCKQUOTE><CODE>
<PRE>
$ snmpstatus -v 1 localhost public 
[127.0.0.1]=>[Linux templar2.2.16-storm #1 Thu Aug 24 18:29:48 PDT 2000 i686] Up: 0:17:56.24
Interfaces: 0, Recv/Trans packets: 1908/1908 | IP: 1906/1906
</PRE>
</CODE></BLOCKQUOTE>
<P>Para consultar toda una rama se puede utilizar el comando
<CODE>snmpwalk</CODE> un ejemplo de su uso se muestra en el listado
1. Para obtener un valor concreto del &aacute;rbol (por ejemplo, la fecha del
sistema) se ejecutar&iacute;a:
<BLOCKQUOTE><CODE>
<PRE>
$ snmpget localhost public host.hrSystem.hrSystemDate.0
host.hrSystem.hrSystemDate.0 = 2001-2-12,18:51:20.0,+1:0
</PRE>
</CODE></BLOCKQUOTE>
<P>
<H2>3.4 Otros agentes SNMP para Linux</H2>

<P>El agente de <CODE>net-snmp</CODE> no es el &uacute;nico agente disponible para los
sistemas GNU/Linux aunque s&iacute; el que posiblemente se incluya en m&aacute;s
distribuciones y est&eacute; m&aacute;s probado y extendido. Otros agentes a
considerar dentro de GNU/Linux son:
<P>
<UL>
<LI><CODE>snmpd-tcl</CODE> (disponible en http://geekcorp.com/snmpd).
Se trata de una extensi&oacute;n mas que un agente en s&iacute;, para proveer la MIB
de Recursos del Sistema (RFC 1514) dentro de un agente SNMP. Est&aacute;
pensado para poder multiplexar varios agentes a trav&eacute;s del mismo
puerto, de forma que cada uno ofrezca una MIB determinada.
</LI>
<LI><CODE>opennms</CODE> el proyecto de Gesti&oacute;n Abierta de Redes
(<EM>Open Network Management</EM>, www.opennms.org) ofrece una
librer&iacute;a  Java con licencia LGPL denominada JoeSNMP. Esta
librer&iacute;a incluye una arquitectura completa de agentes SNMP desde el
agente en s&iacute; a agentes para procesar las alarmas y un gestor gen&eacute;rico.
</LI>
<LI>Agent++, que es una implementaci&oacute;n de agentes SNMP en C++ que
soporta desde la versi&oacute;n 1 hasta la 3. Su licencia de distribuci&oacute;n no
es, sin embargo, libre (disponible en http://www.agentpp.com)
</LI>
<LI>SNMP++, al igual que el anterior est&aacute; programado en C++, pero no
soporta las mismas versiones de SNMP (de hecho es la base sobre la que
se construy&oacute; Agent++). Su licencia de distribuci&oacute;n tampoco es libre,
disponible en http://rosegarden.external.hp.com/snmp++/</LI>
</UL>
<P>
<P>
<H2><A NAME="s4">4. Herramientas para monitorizar agentes</A></H2>

<P>Sin embargo un agente no sirve para mucho sin herramientas que lo
monitoricen, esto lo dir&aacute; cualquier administrador. Dejando de un lado,
temporalmente, el punto de vista del desarrollador y programador
podemos pasar a responder la siguiente pregunta: ¿Qu&eacute; necesita un
administrador? Pues ni m&aacute;s ni menos que una herramienta visual, desde
las que poder consultar las variables de los agentes, poner monitores
para comprobar su evoluci&oacute;n, y ver "gr&aacute;ficamente" las alertas.
<P>Nuestro administrador de sistemas no tiene que pensar que no va a
encontrar &eacute;sto aqu&iacute;, y que &eacute;sto de GNU/Linux es s&oacute;lo para los
desarrolladores. Se le puede informar de que existen un buen n&uacute;mero de
herramientas disponibles para los sistemas GNU/Linux con soporte de
SNMP (o que van a tenerlo pronto, seg&uacute;n sus autores). Importante a
destacar, y esto har&aacute; las delicias del personal de contabilidad, es
que estas herramientas no tienen licencias de miles de euros (como sus
equivalentes propietarias) y que no les van tan a la zaga en cuanto a
caracter&iacute;sticas y funcionalidad disponible.
<P>Entre otras herramientas podemos hablar de :
<P>
<P>
<UL>
<LI>Scotty (tambi&eacute;n conocido como tkined), es una herramienta
completa de monitorizaci&oacute;n incluye capacidades de
gesti&oacute;n/monitorizaci&oacute;n de dispositivos SNMP.  Est&aacute; implementada en
Tcl/Tk, con extensiones propias, e incluye hasta un navegador de
MIBs. Disponible en http://wwwsnmp.cs.utwente.nl/&nbsp;schoenw/scotty/
</LI>
<LI>Softguard. Se trata de un navegador para agentes SNMP y sus
MIBs, incluye funciones de auto descubrimiento y est&aacute; tambi&eacute;n
implementado en Tcl/Tk aunque est&aacute; mucho m&aacute;s orientado hacia SNMP que
Scotty. Se puede obtener de
http://www.osn.de/user/finzel/html/sgSpies.html

</LI>
<LI>NetraMet. Se trata de una herramienta dise&ntilde;ada para gestionar el
accounting de servidores (RFC 1272, 2063, 2064 y 2123). Incluye una
implementaci&oacute;n para tratar las extensiones de NetFlow de
CISCO. Descargable desde http://www.auckland.ac.nz/net/NeTraMet/
</LI>
<LI>Gxsnmp es un gestor de elementos SNMP a&uacute;n en desarrollo pero con
un gran potencial. Las versiones actuales son betas muy recientes que
carecen de un gran n&uacute;mero de funcionalidades. Sin embargo sus bases
son s&oacute;lidas. Utiliza una base de datos para almacenar la informaci&oacute;n
de agentes y redes (tiene interfaces programados a varias, entre
otras, mysql), y la librer&iacute;a SMI para acceder a las MIBs. Es posible
que, en un futuro y cuando sea m&aacute;s madura, sea la aplicaci&oacute;n por
excelencia para gesti&oacute;n de agentes SNMP en entornos GNU/Linux. Se
puede obtener en http://www.gxsnmp.org
</LI>
<LI>Gkrellm es un monitor que permite monitorizar m&uacute;ltiples
caracter&iacute;sticas del sistema, desde la capacidad del disco al uso de la
CPU con un bonito widget en el escritorio. Existe una extensi&oacute;n a este
monitor que permite incorporar variables SNMP para monitorizarlas
junto con el resto de caracter&iacute;sticas del sistema.
</LI>
<LI>mrtg. Herramienta con interfaz WWW que permite una lectura en
tiempo real de estad&iacute;sticas de distintos elementos, entre otros,
dispositivos SNMP. Es una de las herramientas m&aacute;s conocidas para
monitorizaci&oacute;n de tr&aacute;fico, y una de las m&aacute;s extendidas. Consultar
www.mrtg.org
</LI>
<LI>cheops. Herramienta sustitutiva de scotty para la gesti&oacute;n de
elementos de red, a&uacute;n no incluye soporte de SNMP pero es tremendamente
gr&aacute;fica e intuitiva.
</LI>
<LI>mon. Se trata de una herramienta integrada para la gesti&oacute;n de
red, soportando m&uacute;ltiples sistemas en los que, a trav&eacute;s de agentes, se
pueden monitorizar las aplicaciones de &eacute;stos y su rendimiento. Tiene
soporte de SNMP y ofrece la posibilidad de definir muchos niveles de
alertas, desde correo electr&oacute;nico a notificaciones con voz en tiempo
real. Disponible en http://www.kernel.org/software/mon.
</LI>
<LI>big brother. Pretende ser una herramienta integrada, con una
interfaz orientada a WWW para monitorizar estad&iacute;sticas. Su licencia no
permite la distribuci&oacute;n comercial, pero a&uacute;n as&iacute; tiene caracter&iacute;sticas
interesantes, aunque se ve superada por las anteriores.</LI>
</UL>
<P>
<H2><A NAME="s5">5. Desarrollo de agentes</A></H2>

<P>No se puede terminar este art&iacute;culo sin estudiar la forma de integrar
la gesti&oacute;n SNMP con aplicaciones a trav&eacute;s de la programaci&oacute;n de
interfaces de acceso SNMP. De no hacerlo as&iacute; es probable que alg&uacute;n
programador experimentado se sienta defraudado por no haber llegado
hasta el &uacute;ltimo detalle.
<P>Pues bien, aunque existan herramientas, como ya se han visto, de
gesti&oacute;n de dispositivos, un desarrollador puede querer generar su
propia aplicaci&oacute;n a medida para acceder a valores ofrecidos por
elementos SNMP. De hecho esto puede ser incluso un requisito de un
cliente y quiz&aacute;s la soluci&oacute;n no este disponible entre los elementos
que ya hemos destacado. 
<P>Actualmente se pueden desarrollar aplicaciones con acceso a SNMP
utilizando librer&iacute;as libres en tres lenguajes distintos: Perl, Tcl/Tk,
PHP, C y Java.
<P>En el caso de Perl existen tres librer&iacute;as distintas de acceso a SNMP,
la librer&iacute;a Net::SNMP (disponible en cpan.perl.org), la librer&iacute;a
SNMP_session (disponible en
ftp://ftp.switch.ch/software/sources/network/snmp/perl/) y el m&oacute;dulo
de extensi&oacute;n de Perl para la librer&iacute;a UCD SNMPv3 (disponible en
ftp://ftp-east.baynetworks.com/netman/snmp/perl5).  Salvo la &uacute;ltima,
estas librer&iacute;as no necesitan tener ninguna librer&iacute;a de agentes
instalada en el sistema.
<P>Para Tcl existe la extensi&oacute;n proporcionada por el interfaz de gesti&oacute;n
<CODE>scotty</CODE> denominada <CODE>Tnm::snmp</CODE> (Tnm es la extensi&oacute;n
para herramientas de gesti&oacute;n de red) que permite incorporar funciones
de gesti&oacute;n de SNMP tanto dentro de <CODE>scotty</CODE> como fuera de &eacute;ste.
Tambi&eacute;n el lenguaje PHP (versi&oacute;n 3 y versi&oacute;n 4) incorpora extensiones
con m&oacute;dulos SNMP para poder programa aplicaciones con interfaces WWW
con acceso a dispositivos de red.
<P>Para las versiones compiladas (C y Java) se puede utilizar cualquiera
de las librer&iacute;as de desarrollo mencionadas anteriormente
(<CODE>net-snmp</CODE> u <CODE>openmms</CODE>) ya que cualquiera de ellas
ofrece una API completa para el acceso a las funciones de SNMP.
<P>
<P>
<H2>5.1 Ejemplo de una aplicaci&oacute;n en Perl</H2>

<P>Por &uacute;ltimo se van a ver algunos ejemplos de aplicaciones utilizando la
librer&iacute;a Net::SNMP. Se utiliza &eacute;sta librer&iacute;a por estar mejor orientada
a objetos que las dem&aacute;s librer&iacute;as en Perl, y por estar bien
documentada. N&oacute;tese que la versi&oacute;n de la librer&iacute;a de Perl integrada
con la librer&iacute;a de net-snmp tiene soporte para las &uacute;ltimas versiones
de SNMP (v3). Se ha elegido tambi&eacute;n la primera de &eacute;stas por no
depender de la implementaci&oacute;n concreta de SNMP en el sistema.
<P>En el listado 2 se puede ver un ejemplo de aplicaci&oacute;n con Perl. Esta
aplicaci&oacute;n tan s&oacute;lo recoge una variable SNMP del agente ejecut&aacute;ndose
en el sistema local, dicha variable viene descrita por su
identificador de objeto (los n&uacute;meros punteados de la MIB).
<P>Como se puede ver, lo primero que se hace es crear un objeto sesi&oacute;n,
entregando los par&aacute;metros necesarios para generar la sesi&oacute;n (servidor
al que se va a contactar, comunidad y puerto). Posteriormente, se
llama a la funci&oacute;n de consulta de variables <EM>get_request</EM>. Tras
la comprobaci&oacute;n de errores correspondiente se muestra el resultado y
se cierra la sesi&oacute;n.
<P>La librer&iacute;a puede operar de dos modos: bloqueante o no-bloqueante. En
modo bloqueante las peticiones se ejecutan por el orden indicado y no
se contin&uacute;a el flujo del programa hasta que se lleva a cabo. En el
modo no-bloqueante se puede indicar la funci&oacute;n encargada de procesar
los datos y continuar la ejecuci&oacute;n del programa. Dado que las
peticiones tardan tiempo en ser recibidas por el agente SNMP y
devueltas, puede pensarse en situaciones de comprobaciones de
m&uacute;ltiples agentes (o m&uacute;ltiples variables en m&uacute;ltiples agentes) en las
que lo mejor sea enviar todas las solicitudes a los agentes y procesar
las respuestas en paralelo, en lugar de ir una a una. &Eacute;ste tipo de
programaci&oacute;n es la que se puede realizar con el modo bloqueante.
<P>El resto de las funciones que ofrece el objeto sesi&oacute;n son similares
variando, quiz&aacute;s, algunos par&aacute;metros. Una funci&oacute;n tambi&eacute;n interesante
es <CODE>trap</CODE> que permite enviar alertas a otros agente SNMP. Con
esta funci&oacute;n se puede implementar f&aacute;cilmente, como se muestra en el
Listado 3.
<P>Para entrar en detalles en la programaci&oacute;n de accesos a SNMP es
necesario, casi obligatorio, entrar en detalles del funcionamiento y
acceso a las MIBs de los agentes. Este tema queda, sin embargo, fuera
del &aacute;mbito de este art&iacute;culo.
<P>
<P>
<H2><A NAME="s6">6. Resumen</A></H2>

<P>Se ha dado una visi&oacute;n general de qu&eacute; es es SNMP y c&oacute;mo puede ser
utilizado &eacute;ste, tanto desde el punto de vista de un agente incluido en
el sistema operativo para monitorizar sus acciones a el desarrollo de
aplicaciones con acceso a SNMP pasando someramente por algunas de las
herramientas de monitorizaci&oacute;n disponibles.
<P>
<H2><A NAME="s7">7. Sumarios</A>SNMP es un protocolo de gesti&oacute;nSNMP se basa en conjuntos de agentesCon GNU/Linux se pueden tener y monitorizar agentes SNMPNet-snmp es una de las librer&iacute;as de agentes m&aacute;s notablesExisten herramientas propietarias pero son menos &uacute;tiles a un desarrollador.Los agentes net-snmp son perfectamente extensibles.La definici&oacute;n de accesos puede resultar compleja.Es conveniente familiarizarse con las herramientas de SNMP.Hay m&aacute;s agentes disponibles para GNU/Linux.Existen herramientas para que el administrador monitorice los agentes.Gxsnmp es un gestor en desarrollo con un gran potencialEl desarrollo de aplicaciones que utilizen SNMP es sencillo.Existen librer&iacute;as para acceso a SNMP en Perl, Tcl/Tk, PHP, C y JavaLa librer&iacute;a libnet-snmp-perl est&aacute; bien orientada a objetos y es sencilla de usar.Para entrar en detalles de programaci&oacute;n es necesario conocer las MIBs</H2>

<H2><A NAME="s8">8. Listados</A></H2>

<P>
<P>
<P>LISTADO 1-
<P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
system.sysDescr.0 = Linux templar 2.2.16-storm #1 Thu Aug 24 18:29:48 PDT 2000 i686
system.sysObjectID.0 = OID: enterprises.ucdavis.ucdSnmpAgent.linux
system.sysUpTime.0 = Timeticks: (121325) 0:20:13.25
system.sysContact.0 = Root &gt;root@localhost&lt;
system.sysName.0 = templar
system.sysLocation.0 = Mi casa
system.sysORLastChange.0 = Timeticks: (4) 0:00:00.04
system.sysORTable.sysOREntry.sysORID.1 = OID: ifMIB
system.sysORTable.sysOREntry.sysORID.2 = OID: .iso.org.dod.internet.snmpV2.snmpModules.snmpMIB
system.sysORTable.sysOREntry.sysORID.3 = OID: tcpMIB
system.sysORTable.sysOREntry.sysORID.4 = OID: ip
system.sysORTable.sysOREntry.sysORID.5 = OID: udpMIB
system.sysORTable.sysOREntry.sysORID.6 = OID: .iso.org.dod.internet.snmpV2.snmpModules.snmpVacmMIB.vacmMIBConformance.vacmMIBGroups.vacmBasicGroup
system.sysORTable.sysOREntry.sysORID.7 = OID: .iso.org.dod.internet.snmpV2.snmpModules.snmpFrameworkMIB.snmpFrameworkMIBConformance.snmpFrameworkMIBCompliances.snmpFrameworkMIBCompliance
system.sysORTable.sysOREntry.sysORID.8 = OID: .iso.org.dod.internet.snmpV2.snmpModules.snmpMPDMIB.snmpMPDMIBConformance.snmpMPDMIBCompliances.snmpMPDCompliance
system.sysORTable.sysOREntry.sysORID.9 = OID: .iso.org.dod.internet.snmpV2.snmpModules.snmpUsmMIB.usmMIBConformance.usmMIBCompliances.usmMIBCompliance
system.sysORTable.sysOREntry.sysORDescr.1 = The MIB module to describe generic objects for network interface sub-layers
system.sysORTable.sysOREntry.sysORDescr.2 = The MIB module for SNMPv2 entities
system.sysORTable.sysOREntry.sysORDescr.3 = The MIB module for managing TCP implementations
system.sysORTable.sysOREntry.sysORDescr.4 = The MIB module for managing IP and ICMP implementations
system.sysORTable.sysOREntry.sysORDescr.5 = The MIB module for managing UDP implementations
system.sysORTable.sysOREntry.sysORDescr.6 = View-based Access Control Model for SNMP.
system.sysORTable.sysOREntry.sysORDescr.7 = The SNMP Management Architecture MIB.
system.sysORTable.sysOREntry.sysORDescr.8 = The MIB for Message Processing and Dispatching.
system.sysORTable.sysOREntry.sysORDescr.9 = The management information definitions for the SNMP User-based Security Model.
system.sysORTable.sysOREntry.sysORUpTime.1 = Timeticks: (3) 0:00:00.03
(...)
</PRE>
</CODE></BLOCKQUOTE>
<P>
<P>PIE LISTADO 1: Ejemplo de la salida del &aacute;rbol con snmpwalk
<P>
<P>LISTADO 2-
<P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
use strict;
use vars qw($session $error $response);

use Net::SNMP;

($session, $error) = Net::SNMP->session(
   -hostname  =&gt; shift || 'localhost',
   -community =&gt;: shift || 'public',
   -port      =&gt; shift || 161 
);

if (!defined($session)) {
   printf("ERROR: %s.\n", $error);
   exit 1;
}

my $sysUpTime = '1.3.6.1.2.1.1.3.0';

if (!defined($response = $session-&gt;get_request($sysUpTime))) {
   printf("ERROR: %s.\n", $session-&gt;error());
   $session-&gt;close();
   exit 1;
}

printf("sysUpTime para el servidor '%s' es %s\n", 
   $session-&gt;hostname(), 
   $response-&gt;{$sysUpTime}
);

$session-&gt;close();
exit 0;
</PRE>
</CODE></BLOCKQUOTE>

PIE LISTADO 2: Ejemplo de captura de informaci&oacute;n SNMP con Perl
<P>LISTADO 3-
<BLOCKQUOTE><CODE>
<PRE>
use strict;
use vars qw($session $error $response);

use Net::SNMP;

($session, $error) = Net::SNMP-&gt;session(
   -hostname  =&gt; shift || 'localhost',
   -community =&gt; shift || 'public',
   -port      =&gt; shift || 162 
);

if (!defined($session)) {
   printf("ERROR: %s.\n", $error);
   exit 1;
}

my $count = 0;

$response = 1;
while ( $response ) {
   $response = $session-&gt;trap();
   $count++;
   sleep 5;
   print "Sending trap ($count)\n";
}

$session-&gt;close();
exit 0;
</PRE>
</CODE></BLOCKQUOTE>

PIE LISTADO 3: Ejemplo de env&iacute;o de alertas con Perl
<P>
<P>
<P>LISTADO 4
<P>Estos son algunos enlaces &uacute;tiles generales para SNMP:
<UL>
<LI>snmplink.org. Sobre todo destaca la relaci&oacute;n de herramientas
para SNMP en http://www.snmplink.org/src/Tools.html</LI>
<LI>snmpworld.com
</LI>
<LI>La FAQ de SNMP, diponible de 
ftp://rtfm.mit.edu/pub/usenet/comp.protocols.snmp/
</LI>
<LI>El servidor del proyecto de Gesti&oacute;n Abierta de Redes:
www.opennms.org
</LI>
<LI>El HOWTO de Networking en Linux, disponible en www.linuxdoc.org/LDP/
</LI>
<LI>Un art&iacute;culo, un tanto desactualizado, pero interesante, firmado
por David Guerrero sobre SNMP y Linux, disponible en
http://www.david-guerrero.com/papers/snmp/
</LI>
<LI>Un listado (no actualizado, pero &uacute;til) de herramientas
de administraci&oacute;n para Linux: http://linas.org/linux/NMS.html
</LI>
<LI>El grupo de noticias: comp.protocols.snmp </LI>
</UL>
<P>Por supuesto hay multitud de libros en relaci&oacute;n con SNMP, consulte
la FAQ para ver una buena relaci&oacute;n de &eacute;stos.
<P>
<P>PIE LISTADO 4: M&aacute;s informaci&oacute;n
<P>
<H2><A NAME="s9">9. Capturas</A></H2>

<P>
<UL>
<LI>Captura 1. gxsnmp-browser.jpg. El navegador gr&aacute;fico de MIBs de gxsnmp.</LI>
<LI>Captura 2. gxsnmp-netmap2.jpg. Gesti&oacute;n de elementos de red con gxsnmp.</LI>
<LI>Captura 3. mrtg.gif. Ejemplo de estad&iacute;sticas de MRTG.</LI>
<LI>Captura 4. sgimospy.png. Acceso a un agente SNMP desde Softguard.</LI>
<LI>Captura 5. sgmibspy.png. Acceso a las MIBs desde Softguard.</LI>
<LI>Captura 6. gkrellm_snmp.jpg. Monitor integrado con SNMP gkrellm</LI>
</UL>
<P>
<P>
<H2><A NAME="s10">10. Notas de maquetaci&oacute;n</A></H2>

<P>Las capturas son ejemplo de las aplicaciones de monitorizaci&oacute;n listadas en 
el ep&iacute;grafe "Herramientas para monitorizar agentes" convendr&iacute;a que
se situaran en el mismo lugar.
<H2><A NAME="s11">11. Notas de coordinaci&oacute;n</A></H2>

<P>
<P>
</BODY>
</HTML>
