<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
	<TITLE></TITLE>
	<META NAME="GENERATOR" CONTENT="StarOffice/5.1 (Linux)">
	<META NAME="AUTHOR" CONTENT="Juan Antonio Martinez Casta&ntilde;o">
	<META NAME="CREATED" CONTENT="20000120;3440600">
	<META NAME="CHANGEDBY" CONTENT="Juan Antonio Martinez Casta&ntilde;o">
	<META NAME="CHANGED" CONTENT="20000120;4171500">
	<STYLE>
	<!--
		@page { margin: 2cm }
		P { margin-bottom: 0.21cm }
		TD P { margin-bottom: 0.21cm }
	-->
	</STYLE>
</HEAD>
<BODY>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><FONT SIZE=4 STYLE="font-size: 16pt"><I><B>El
soporte de Infrarrojos en Linux (I)</B></I></FONT></P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm">****** T&iacute;tulo: El Soporte de
Infrarrojos en Linux (I)</P>
<P STYLE="margin-bottom: 0cm">****** Autor: Juan Antonio Mart&iacute;nez
&lt;<A HREF="mailto:jantonio@dit.upm.es">jantonio@dit.upm.es</A>&gt;</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm"><B>Entradilla:</B></P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm">	Iniciamos en este n&uacute;mero de
Linux Actual, una serie dedicada al uso y configuraci&oacute;n de
dispositivos de infrarrojos en Linux. En este n&uacute;mero
analizaremos el soporte para sistemas de control remoto</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm"><B>Presentaci&oacute;n:</B></P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm">	Para los usuarios de ordenadores
port&aacute;tiles, son comunes los perif&eacute;ricos que utilizan
dispositivos de comunicaci&oacute;n por infrarrojos. Iniciamos con
este art&iacute;culo una serie donde se describen los diversos
m&eacute;todos de utilizaci&oacute;n de esta tecnolog&iacute;a en
nuestro sistema operativo favorito. En este n&uacute;mero
analizaremos el soporte para control remoto y mandos a distancia; en
el pr&oacute;ximo n&uacute;mero de Linux Actual describiremos el
soporte para el standard IrDA de comunicaci&oacute;n por infrarrojos</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm"><B>Introducci&oacute;n:</B></P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm">	Los usuarios de ordenadores port&aacute;tiles
conocemos bien el hecho de que nuestro equipo siempre debe ir
acompa&ntilde;ado de una bolsa conteniendo cables, fuente de
alimentaci&oacute;n, perif&eacute;ricos diversos, etc. Conscientes de
ello, los fabricantes de hardware han elaborado una serie de
est&aacute;ndares y protocolos para la comunicaci&oacute;n
inal&aacute;mbrica mediande dispositivos infrarrojos. Es el conocido
standard IrDA ( siglas de InfraRed Data Association ). Linux soporta
plenamente dicho estandard, permitiendo la conexi&oacute;n con otros
ordenadores, impresoras, tel&eacute;fonos m&oacute;viles, etc.</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<TABLE WIDTH=100% BORDER=1 BORDERCOLOR="#000000" CELLPADDING=4 CELLSPACING=0>
	<COL WIDTH=256*>
	<THEAD>
		<TR>
			<TD WIDTH=100% VALIGN=TOP>
				<P>IrDA es un standard para la conexi&oacute;n de equipos
				inform&aacute;ticos mediante dispositivos infrarrojos</P>
			</TD>
		</TR>
	</THEAD>
</TABLE>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm">	Por otro lado existen en el domicilio
multitud de aparatos que van acompa&ntilde;ados de su correspondiente
control remoto. El usuario suele buscar la posibilidad de un control
remoto &uacute;nico para todos los equipos, en lugar de tener que
usar el adecuado para cada equipo. Por supuesto se plantea la
posibilidad de controlar los equipos desde el ordenador, simulando el
control remoto, y al contrario &iquest; por qu&eacute; no controlar
el ordenador desde un control remoto ?. Esta opci&oacute;n no tiene
por qu&eacute; parecer extra&ntilde;a: la mayor parte de las tarjetas
de televisi&oacute;n para ordenadores, vienen acompa&ntilde;ada de su
correspondiente mando a distancia. Nada nos impide utilizar dicho
mando para algo m&aacute;s que cambiar de canal.</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm">	Como ejemplo pr&aacute;ctico, el autor
de este art&iacute;culo ha desarrollado un programa para utilizar un
control remoto de un DVD como rat&oacute;n inalambrico, con el que
realiza las presentaciones en diversas conferencias y charlas.</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<TABLE WIDTH=100% BORDER=1 BORDERCOLOR="#000000" CELLPADDING=4 CELLSPACING=0>
	<COL WIDTH=256*>
	<THEAD>
		<TR>
			<TD WIDTH=100% VALIGN=TOP>
				<P>Con Linux podemos utilizar y simular controles remotos de
				diversos electrodom&eacute;sticos</P>
			</TD>
		</TR>
	</THEAD>
</TABLE>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm">	En este art&iacute;culo se describe la
instalaci&oacute;n, configuraci&oacute;n y uso de dispositivos de
control remoto bajo Linux. En el siguiente n&uacute;mero de la serie,
describiremos en detalle la implementaci&oacute;n del protocolo IrDA
en Linux, y describiremos en detalle como utilizar sus
potencialidades.</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm"><B>Dise&ntilde;o y construcci&oacute;n
de un receptor de infrarrojos para el PC</B></P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm">	Es com&uacute;n, al oir la expresi&oacute;n
&quot;puerto de infrarrojos&quot; pensar que todos los dispositivos
de este tipo son compatibles entre s&iacute;. Es m&aacute;s, en el
mercado dom&eacute;stico, el usuario encuentra los denominados
&quot;control remoto universal&quot;, que en teor&iacute;a permite
simular el comportamiento de cualquier otro control remoto... Del
mismo modo, se puede llegar a pensar que si nuestro ordenador dispone
de un puerto IrDA, podr&iacute;a recibir datos de un control remoto.
Nada m&aacute;s lejos de la realidad. 
</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<TABLE WIDTH=100% BORDER=1 BORDERCOLOR="#000000" CELLPADDING=4 CELLSPACING=0>
	<COL WIDTH=256*>
	<THEAD>
		<TR>
			<TD WIDTH=100% VALIGN=TOP>
				<P>No todos los receptores de infrarrojos son compatibles entre
				s&iacute;</P>
			</TD>
		</TR>
	</THEAD>
</TABLE>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm">La comunicaci&oacute;n por infrarrojos
se basa en transmitir mediante un diodo emisor una se&ntilde;al de
una frecuencia dada ( por lo general en la banda de 35-40Khz ) una
se&ntilde;al digital modulada , tal y como se muestra en la figura 1.
El receptor consiste en un fotoreceptor y un demodulador que recibe
un pulso modulado a la frecuencia del emisor y lo demodula a la se&ntilde;al
digital original. El hecho de modular la se&ntilde;al evita las
interferencias con otras fuentes emisoras de se&ntilde;al que
pudieran enmascarar la se&ntilde;al original. El protocolo IrDA, es
mucho m&aacute;s elaborado: existen frecuencias de sincronizaci&oacute;n,
c&oacute;digos de crc, detecci&oacute;n de errores, etc. Por ello un
receptor IrDA es incompatible con los mandos a distancia que
encontramos en casa.</P>

<p>
<table border>
<tr><td>
<!-- nombre de las imagenes a rellenar -->
<img src="modulacion.gif" alt="modulacion.gif"> 
</td></tr>
<tr><th>Figura 1:Codificación y Modulación de la señal</th></tr>
</table>
</p>
<P STYLE="margin-bottom: 0cm">	Por ello, antes de empezar a trabajar
con un mando a distancia, es preciso disponer de un hardware que haga
las veces de receptor. Existen diversas soluciones:</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<UL>
	<LI><P STYLE="margin-bottom: 0cm">Utilizar dispositivos preparados
	expresamente para PC: mandos de DVD, control remoto de tarjetas de
	TV, ratones inalambricos, etc</P>
	<LI><P STYLE="margin-bottom: 0cm">Hacerse uno m&iacute;smo el
	receptor. Para ello deberemos conocer la frecuencia de modulaci&oacute;n
	del emisor.</P>
	<LI><P STYLE="margin-bottom: 0cm">Comprar un receptor universal.
	Existe un producto &quot;irman&quot; comercializado en Internet, que
	consta de un emisor/receptor universal de infrarrojos, a un precio
	aproximado de 40 d&oacute;lares, y que incluye un API y una
	biblioteca de desarrollo para linux</P>
</UL>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm">Lo normal ser&aacute; utilizar un mando
a distancia cuyo receptor est&eacute; adaptado al PC. En el caso de
que queramos hacernos nosotros mismos el receptor, podemos, si no
conocemos la frecuencia de modulaci&oacute;n, acudir a una tienda de
reparaciones a por el m&oacute;dulo receptor, del cual extraeremos el
diodo receptor. En el tercer caso, si no queremos comprar el equipo,
podemos incluso fabricarnoslo nosotros mismos a condici&oacute;n de
que poseamos herramientas para programar microcontroladores.</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<TABLE WIDTH=100% BORDER=1 BORDERCOLOR="#000000" CELLPADDING=4 CELLSPACING=0>
	<COL WIDTH=256*>
	<THEAD>
		<TR>
			<TD WIDTH=100% VALIGN=TOP>
				<P>El lector puede constru&iacute;rse su propio receptor de
				infrarrojos</P>
			</TD>
		</TR>
	</THEAD>
</TABLE>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm">La figura 2  muestra los esquemas
el&eacute;ctricos de un receptor de infrarrojos para PC. La figura 3
muestra el esquema del emisor/receptor &quot;IrMan&quot;. Estos
dispositivos se enchufan al puerto serie de nuestro PC.</P>

<p>
<table border>
<tr><td>
<!-- nombre de las imagenes a rellenar -->
<img src="lirc_hard.gif" alt="lirc_hard.gif"> 
</td></tr>
<tr><th>Figura 2:Esquema eléctrico de un receptor casero</th></tr>
</table>
</p>

<p>
<table border>
<tr><td>
<!-- nombre de las imagenes a rellenar -->
<img src="irman.gif" alt="irman.gif"> 
</td></tr>
<tr><th>Figura 3: Esquema eléctrico del receptor IrMan</th></tr>
</table>
</p>
<P STYLE="margin-bottom: 0cm">Lo primero que llama la atenci&oacute;n
es que el receptor &quot;casero&quot; no utiliza la l&iacute;nea de
entrada de datos del puerto serie. La raz&oacute;n es sencilla: un
mando a distancia no transmite bytes, sino una secuencia de pulsos de
duraci&oacute;n determinada en funci&oacute;n del c&oacute;digo. Es
lo que denominamos &quot;modulaci&oacute;n por duraci&oacute;n de
pulso&quot;, o PDM. Es preciso pues disponer de un driver en el
n&uacute;cleo Linux que sea capaz de medir dichos pulsos, y
traducirlos a datos entendibles por el ordenador, y por los programas
que se desarrollen. El receptor IrMan, incluye un microcontrolador
que realiza la demodulaci&oacute;n PDM. Por ello puede utilizar las
l&iacute;neas estandard de emisi&oacute;n y recepci&oacute;n del
puerto serie. El hecho de utilizar la linea DCD nos permite pues
utilizar el sistema de interrupciones del puerto serie para controlar
los tiempos de activaci&oacute;n y desactivaci&oacute;n de se&ntilde;al
en el puerto.</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm"><B>El paquete LIRC ( Linux Infrared
Remote Control )</B></P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm">LIRC es un proyecto de desarrollo de
programas de gesti&oacute;n de diversos mandos a distancia desde
linux. Consta de las siguientes aplicaciones:</P>
<UL>
	<LI><P STYLE="margin-bottom: 0cm">Un driver que se enlaza con el
	n&uacute;cleo Linux, y que controla el puerto serie</P>
	<LI><P STYLE="margin-bottom: 0cm">Un demonio de gesti&oacute;n que
	traduce las secuencias de bytes generadas por el driver a c&oacute;digos
	de teclas y funciones</P>
	<LI><P STYLE="margin-bottom: 0cm">Un programa para recibir &quot;en
	crudo&quot; secuencias desde el mando a distancia, y mapearlas a
	c&oacute;digos, elaborando el &quot;mapa&quot; del mando a distancia</P>
	<LI><P STYLE="margin-bottom: 0cm">Diversas utilidades, como un
	emulador de rat&oacute;n</P>
	<LI><P STYLE="margin-bottom: 0cm">Una colecci&oacute;n de mapas de
	decodificaci&oacute;n precompilados, que abarca multitud de marcas y
	modelos de mandos a distancia</P>
	<LI><P STYLE="margin-bottom: 0cm">Una librer&iacute;a de
	compatibilidad con los receptores IrMan</P>
	<P STYLE="margin-bottom: 0cm">La figura 4 nos ilustra las
	dependencias de las diversas aplicaciones de las que consta LIRC.
	Podemos ver que existen una serie de dispositivos, que deberemos
	crear con &quot;mknod&quot;. El manual est&aacute; profusamente
	documentado, e indica los diversos procedimientos a seguir. Especial
	menci&oacute;n merece el de la creaci&oacute;n del fichero de
	configuraci&oacute;n.</P>
</UL>
<P STYLE="margin-bottom: 0cm"><BR>
</P>

<p>
<table border>
<tr><td>
<!-- nombre de las imagenes a rellenar -->
<img src="lirc.gif" alt="lirc.gif"> 
</td></tr>
<tr><th>Figura 4: diagrama funcional de la aplicación LIRC</th></tr>
</table>
</p>
<P STYLE="margin-bottom: 0cm">	Una vez configurado y compilado el
paquete, lo primero que haremos ser&aacute; crear el  dispositivo
especiale /dev/lirc y las fifos /dev/lircd y /dev/lircm La segunda
fase del proceso consite en la elaboraci&oacute;n del mapa de
codificaci&oacute;n de nuestro mando a distancia ( en el caso de que
no est&eacute; ya inclu&iacute;do en la lista ). para ello
utilizaremos el programa ofrecido a tal efecto por la aplicaci&oacute;n.</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<TABLE WIDTH=100% BORDER=1 BORDERCOLOR="#000000" CELLPADDING=4 CELLSPACING=0>
	<COL WIDTH=256*>
	<THEAD>
		<TR>
			<TD WIDTH=100% VALIGN=TOP>
				<P>Con LIRC podemos simular, desde el mando a distancia,
				pulsaciones de teclas, movimientos de rat&oacute;n, etc.</P>
			</TD>
		</TR>
	</THEAD>
</TABLE>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm">	Un detalle del fichero de
configuraci&oacute;n es que podemos hacer que el mando a distancia se
comporte de una forma o de otra en funci&oacute;n de la aplicaci&oacute;n:
El programa &quot;irxevent&quot; genera eventos de X enviandolos a la
aplicaci&oacute;n, como si de una tecla o movimiento de rat&oacute;n
se tratara. En funci&oacute;n de la ventana activa se puede codificar
el evento deseado. Otro programa, &quot;lircmd&quot; emula un rat&oacute;n
MouseSystems a trav&eacute;s de la fifo /dev/lircm. De esta manera
podemos substituir el rat&oacute;n del servidor X por el mando a
distancia, o bien hacerlo funcionar en paralelo, utilizando para ello
las X Input Extensions, tal y como se explica en la documentaci&oacute;n</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm"><B>Otros dispositivos de control
remoto.</B></P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm">	Puede ser que el lector se encuentre
con que disponga de un par emisor-receptor de infrarrojos para PC (
por ejemplo, el mando a distancia de la tarjeta de televisi&oacute;n&quot;,
y que dicho</P>
<P STYLE="margin-bottom: 0cm">conjunto no sea compatible con las
especificaciones hardware de IrMan o de LIRC. No es problema: en el
CD-Rom que acompa&ntilde;a a esta revista se incluye un programa
&quot;xremote&quot;, desarrollado por el autor y que cubre todas las
funcionalidades de LIRC, salvo que no utiliza drivers en el n&uacute;cleo,
sino que lee el puerto serie normalmente. En cualquier caso siempre
es necesario el mapeado de c&oacute;digos del mando a distancia a
eventos de tecla o de rat&oacute;n, por lo que ser&aacute; necesario
disponer de alg&uacute;n sistema de captura de datos. El autor
decodific&oacute; las se&ntilde;ales de su mando a distancia mediante
el programa &quot;minicom&quot;, y almacenando en un fichero las
diversas secuencias de bytes recibidas. La foto de la figura 5
muestra el conjunto emisor-receptor utilizado</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>

<p>
<table border>
<tr><td>
<!-- nombre de las imagenes a rellenar -->
<img src="xremote.jpg" alt="xremote.jpg"> 
</td></tr>
<tr><th>Figura 5: Conjunto emisor-receptor de infrarrojos</th></tr>
</table>
</p>
<P STYLE="margin-bottom: 0cm"><B>Resoluci&oacute;n de problemas:</B></P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm">- El problema m&aacute;s habitual es la
ausencia de se&ntilde;al a la entrada del receptor. Esto puede ser
debido a dos motivos:</P>
<UL>
	<UL>
		<LI><P STYLE="margin-bottom: 0cm">La frecuencia del demodulador no
		est&aacute; apareada con la del emisor</P>
		<LI><P STYLE="margin-bottom: 0cm">No est&aacute; activado el
		puerto. Recuerdese que el receptor se alimenta a trav&eacute;s de
		la se&ntilde;al &quot;Request To Send&quot; (RTS), y que el puerto
		debe estar activo y configurado para flujo de datos hardware. En
		caso contrario, ni el receptor estar&aacute; habilitado, ni seremos
		capaces de detectar cambios de nivel en la se&ntilde;al DCD (&quot;Data
		Carrier Detect&quot;)</P>
	</UL>
</UL>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm">-Otro problema com&uacute;n surge con
el programa lircmd, el demonio de emulaci&oacute;n de rat&oacute;n.
Observando detenidamente el c&oacute;digo fuente y compar&aacute;ndolo
con el conocido programa &quot;gpm&quot; vemos que la implementaci&oacute;n
del protocolo &quot;MouseSystems&quot; no es correcta. Los usuarios
que vayan a utilizar esta aplicaci&oacute;n deber&iacute;an ver el
c&oacute;digo de &quot;xremote&quot; para ver la correcta
implementaci&oacute;n</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<TABLE WIDTH=100% BORDER=1 BORDERCOLOR="#000000" CELLPADDING=4 CELLSPACING=0>
	<COL WIDTH=256*>
	<THEAD>
		<TR>
			<TD WIDTH=100% VALIGN=TOP>
				<P>El entorno X-Window nos permite a&ntilde;adir ratones
				adicionales mediante las X-Input Extensions</P>
			</TD>
		</TR>
	</THEAD>
</TABLE>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm">-El programa &quot;irxevent&quot; no
siempre produce los resultados deseados: La generaci&oacute;n y env&iacute;o
de eventos a una aplicaci&oacute;n puede estar bloqueada tanto por el
window manager como por la aplicaci&oacute;n en s&iacute;. En funci&oacute;n
de la ventana, de la aplicaci&oacute;n y del gestor de ventanas, es
posible que algunos eventos sean rechazados, admitiendose solo los
generados por el rat&oacute;n y por el teclado. Por ello la
aplicaci&oacute;n &quot;xremote&quot; permite al usuario escoger la
modalidad de funcionamiento: por eventos, o por emulaci&oacute;n de
rat&oacute;n por puerto auxiliar</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm"><B>Resumen. Conclusiones</B></P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm">	Hemos visto en este art&iacute;culo
como es posible utilizar controles remotos y mandos a distancia con
nuestro sistema operativo favorito. Del mismo modo se ha analizado el
funcionamiendo de estos accesorios e incluso dado pistas para la
fabricaci&oacute;n de receptores hechos por nosotros mismos.</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm">Por otro lado se ha descrito el
programa &quot;LIRC&quot;, su estructura y funcionamiento, y visto
como se puede generalizar este programa en aquellos receptores que no
cumplen las especificaciones de LIRC.</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm">	En cualquier caso el control remoto y
adaptaci&oacute;n de mandos a distancia al equipo no es sino la punta
del iceberg del sistema de infrarrojos de linux. Dedicaremos el
pr&oacute;ximo art&iacute;culo de la serie a explicar el estandard
IrDA, su implementaci&oacute;n en Linux, y su configuraci&oacute;n y
aplicaciones. IrDA constituye un verdadero estandard, independiente
del sistema, bi-direccional y que permite conectar multitud de
equipos, desde impresoras hasta tel&eacute;fonos m&oacute;viles. A
este respecto la implementaci&oacute;n IrDA de Linux es muchisimo m&aacute;s
completa y funcional que la ofrecida para otros sistemas operativos.</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm"><B>Referencias</B></P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm">	En el CD-Rom se incluye la aplicaci&oacute;n
&quot;xremote&quot;, el paquete LIRC, la librer&iacute;a de gesti&oacute;n
de dispositivos IrMan ( libirman ) y diversa documentaci&oacute;n,
entre la que se incluyen diversos esquemas de circuitos, y el manual
t&eacute;cnico de diversos dispositivos receptores de infrarrojos.</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm">Otras referencias son:</P>
<P STYLE="margin-bottom: 0cm">-InfraRed HOWTO</P>
<P STYLE="margin-bottom: 0cm">-The Linux Infrared Remote Controler
Home Page http://fsinfo.cs.uni-sb.de/~columbus/lirc/</P>
<P STYLE="margin-bottom: 0cm">-Documentos de la Infrared Data
Association (IrDA)</P>
</BODY>
</HTML>
