<!--
$Header: /usr/local/cvsroot/pgsql/doc/src/sgml/ref/postmaster.sgml,v 1.7 
1999/10/12 13:59:45 thomas Exp $
Postgres documentation
-->

<refentry id="APP-POSTMASTER">
 <refmeta>
  <refentrytitle id="APP-POSTMASTER-TITLE">
   <application>postmaster</application>
  </refentrytitle>
  <refmiscinfo>Application</refmiscinfo>
 </refmeta>
 <refnamediv>
  <refname id="postmaster-ref">
   <application>postmaster</application>
  </refname>
  <refpurpose>
   Ejecuta el servidor (backend)multiusuario de 
<productname>Postgres</productname>
  </refpurpose>
 </refnamediv>
 <refsynopsisdiv>
  <refsynopsisdivinfo>
   <date>20-07-1999</date>
  </refsynopsisdivinfo>
  <synopsis>
postmaster [ -B <replaceable class="parameter">nBuffers</replaceable> ] [ -D 
<replaceable class="parameter">DataDir</replaceable> ] [ -i ] [ -l ]
postmaster [ -B <replaceable class="parameter">nBuffers</replaceable> ] [ -D 
<replaceable class="parameter">DataDir</replaceable> ] [ -N <replaceable 
class="parameter">nBackends</replaceable> ] [ -S ]
   [ -d [ <replaceable class="parameter">DebugLevel</replaceable> ] [ -i ] [ 
-l ] [ -o <replaceable class="parameter">BackendOptions</replaceable> ] [ -p 
<replaceable class="parameter">port</replaceable> ]
postmaster [ -n | -s ] ...
  </synopsis>

  <refsect2 id="R2-APP-POSTMASTER-1">
   <refsect2info>
    <date>19-05-1999</date>
   </refsect2info>
   <title>
    Inputs
   </title>
   <para>
    <application>postmaster</application> acepta los siguientes 
par&aacute;metros en su l&iacute;nea de comandos:
    
    <variablelist>
     <varlistentry>
      <term>-B <replaceable class="parameter">nBuffers</replaceable></term>
      <listitem>
       <para>
	Indica el n&uacute;mero de buffers de memoria compartida que
	<application>postmaster</application>asignar  y administrar&aacute; 
	para los procesos del servidor que inice. El valor predeterminado para
	esta opci&oacute;n es 64 buffers, siendo cada buffer de 8 kilobytes
	(o lo que sea que est&eacute; indicado en BLCKSZ en config.h).
       </para>
      </listitem>
     </varlistentry>

     <varlistentry>
      <term>-D <replaceable class="parameter">DataDir</replaceable></term>
      <listitem>
       <para>
	Especifica el directorio a usar como ra&iacute;z del arbol de directorios
	de bases de datos. Si no se especifica -D, el nombre de directorio
	predeterminado es el valor de la variable de entorno 
	<envar>PGDATA</envar>.
	Si <envar>PGDATA</envar> no est&aacute; especificada, entonces se utiliza
	el directorio <filename>$POSTGRESHOME/data</filename>.
	Si no se especifica ni la variable de entorno ni esta opci&oacute; de 
	l&iacute;nea de comando, el directorio predeterminado es el utilizado
	al momento de la compilaci&oacute;n.	
       </para>
      </listitem>
     </varlistentry>

     <varlistentry>
      <term>-N <replaceable class="parameter">nBackends</replaceable></term>
      <listitem>
       <para>
	El m&aacute;ximo n&uacute;mero de procesos en el servidor (backend) que
	postmaster tiene permitido iniciar. En la configuraci&oacute;n 
	predeterminada este valor est&aacute; usualmente definido en 32, y puede
	ser fijado hasta un valor m&aacute;ximo de 1024 si su sistema puede
	soportar esa cantidad de procesos. Tanto el valor predeterminado como el
	m&aacute;ximo puede modificarse cuando se compila  
	<productname>Postgres</productname> (vea el archivo src/include/config.h)
       </para>
      </listitem>
     </varlistentry>

     <varlistentry>
      <term>-S</term>
      <listitem>
       <para>
	Indica que el proceso de <application>postmaster</application> debe 
	iniciarse en modo silencioso. Esto es, anular&aacute; la 
	vinculaci&oacute;n con la terminal del usuario (que tiene el control) e 
	iniciar&aacute; su propio grupo de proceso. Esta opci&oacute;n
	no deber&iacute;a utilizarse en conjunto con las opciones de 
	depuraci&oacute;n ya que cualquier mensaje enviado a la salida 
	est&aacute;ndar y a la salida de error est&aacute;ndar ser&aacute;n 
	descartados.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry>
      <term>-d [ <replaceable class="parameter">DebugLevel</replaceable> 
]</term>
      <listitem>
       <para>
	Este argumento <replaceable class="parameter">DebugLevel</replaceable>
	determina la cantidad de informaci&oacute;n de depuraci&oacute;n que
	producir&aacute; el servidor.
	Si <replaceable class="parameter">DebugLevel</replaceable> es uno, 
	postmaster rastrear&aacute; todo el tr&aacute;fico de conexi&oacute;n
	y nada m&aacute;s.
	Para niveles iguales o mayores a 2 se activa la depuraci&oacute;n y el
	proceso del servidor y postmaster muestran m&aacute;s informaci&oacute;n,
	incluyendo el entorno del servidor y tr&aacute;fico de proceso.
	Note que si no se especifica ning&uacute;n archivo para que los 
	servidores del backend env&iacute;en su informaci&oacute;n, esta 
	informaci&oacute;n ser&aacute; exhibida en la terminal de su proceso
	<application>postmaster</application> padre.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry>
      <term>-i</term>
      <listitem>
       <para>
	Esta opci&oacute;n habilita las comunicaciones mediante TCP/IP o mediante 
	el socket de dominio Internet. Sin esta opci&oacute;n solamente es 	posible la comunicaci&oacute;n a trav&eacute;s del socket de dominio  	Unix local.	
       </para>
      </listitem>
     </varlistentry>

     <varlistentry>
      <term>-l</term>
      <listitem>
       <para>
	Este par&aacute;metro habilita la comunicaci&oacute;n mediante el socket 	SSL. Tambi&eacute;n es necesario especificar la opci&oacute;n 
	<option>-i</option>. 
	Adem&aacute;s, debi&oacute; habilitarse SSL en el momento de la 	compilaci&oacute;n.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry>
      <term>-o <replaceable 
class="parameter">BackendOptions</replaceable></term>
      <listitem>
       <para>
	Las opciones de <literal>postgres</literal> que se especifican en
	<replaceable class="parameter">BackendOptions</replaceable> son pasadas
	a todos los procesos iniciados en el servidor por este postmaster.
	are passed to all backend server processes started by this
	<application>postmaster</application>.
	Si la cadena de opciones contiene espacios, entonces debe 	encerr&aacute;rsela entre comillas.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry>
      <term>-p <replaceable class="parameter">port</replaceable></term>
      <listitem>
       <para>
	Especifica el puerto TCP/IP o la extensi&oacute;n de archivo del socket 
	del dominio Unix local en el cual <application>postmaster</application>
	deber&aacute; esperar por conexiones solicitadas desde las aplicaciones 
	del lado del cliente. El valor predeterminado es el especificado en la 	variable de entorno <envar>PGPORT</envar> o, si <envar>PGPORT</envar>
	no fue especificada, se toma como predeterminado el valor establecido 	cuando Postgres fue compilado (normalmente 5342). Si se especifica un 	puerto distinto del predeterminado, a todas las aplicaciones cliente 	(incluyendo <application>psql</application>) deber&aacute; 
	especific&aacute;rseles el mismo 	puerto ya sea mediante las opciones de 	l&iacute;nea de comando o utilizando la variable de entorno 
	<envar>PGPORT</envar>.
       </para>
      </listitem>
     </varlistentry>
    </variablelist>
   </para>

   <para>
	Existen algunas opciones de l&iacute;nea de comandos disponibles para
	realizar depuraciones en caso de que un proceso en el servidor termine de 	forma anormal.
	Estas opciones controlan el comportamiento de 	<application>postmaster</application> en estas situaciones, y
	<emphasis>ninguna de ellas est&aacute; pensada para ser utilizada en  	situaciones normales</emphasis>.
   </para>

   <para>
	 La estrategia usual para esta situaci&oacute;n es notigicar a todos los 	 dem&aacute;s procesos en el servidor que deben terminar y reinicializar  	 la memoria y sem&aacute;foros compartidos. Esto es as&iacute; debido a 	 que un proceso de servidor que funcione de manera err&aacute;tica 	 	 	 podr&iacute;a corromper alguno de estos recursos compartidos antes de 	 terminar.
   </para>

   <para>
	 Estas opciones especiales son:

    <variablelist>
     <varlistentry>
      <term>-n</term>
      <listitem>
       <para>
	<application>postmaster</application>
	no reinicializar&aacute;a las estructuras compartidas. Un programador 	podr&iacute;a luego analizarlas con el programa 	<application>shmemdoc</application> y examinar la memoria compartida y lo 	estados de los sem&aacute;foros.
       </para>
     </listitem>
    </varlistentry>

    <varlistentry>
      <term>-s</term>
      <listitem>
       <para>
	<application>postmaster</application>
	detendr&aacute; todos los dem&aacute;s procesos del servidor 	envi&aacute;ndoles la señal <literal>SIGSTOP</literal>, pero no 	har&aacute; que terminene. Estos permite a los programadores del sistema
	realizar vuelcos de n&uacute;cleo a mano para todos los procesos del 	servidor.
       </para>
      </listitem>
     </varlistentry>
    </variablelist>
   </para>
  </refsect2>

  <refsect2 id="R2-APP-POSTMASTER-2">
   <refsect2info>
    <date>19-05-1999</date>
   </refsect2info>
   <title>
    Salidas
   </title>
   <para>

    <variablelist>
     <!--
     <varlistentry>
      <term>
       FindBackend: could not find a backend to execute...
      </term>
      <listitem>
       <para>
	Si usted ve este mensaje, el directorio que contiene al ejecutable de 	<application>postgres</application> no se encuentra en su path. Agregue 	el directorio en el que se encuentre <application>postgres</application>
	a su path.

       </para>
      </listitem>
     </varlistentry>
     -->
     <varlistentry>
      <term><computeroutput>
semget: No space left on device
       </computeroutput></term>
      <listitem>
       <para>
	Si aparece este mensaje, deber&iacute;a ejecutar el comando
	<application>ipcclean</application>. Una vez hecho esto, pruebe iniciar 
	<application>postmaster</application> nuevamente.
	Si aun no funciona, probablemente necesite configurar el n&uacute;cleo 	(kernel) de su sistema para que pueda utilizar memoria compartida y 	sem&aacute;foros, tal como se describe en las notas de 	instalaci&oacute;n.
	Si ejecuta m&uacute;ltiples instancias de 	<application>postmaster</application> 
	en un s&oacute;lo host, o tiene un kernel con muy poca memoria compartida 	o un l&iacute;mite de sem&aacute;foros muy pequeño, tal vez deba 	reconfigurarlo su kernel para incrementar sus par&aacute;metros de 	memoria comapartida y sem&aacute;foros.


	<tip>
	 <para>
		Tal vez pueda posponer la reconfiguraci&oacute;n del kernel 		disminuyendo lo especificado con -B para reducir la 		utilizaci&oacute;n de memoria compartida por parte de 
		<productname>Postgres</productname>, o disinuyendo lo especificado con 		-N para reducir la cantidad de sem&aacute;foros que utiliza 		<productname>Postgres</productname>.

	 </para>
	</tip>
       </para>
      </listitem>
     </varlistentry>

     <varlistentry>
      <term><computeroutput>
StreamServerPort: cannot bind to port
       </computeroutput></term>
      <listitem>
       <para>

	Si se encuentra con este mensaje, debe asegurarse de que no existen otros 	procesos de <application>postmaster</application> ejecut&aacute;ndose en 	el momento. La manera m&aacute;s f&aacute;cil de determinar esto es 	mediante el comando
	<programlisting>
% ps -ax | grep postmaster
	</programlisting>
	en sistemas basados en BSD, o 
	<programlisting>
% ps -e | grep postmast
	</programlisting>
	en sistemas tipo System V o compatibles con POSIX como ser HP-UX. 
       </para>

       <para>
	Si est&aacute; seguro de que no existen otros procesos de 
	<application>postmaster</application> en ejecuci&oacute;n, y aun 	as&iacute; sigue recibiendo este error, intente especificar un puerto 	diferente utilizando la opci&oacute;n <literal>-p</literal>. 
	Tambi&eacute;n puede obtener este mensaje de error si finaliza 
	<application>postmaster</application> y lo vuelve a iniciar 	inmediatamente utilizando el mismo n&uacute;mero de puerto; simplemente 	espere unos segundos hasta que el sistema operativo cierre el puerto 	antes de intentar nuevamente. 
	Finalmente, puede que obtenga este mensaje de error si especifica un 	n&uacute;mero de puerto que su sistema operativo considere reservado. Por 	ejemplo, muchas versiones de Unix consideran que los puertos con 	n&uacute;mero menor a 1024 deben ser confiables y solo permite al 	superusuario tner acceso a ellos. 
       </para>
      </listitem>
     </varlistentry>

     <varlistentry>
      <term><computeroutput>
IpcMemoryAttach: shmat() failed: Permission denied
       </computeroutput></term>
      <listitem>
       <para>
	Una explicaci&oacute;n plausible es que otro usuario intent&oacute; 	iniciar un proceso <application>postmaster</application> en el mismo 	puerto el cual ha adquirido recursos compartidos y luego ha finalizado. 	Dado que las claves de memoria compartidas de Postgres se basan en el 	n&uacute;mero de puerto asignado al proceso 	<application>postmaster</application>, estos conflictos tiene m&aacute;s
	probabilidad de ocurrir si existe m&aacute;s de una instalaci&oacute;n en 	un mismo servidor. 
	Si no hay otros procesos <application>postmaster</application> en 	ejecuci&oacute;n (vea m&aacute;s arriba), ejecute 
	<application>ipcclean</application> e intente nuevamente. Si existen 	otros <application>postmaster</application> ejecut&aacute;ndose, 	deber&aacute; contactar a los propietarios de estos procesos para 	coordinar la asignaci&oacute;n de puertos y/o la remoci&oacute;n de los 	segmentos de memoria compartida no utilizados.
       </para>
      </listitem>
     </varlistentry>
    </variablelist>
   </para>
  </refsect2>
 </refsynopsisdiv>

 <refsect1 id="R1-APP-POSTMASTER-1">
  <refsect1info>
   <date>19-05-1999</date>
  </refsect1info>
  <title>
   Description
  </title>

  <para>
   <application>postmaster</application>
	administra la comunicaci&oacute;n entre los procesos del cliente y del 	servidor, as&iacute; como la asignaci&oacute;n de buffers compartidos y 
	sem&aacute;foros SysV (en m&aacute;quinas que no tengan intstrucciones
	del tipo test-and-set). 
   <application>postmaster</application>
	no interact&uacute;a directamente con el usuario y debe ser iniciado como 	un proceso en segundo plano.
  </para>

  <para>
   <emphasis>S&oacute;lo un postmaster debe estar ejecut&aacute;ndose a la 	vez para una instalaci&oacute;n 
    <productname>Postgres</productname> dada.</emphasis>
	Aqu&iacute; una instalaci&oacute;n significa un directorio de base de 	datos y un n&uacute;mero de puerto de 	<application>postmaster</application>
   Se puede ejecutar m&aacute;s de un postmaster en una misma m&aacute;quina 	si cada uno de ellos tiene un directorio y un n&uacute;mero de puerto 	diferente.
  </para>
 </refsect1>

 <refsect1 id="R1-APP-POSTMASTER-2">
  <refsect1info>
   <date>04-10-1998</date>
  </refsect1info>
  <title>
   Notes
  </title>
  
  <para>
	Siempre que se posible 
   <emphasis>evite</emphasis>
   utilizar <literal>SIGKILL</literal>
   para forzar la finalizaci&oacute; de  	<application>postmaster</application>.
   En su lugar deber&iacute;a utilizarse
	<literal>SIGHUP</literal>,
   <literal>SIGINT</literal>,
   o
   <literal>SIGTERM</literal>
   (la señal predeterminada para
   <application>kill</application>(1))". 
	La utilizaci&oacute;n

   <programlisting>
% kill -KILL
   </programlisting>

o su forma alternativa

   <programlisting>
% kill -9
   </programlisting>

	impedir&aacute; que <application>postmaster</application> pueda liberar
	los recursos del sistema (memoria compartida y sem&aacute;foros) que 	pose&iacute;a antes de finalizar. 
	En cambio, si <application>postmaster</application> logra liberar los 	recursos en su poder, le evitar&aacute; a usted tener que lidiar con los 	problemas de memoria compartida que se describieron anteriormente.
  </para>

  <para>
	Existen varias utilidades para resolver problemas de memoria compartida,
	entre las cuales se encuentran
   <application>ipcs(1)</application>,
   <application>ipcrm(1</application>), y
   <application>ipcclean(1)</application>.
  </para>
 </refsect1>
 
 <refsect1 id="R1-APP-POSTMASTER-3">
  <refsect1info>
   <date>04-10-1998</date>
  </refsect1info>
  <title>
   Utilizaci&oacute;n
  </title>
  <para>
	Para iniciar <application>postmaster</application> utilizando los valors 	predeterminados, escriba:

   <programlisting>
% nohup postmaster >logfile 2>&1 &
   </programlisting>

	Este comando iniciar&aacute; <application>postmaster</application> en el 	puerto predeterminado (5432). Esta es la manera m&aacute;s simple, y la 	m&aacute;s com&uacute;n, de iniciar 	<application>postmaster</application>.
  </para>

  <para>
	Para iniciar <application>postmaster</application> con un n&uacute;mero 	de puerto espec&iacute;fico y un nombre de ejecutable:

   <programlisting>
% nohup postmaster -p 1234 &
   </programlisting>

	Este comando ejecutar&aacute; <application>postmaster</application> 
	comunic&aacute;ndose a trav&eacute;s del puerto 1234. Para poder 	conectarse a este <application>postmaster</application> utilizando psql, 	necesitar&aacute; ejecutarlo del siguiente modo

   <programlisting>
% psql -p 1234
   </programlisting>

	o fijar la variable de entorno <envar>PGPORT</envar>:

   <programlisting>
% setenv PGPORT 1234
% psql
   </programlisting>
  </para>
 </refsect1>
</refentry>

<!-- Keep this comment at the end of the file
Local variables:
mode: sgml
sgml-omittag:nil
sgml-shorttag:t
sgml-minimize-attributes:nil
sgml-always-quote-attributes:t
sgml-indent-step:1
sgml-indent-data:t
sgml-parent-document:nil
sgml-default-dtd-file:"../reference.ced"
sgml-exposed-tags:nil
sgml-local-catalogs:"/usr/lib/sgml/catalog"
sgml-local-ecat-files:nil
End:
-->
