<HTML>
<HEAD>
<TITLE>PostgreSQL FAQ</TITLE>
</HEAD>
<BODY TEXT="#000000" LINK="#ff0000" VLINK="#800000" BGCOLOR="#ffffff" aLink=#0000ff>

<P><!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN"><!-- saved from url=(0047)http://www.postgresql.org/docs/faq-english.html --></P>
<H1>Preguntas de Uso Frecuente (FAQ) sobre PostgreSQL</H1>
<P>&Uacute;ltima actualizaci&oacute;n: Tue Mar 21 16:09:11 EST 2000</P>
<P>Encargado Actual de su mantenimiento: Bruce Momjian (<A HREF="mailto:pgman@candle.pha.pa.us">pgman@candle.pha.pa.us</A>)</P>
<P>La versi&oacute;n m&aacute;s reciente de este documento puede visualizarse en el sitio web de postgreSQL, <A HREF="http://www.postgresql.org/">http://www.postgresql.org/</A>. </P>
<P>La versi&oacute;n m&aacute;s reciente de este documento en Español puede visualizarse en el sitio web del Proyrcto de traduci&oacute;n de la documentaci&oacute;n de postgreSQL, <A HREF="http://users.servicios.retecal.es/rsantos/index.htm">http://users.servicios.retecal.es/rsantos/index.htm</A> o en su replica <A HREF="http://lucas.hispalinux.es/Postgresql-es/rsantos/">http://lucas.hispalinux.es/Postgresql-es/rsantos/</A> </P>
<P>Las preguntas espec&iacute;ficas sobre Linux son contestadas en <A HREF="http://www.postgresql.org/docs/faq-linux.html">http://www.PostgreSQL.org/docs/faq-linux.html</A>. </P>
<P>Las preguntas espec&iacute;ficas sobre Irix son contestadas en <A HREF="http://www.postgresql.org/docs/faq-irix.html">http://www.PostgreSQL.org/docs/faq-irix.html</A>. </P>
<P>Las preguntas espec&iacute;ficas sobre HPUX son contestadas en <A HREF="http://www.postgresql.org/docs/faq-hpux.shtml">http://www.PostgreSQL.org/docs/faq-hpux.shtml</A>. </P>
<P><HR></P>
<H2 ALIGN="CENTER">Preguntas Generales</H2>
<P><A HREF="#BM1_1">1.1</A>) ¿Qu&eacute; es PostgreSQL?<BR>
<A HREF="#BM1_2">1.2</A>) ¿Cu&aacute;l es el Copyright de PostgreSQL?<BR>
<A HREF="#BM1_3">1.3</A>) ¿En qu&eacute; plataformas Unix corre PostgreSQL?<BR>
<A HREF="#BM1_4">1.4</A>) ¿Qu&eacute; adaptaciones no unix est&aacute;n disponibles?<BR>
<A HREF="#BM1_5">1.5</A>) ¿D&oacute;nde puedo conseguir PostgreSQL?<BR>
<A HREF="#BM1_6">1.6</A>) ¿D&oacute;nde puedo conseguir asistencia para PostgreSQL?<BR>
<A HREF="#BM1_7">1.7</A>) ¿Cu&aacute;l es la &uacute;ltima versi&oacute;n de PostgreSQL?<BR>
<A HREF="#BM1_8">1.8</A>) ¿Qu&eacute; documentaci&oacute;n existe sobre PostgreSQL?<BR>
<A HREF="#BM1_9">1.9</A>) ¿C&oacute;mo me informo de nuevos errores o caracter&iacute;sticas faltantes?<BR>
<A HREF="#BM1_10">1.10</A>) ¿C&oacute;mo puedo aprender SQL?<BR>
<A HREF="#BM1_11">1.11</A>) ¿Est&aacute; PostgreSQL certificado Y2K?<BR>
<A HREF="#BM1_12">1.12</A>) ¿C&oacute;mo puedo unirme al equipo de desarrollo?<BR>
<A HREF="#BM1_13">1.13</A>) ¿C&oacute;mo env&iacute;o informes sobre fallos de funcionamiento?<BR>
<A HREF="#BM1_14">1.14</A>) ¿C&oacute;mo puede compararse PostgreSQL a otros DBMS's?</P>
<H2 ALIGN="CENTER">Preguntas del usuario del Cliente</H2>
<P><A HREF="#BM2_1">2.1</A>) ¿Existen controladores ODBC para PostgreSQL? <BR>
<A HREF="#BM2_2">2.2</A>) ¿Que herramientas hay disponibles para conectar PostgreSQL con p&aacute;ginas Web? <BR>
<A HREF="#BM2_3">2.3</A>) ¿Tiene PostgreSQL una interfase gr&aacute;fica? ¿Y generador de informes? ¿E interfase para lenguajes de consulta empotrados? <BR>
<A HREF="#BM2_4">2.4)</A> ¿Que lenguajes hay disponibles para comunicar con PostgreSQL?</P>
<H2 ALIGN="CENTER">Cuestiones de Administraci&oacute;n</H2>
<P><A HREF="#3_1">3.1</A>) ¿Por qu&eacute; initdb falla?<BR>
<A HREF="#BM3_2">3.2</A>) ¿C&oacute;mo puedo instalar PostgreSQL en alg&uacute;n sitio distinto de /usr/local/pgsql?<BR>
<A HREF="#BM3_3">3.3</A>) Cu&aacute;ndo inicio el postmaster, Obtengo un <I>Llamada err&oacute;nea del sistema o un mensaje core dumped</I> . ¿Por qu&eacute;?<BR>
<A HREF="#BM3_4">3.4</A>) Cu&aacute;ndo intento iniciar postmaster, Obtengo un error <I>IpcMemoryCreate</I> errors3. ¿Por qu&eacute;? <BR>
<A HREF="#BM3_5">3.5</A>) Cu&aacute;ndo intento iniciar postmaster, Obtengo un error <I>IpcSemaphoreCreate</I>. ¿Por qu&eacute;?<BR>
<A HREF="#BM3_6">3.6</A>) ¿C&oacute;mo me prevengo del acceso de otros hosts a mi base de datos PostgreSQL?<BR>
<A HREF="#BM3_7">3.7</A>) ¿Por qu&eacute; no puedo conectarme a mi base de datos desde otra m&aacute;quina?<BR>
<A HREF="#BM3_8">3.8</A>) ¿Por qu&eacute; no puedo acceder a la base de datos como usuario root?<BR>
<A HREF="#BM3_9">3.9</A>) Todos mis servidores fallan bajo el acceso concurrente a tablas ¿Por qu&eacute;?<BR>
<A HREF="#BM3_10">3.10</A>) ¿C&oacute;mo afino el motor de base de datos para mejorar el rendimiento?<BR>
<A HREF="#BM3_11">3.11</A>) ¿Qu&eacute; caracter&iacute;sticas de depuraci&oacute;n est&aacute;n disponibles en PostgreSQL?<BR>
<A HREF="#BM3_12">3.12</A>) Obtengo 'Sorry, too many clients' cuando intento conectarme. ¿Por qu&eacute;?<BR>
<A HREF="#BM3_13">3.13</A>) ¿Qu&eacute; son los ficheros pg_psort.XXX en mi directorio de base de datos?<BR>
<A HREF="#BM3_14">3.14</A>) ¿C&oacute;mo configuro el pg_group?</P>
<P>&nbsp;</P>
<H2 ALIGN="CENTER">Preguntas acerca del funcionamiento</H2>
<P><A HREF="#BM4_1">4.1</A>) El sistema parece confundirse con las comas, puntos decimales y los formatos de fechas.<BR>
<A HREF="#BM4_2">4.2</A>) ¿Cu&aacute;l es la diferencia exacta entre cursores binarios y cursores normales?<BR>
<A HREF="#BM4_3">4.3</A>) ¿C&oacute;mo <I>seleccionar</I> solamente las primeras filas de una consulta?<BR>
<A HREF="#BM4_4">4.4</A>) ¿C&oacute;mo obtener una lista de tablas u otras cosas que pueda ver con <I>psql?</I><BR>
<A HREF="#BM4_5">4.5</A>) ¿C&oacute;mo borrar una columna de una tabla?<BR>
<A HREF="#BM4_6">4.6</A>) ¿Cu&aacute;l es el tama&ntilde;o m&aacute;ximo de una fila, tabla o base de datos?<BR>
<A HREF="#BM4_7">4.7</A>) ¿Cu&aacute;nto espacio de disco requiere una base de datos para almacenar un fichero normal y corriente?<BR>
<A HREF="#BM4_8">4.8</A>) ¿C&oacute;mo saber qu&eacute; &iacute;ndices u operaciones est&aacute;n definidos en la base de datos?<BR>
<A HREF="#BM4_9">4.9</A>) Mis consultas van despacio o no hacen uso de &iacute;ndices. ¿Porqu&eacute;?<BR>
<A HREF="#BM4_10">4.10</A>) ¿C&oacute;mo ver de qu&eacute; manera el optimizador de consultas est&aacute; evaluando mi consulta?<BR>
<A HREF="#BM4_11">4.11</A>) ¿Qu&eacute; es un &iacute;ndice R-tree?<BR>
<A HREF="#BM4_12">4.12</A>) ¿Qu&eacute; es una optimizaci&oacute;n gen&eacute;rica de una consulta?<BR>
<A HREF="#BM4_13">4.13</A>) ¿C&oacute;mo hacer b&uacute;squedas de expresiones regulares y b&uacute;squedas de expresiones regulares sensibles al contexto?<BR>
<A HREF="#BM4_14">4.14</A>) En una consulta, ¿c&oacute;mo detectar si un campo es NULL (nulo)?<BR>
<A HREF="#BM4_15">4.15</A>) ¿Cu&aacute;l es la diferencia entre los diferentes tipos de caracteres?<BR>
<A HREF="#BM4_16_1">4.16.1</A>) ¿C&oacute;mo crear un campo serie/autoincremento?<BR>
<A HREF="#BM4_16_2">4.16.2</A>) ¿C&oacute;mo obtener el valor de una inserci&oacute;n serie (serial insert)?<BR>
<A HREF="#BM4_16_3">4.16.3</A>) ¿No provoca el uso de currval() y nextval() una condici&oacute;n de competencia con otros procesos concurrentes del backend?<BR>
<A HREF="#BM4_17">4.17</A>) ¿Qu&eacute; es un oid? ¿Qu&eacute; es un tid?<BR>
<A HREF="#BM4_18">4.18</A>) ¿Cu&aacute;l es el significado de algunos t&eacute;rminos usados en PostgreSQL?<BR>
<A HREF="#BM4_19">4.19</A>) ¿Porqu&eacute; me da este error "FATAL: palloc failure: memory exhausted?"<BR>
<A HREF="#BM4_20">4.20</A>) ¿C&oacute;mo saber qu&eacute; versi&oacute;n de PostgreSQL estoy usando? <BR>
<A HREF="#BM4_21">4.21</A>) Las operaciones con objetos grandes me dan el mensaje <I>invalid large obj descriptor.</I> ¿Porqu&eacute;?<BR>
<A HREF="#BM4_22">4.22</A>) ¿C&oacute;mo creo una columna que tome por defecto la hora actual?<BR>
<A HREF="#BM4_23">4.23</A>) ¿Porqu&eacute; son tan lentas mis sub-consultas cuando uso <CODE>IN</CODE>?</P>
<H2 ALIGN="CENTER">Extendiendo PostgreSQL</H2>
<P><A HREF="#BM5_1">5.1</A>) He escrito una funci&oacute;n de usuario. Cuando la ejecuto con <I>psql,</I> ¿por qu&eacute; provoca un volcado del n&uacute;cleo (dumps core)? <BR>
<A HREF="#BM5_2">5.2</A>) ¿Que significa el mensaje: <I>NOTICE:PortalHeapMemoryFree: 0x402251d0 not in alloc set!</I> ? <BR>
<A HREF="#BM5_3">5.3</A>) ¿Como puede contribuir aportando algunos nuevos tipos y funciones a PostgreSQL? <BR>
<A HREF="#BM5_4">5.4</A>) ¿C&oacute;mo puede escribir una funci&oacute;n en C que devuelva un par de valores? <BR>
<A HREF="#BM5_5">5.5</A>) He cambiado un fichero fuente. ¿Por qu&eacute; si recompilo no se observa el cambio??</P>
<P><HR></P>
<H2 ALIGN="CENTER">Preguntas Generales</H2>
<H4><A NAME="BM1_1">1.1</A>) ¿Qu&eacute; es PostgreSQL?</H4>
<P>PostgreSQL es una mejora del sistema gestor de bases de datos POSTGRES, un prototipo de investigaci&oacute;n de DBMS de nueva generaci&oacute;n. Mientras PostgreSQL mantiene los potentes modelos de datos y riqueza de tipos de POSTGRES, reemplaza el lenguaje de consulta PostQuel con un subjuego extendido de SQL. PostgreSQL es gratis y las fuentes son accesibles p&uacute;blicamente. </P>
<P>El desarrollo de PostgreSQL est&aacute; siendo realizado por un equipo de desarrolladores de Internet suscritos a la lista de correo de PostgreSQL. El coordinador actual es Marc G. Fournier (<A HREF="mailto:scrappy@postgreSQL.org">scrappy@postgreSQL.org</A>). (V&eacute;ase abajo para unirse al grupo). Este equipo es el actual responsable de todo el desarrollo actual y futuro de PostgreSQL. </P>
<P>Los autores de PostgreSQL 1.01 fueron Andrew Yu y Jolly Chen. Muchos otros han contribuido a la adaptaci&oacute;n a otras plataformas, pruebas, depuraci&oacute;n y mejoras del c&oacute;digo. El c&oacute;digo original de Postgres, del cual deriva PostgreSQL, fue el esfuerzo de muchos estudiantes graduados, estudiantes no graduados y programadores de base trabajando bajo la direcci&oacute;n del profesor Michael Stonebraker en la Universidad de Berkeley (California). </P>
<P>El nombre original del software en Berkeley fue Postgres. Cuando se le a&ntilde;adi&oacute; la funcionalidad SQL en 1995, su nombre se cambi&oacute; a Postgres95. El nombre volvi&oacute; a ser cambiado a finales de 1996 a PostgreSQL. </P>
<P>Se pronuncia <I>Post-Gres-Q-L.</I> </P>
<H4><A NAME="BM1_2">1.2</A>) ¿Cu&aacute;l es el Copyright de PostgreSQL?</H4>
<P>PostgreSQL est&aacute; sujeto al siguiente COPYRIGHT. </P>
<P>Sistema Gestor de Bases de Datos PostgreSQL</P>
<P>Porciones copyright (c) 1996-2000, PostgreSQL, Inc Porciones Copyright (c) 1994-6 Regentes de la Universidad de California </P>
<P>Se permite el uso, copia, modificaci&oacute;n, y distribuci&oacute;n de este software y su documentaci&oacute;n para cualquier prop&oacute;sito, sin pago ni acuerdo previo escrito, a condici&oacute;n de que el anterior aviso de copyright, este p&aacute;rrafo y los dos siguientes aparezcan en todas las copias. </P>
<P>EN NINGUN CASO LA UNIVERSIDAD DE CALIFORNIA SE RESPONSABILIZARA DE DA&Ntilde;OS DIRECTOS, INDIRECTOS, ACCIDENTALES O CONSECUENCIALES, INCLUYENDO PERDIDA DE BENEFICIOS, DERIVADOS DEL USO DE ESTE SOFTWARE Y SU DOCUMENTACION, INCLUSO SI LA UNIVERSIDAD DE CALIFORNIA HA SIDO AVISADA DE LA POSIBILIDAD DE TALES DA&Ntilde;OS. </P>
<P>LA UNIVERSIDAD DE CALIFORNIA ESPECIFICAMENTE RENUNCIA A LA CONCESI&Oacute;N DE CUALQUIER GARANTIA, INCLUYENDO PERO NO LIMITANDOSE A LAS GARANTIAS IMPLICITAS DE COMERCIALIDAD Y AJUSTE PARA UN PROPOSITO PARTICULAR. EL SOFTWARE ES SUMINISTRADO "TAL CUAL", Y LA UNIVERSIDAD DE CALIFORNIA NO ESTA OBLIGADA A SUMINISTRAR MANTENIMIENTO, SOPORTE, ACTUALIZACIONES, MEJORAS O MODIFICACIONES SOBRE EL MISMO.</P>
<H4><A NAME="BM1_3">1.3</A>) ¿En qu&eacute; plataformas Unix corre PostgreSQL?</H4>
<P>Los autores han compilado y probado PostgreSQL en las siguientes plataformas (algunas de estas compilaciones requieren gcc): </P>

<UL>
<LI>aix - AIX 3.2.5 o 4.x en IBM </LI>
<LI>alpha - Digital Unix 2.0, 3.2, 4.0 en DEC Alpha AXP </LI>
<LI>BSD44_derived - Sistemas Operativos derivados del BSD 4.4-lite (NetBSD, FreeBSD) </LI>
<LI>bsdi - BSD/OS 2.x, 3.x, 4.x </LI>
<LI>dgux - DG/UX 5.4R4.11 </LI>
<LI>hpux - HP-UX 9.*, 10.* en HP PA-RISC </LI>
<LI>i386_solaris - Solaris i386 Solaris </LI>
<LI>irix5 - IRIX 5.3 en SGI MIPS </LI>
<LI>linux - Alpha SPARC PPC M68k en Intel i86 </LI>
<LI>sco - SCO 3.2v5 Unixware </LI>
<LI>sparc_solaris - Solaris 2.4, 2.5, 2.5.1 en SUN SPARC </LI>
<LI>sunos4 - SunOS 4.1.3 en SUN SPARC </LI>
<LI>svr4 - Intel SVR4 and MIPS en Intel x86 </LI>
<LI>ultrix4 - Ultrix 4.4 en DEC MIPS</LI></UL>

<H4><A NAME="BM1_4">1.4</A>) ¿Qu&eacute; adaptaciones no unix est&aacute;n disponibles?</H4>
<P>Es posible compilar las librer&iacute;as libpq, psql y otros interfaces y binarios para su ejecuci&oacute;n en MS Windows. En este caso, el cliente se ejecuta en MS Windows, y se comunica a trav&eacute;s de TCP/IP con un servidor que est&aacute; funcionando en una de las plataformas Unix soportadas. </P>
<P>El fichero <I>win31.mak</I> se incluye en la distribuci&oacute;n para la compilaci&oacute;n de las librer&iacute;as libpq y psql en Win32. </P>
<P>El servidor de bases de datos funciona actualmente en Windows NT usando la librer&iacute;a de adaptaci&oacute;n Cygnus Unix/NT. V&eacute;ase pgsql/doc/README.NT en la distribuci&oacute;n. </P>
<P>Tambi&eacute;n existe una p&aacute;gina web en <A HREF="http://www.freebsd.org/~kevlo/postgres/portNT.html">http://www.freebsd.org/~kevlo/postgres/portNT.html</A> Existe tambi&eacute;n otra adaptaci&oacute;n usando U/Win en <A HREF="http://surya.wipro.com/uwin/ported.html">http://surya.wipro.com/uwin/ported.html</A> </P>
<H4><A NAME="BM1_5">1.5</A>) ¿D&oacute;nde puedo conseguir PostgreSQL?</H4>
<P>El sitio ftp primario an&oacute;nimo para PostgreSQL es <A HREF="ftp://ftp.postgresql.org/pub">ftp://ftp.postgreSQL.org/pub</A> </P>
<P>Para sitios espejo, v&eacute;ase el sitio web principal. </P>
<H4><A NAME="BM1_6">1.6</A>) ¿D&oacute;nde puedo conseguir asistencia sobre PostgreSQL?</H4>
<P>No hay asistencia oficial para PostgreSQL desde la Universidad de Berkeley, California. Se mantiene a trav&eacute;s del esfuerzo de voluntarios. </P>
<P>La lista de correo principal es: <A HREF="mailto:pgsql-general@postgreSQL.org">pgsql-general@postgreSQL.org</A>. Est&aacute; disponible para la discusi&oacute;n de asuntos referentes a PostgreSQL. Para suscribirse, env&iacute;e un e-mail con las siguientes l&iacute;neas en el cuerpo (no en el sujeto) </P>
<PRE>&#9;subscribe
&#9;end</PRE>
<P>to <A HREF="mailto:pgsql-general-request@postgreSQL.org">pgsql-general-request@postgreSQL.org</A>. </P>
<P>Asimismo existe una lista de compendios de mensajes. Para suscribirse a ella, env&iacute;e un e-mail a: <A HREF="mailto:pgsql-general-digest-request@postgreSQL.org">pgsql-general-digest-request@postgreSQL.org</A> con las siguientes l&iacute;neas en el cuerpo del mensaje: </P>
<PRE>&#9;subscribe
&#9;end</PRE>
<P>Los compendios se env&iacute;an a los miembros de esta lista en el momento que la lista principal ha recibido 30k de mensajes aproximadamente. </P>
<P>La lista de correo de errores tambi&eacute;n est&aacute; disponible. Para suscibirse, env&iacute;e un e-mail a <A HREF="mailto:bugs-request@postgreSQL.org">bugs-request@postgreSQL.org</A> con las siguientes l&iacute;neas en el cuerpo del mensaje: </P>
<PRE>&#9;subscribe
&#9;end</PRE>
<P>Tambi&eacute;n est&aacute; disponible una lista de correo para discusi&oacute;n de desarrolladores. Para suscibirse, env&iacute;e un e-mail a <A HREF="mailto:hackers-request@postgreSQL.org">hackers-request@postgreSQL.org</A> con las siguientes l&iacute;neas en el cuerpo del mensaje: </P>
<PRE>&#9;subscribe
&#9;end</PRE>
<P>Listas de correo adicionales e informaci&oacute;n acerca de PostgreSQL puede ser encontrada en la p&aacute;gina web principal de PostgreSQL en: </P>
<BLOCKQUOTE><A HREF="http://postgresql.org/">http://postgresql.org/</A> </BLOCKQUOTE>
<P>Tambi&eacute;n existe un canal IRC en EFNet, el canal #PostgreSQL. Yo uso el comando unix <CODE>irc -c '#PostgreSQL' "$USER" irc.phoenix.net</CODE> </P>
<P>Existe asistencia comercial disponible para PostgreSQL en <A HREF="http://www.pgsql.com/">http://www.pgsql.com/</A> </P>
<H4><A NAME="BM1_7">1.7</A>) ¿Cu&aacute;l es la &uacute;ltima versi&oacute;n de PostgreSQL?</H4>
<P>La &uacute;ltima versi&oacute;n de PostgreSQL es la 7.0. </P>
<P>Planeamos tener versiones de orden mayor cada cuatro meses. </P>
<H4><A NAME="BM1_8">1.8</A>) ¿Qu&eacute; documentaci&oacute;n existe sobre PostgreSQL?</H4>
<P>Varios manuales, p&aacute;ginas man, y algunos peque&ntilde;os ejemplos de texto se incluyen en la distribuci&oacute;n. V&eacute;ase el directorio /doc. Tambi&eacute;n se puede consultar el manual on-line en <A HREF="http://www.postgresql.org/docs/postgres">http://www.postgresql.org/docs/postgres</A> en la distribuci&oacute;n. </P>
<I><P>psql</I> tiene algunos comandos \d para mostrar informaci&oacute;n acerca de tipos, operadores, funciones, agregados, etc. </P>
<P>El sitio web contiene a&uacute;n m&aacute;s documentaci&oacute;n. </P>
<H4><A NAME="BM1_9">1.9</A>) ¿C&oacute;mo me informo de nuevos errores o caracter&iacute;sticas faltantes? </H4>
<P>PostgreSQL soporta un subjuego extendido de SQL-92. V&eacute;ase nuestro <A HREF="http://www.postgresql.org/docs/todo.html">TODO</A> para una lista de errores conocidos, caracter&iacute;sticas faltantes y planes futuros. </P>
<H4><A NAME="BM1_10">1.10</A>) ¿C&oacute;mo puedo aprender SQL?</H4>
<P>Existe un bonito tutorial en <A HREF="http://w3.one.net/~jhoffman/sqltut.htm">http://w3.one.net/~jhoffman/sqltut.htm</A> y en <A HREF="http://ourworld.compuserve.com/homepages/graeme_birchall/HTM_COOK.HTM">http://ourworld.compuserve.com/homepages/graeme_birchall/HTM_COOK.HTM</A> </P>
<P>Otro es "Teach Yourself SQL in 21 Days, Second Edition" en <A HREF="http://members.tripod.com/er4ebus/sql/index.htm">http://members.tripod.com/er4ebus/sql/index.htm</A> </P>
<P>Muchos de nuestros usuarios prefieren <I>The Practical SQL Handbook</I>, Bowman et al., Addison Wesley. Otros, <I>Lan Times Guide to SQL</I>, Groff et al., Osborne McGraw-Hill. </P>
<H4><A NAME="BM1_11">1.11</A>) ¿Est&aacute; PostgreSQL certificado Y2K?</H4>
<P>Si, manejamos con fiabilidad fechas anteriores y posteriores al a&ntilde;o 2000. </P>
<H4><A NAME="BM1_12">1.12</A>) ¿C&oacute;mo puedo unirme al equipo de desarrollo?</H4>
<P>Primero, descargue los &uacute;ltimos fuentes y lea la documentaci&oacute;n para desarrolladores de PostgreSQL Developers en nuestro sitio web, o en la distribuci&oacute;n. Segundo, suscr&iacute;base a las listas de correo pgsql-hackers y pgsql-patches. Tercero, env&iacute;e patches de alta calidad a apgsql-patches. </P>
<P>Existe sobre una docena de personas que tienen privilegios <SMALL>COMMIT</SMALL> en el archivo PostgreSQL CVS. Todos ellos enviaron muchos patches de alta calidad que supusieron quebraderos de cabeza a la hora de ser continuados por los compromisarios existentes, y no dudamos sobre la calidad de los patches que enviaron. </P>
<H4><A NAME="BM1_13">1.13</A>) ¿C&oacute;mo env&iacute;o informes sobre fallos de funcionamiento?</H4>
<P>Rellene el fichero "bug-template" y env&iacute;elo a: <A HREF="mailto:bugs@postgreSQL.org">bugs@postgreSQL.org</A> </P>
<P>Tambi&eacute;n compruebe nuestro sitio ftp <A HREF="ftp://ftp.postgresql.org/pub">ftp://ftp.postgreSQL.org/pub</A> para ver si hay una versi&oacute;n m&aacute;s reciente de PostgreSQL o patches. </P>
<H4><A NAME="BM1_14">1.14</A>) ¿C&oacute;mo comparar PostgreSQL a otros DBMS's?</H4>
<P>Existen varias formas de comparar el software: caracter&iacute;sticas, rendimiento, fiabilidad, asistencia y precio. </P>
<B><DL>
<DT>Caracter&iacute;sticas</B> </DT>
<DD>PostgreSQL tiene muchas caracter&iacute;sticas presentes en grandes DBMS's comerciales, como transacciones, subselecciones, disparadores, vistas y bloqueos sofisticados. Tenemos algunas caracter&iacute;sticas que ellos no tienen, como tipos definidos por el usuario, herencia, reglas y control de concurrencia multi versi&oacute;n para reducir la contenci&oacute;n de bloqueo. No tenemos integridad referencial de claves externas o enlaces externos, pero estamos trabajando en ello para la pr&oacute;xima versi&oacute;n.</DD>
<B><DT>Rendimiento</B> </DT>
<DD>PostgreSQL se ejecuta en dos modos. El modo normal <I>fsync</I> vuelca cada transacci&oacute;n completada en el disco, garantizando que si el Sistema Operativo se bloquea o se produce una p&eacute;rdida de energ&iacute;a en los siguientes segundos, todos sus datos est&aacute;n almacenados y sin da&ntilde;os en el disco. En este modo, somos m&aacute;s lentos que muchas bases de datos comerciales, principalmente porque algunas de ellas realizan volcados a disco de tipo conservador en sus modos por defecto. En el modo <I>no-fsync</I>, somos generalmente m&aacute;s r&aacute;pidos que las bases de datos comerciales, aunque en este modo un fallo del Sistema Operativo podr&iacute;a corromper los datos. Estamos trabajando en una soluci&oacute;n intermedia que que provoque menos sobrecargas en el rendimiento que el modo full fsync, y permitir&aacute; la integridad de los datos dentro de los 30 segundos anteriores a un fallo del Sistema Operativo. El modo es seleccionable por el administrador de la base de datos.<BR>
<BR>
En comparaci&oacute;n con MySQL sistemas de bases de datos m&aacute;s d&eacute;biles, somos m&aacute;s lentos en inserciones/actualizaciones porque tenemos cabeceras de transacci&oacute;n. Desde luego, MySQL no tiene ninguna de las caracter&iacute;sticas mencionadas en la anterior secci&oacute;n <I>Caracter&iacute;sticas</I>. Nos hemos basado en la flexibilidad y en las caracter&iacute;sticas, aunque si bien continuamos trabajando en la mejora del rendimiento a trav&eacute;s de un perfilamiento y an&aacute;lisis del c&oacute;digo fuente. Existe una p&aacute;gina web interesante que presenta la comparaci&oacute;n entre PostgreSQL y MySQL en <A HREF="http://openacs.org/why-not-mysql.html">http://openacs.org/why-not-mysql.html</A><BR>
<BR>
Manejamos cada conexi&oacute;n de usuario mediante la creaci&oacute;n de un proceso Unix. Los procesos de fondo comparten buffers de datos e informaci&oacute;n de bloqueo. Con m&uacute;ltiples CPU's, m&uacute;ltiples procesos de fondo pueden correr f&aacute;cilmente en diferentes CPU's.</DD>
<B><DT>Fiabilidad</B> </DT>
<DD>Tenemos claro que una DBMS debe ser fiable, o de otro modo es una p&eacute;rdida de tiempo. Nos esforzamos en generar c&oacute;digo estable y bien probado que tenga un m&iacute;nimo de errores. Cada release tiene al menos un mes de beta testing, y nuestro hist&oacute;rico de releases muestra que podemos suministrar versiones s&oacute;lidas y estables que est&aacute;n listas para uso productivo. Creemos que en este aspecto podemos compararnos favorablemente a otros softwares de bases de datos.</DD>
<B><DT>Asistencia</B> </DT>
<DD>Nuestra lista de correo ofrece ayuda a un amplio grupo de desarrolladores y usuarios para resolver cualquier problema que encuentren. A&uacute;n cuando no podemos garantizar una reparaci&oacute;n, las DBMS´s comerciales tampoco. El acceso directo a los desarrolladores, la comunidad de usuarios, manuales, y el c&oacute;digo fuente hacen a veces que la asistencia de PostgreSQL sea superior a otros DBMS's. Existe asistencia espec&iacute;fica "por incidente" para quien la necesite. (V&eacute;ase item FAQ asistencia.)</DD>
<B><DT>Precio</B> </DT>
<DD>Somos gratuitos para cualquier uso, tanto comercial como no comercial. Puede a&ntilde;adir nuestro c&oacute;digo a su producto sin limitaciones, excepto aquellas indicadas en nuestra licencia BSD citada anteriormente.</DD>
<DD>&nbsp;</DD>
</DL>
<P><HR></P>
<H2 ALIGN="CENTER">Preguntas del usuario del Cliente</H2>
<H4><A NAME="BM2_1"></A>2.1) ¿Existen controladores ODBC para PostgreSQL?</H4>
<P>Hay dos controladores ODBC disponibles, PostODBC y OpenLink ODBC. </P>
<P>PostODBC se incluye con la distribuci&oacute;n. Puede encontrarse m&aacute;s informaci&oacute;n en: <A HREF="http://www.insightdist.com/psqlodbc">http://www.insightdist.com/psqlodbc</A> </P>
<P>OpenLink ODBC puede encontrarse en <A HREF="http://www.openlinksw.com/">http://www.openlinksw.com/</A>. Funciona con los programas clientes ODBC, por lo que puede tener disponible un driver ODBC para PostgreSQL ODBC para cualquier plataforma cliente&nbsp; (Win, Mac, Unix, VMS). </P>
<P>Este producto esta probablemente a la venta para quien necesite soporte profesional de calidad, pero puede encontrarse una versi&oacute;n freeware. Consultar <A HREF="mailto:postgres95@openlink.co.uk">postgres95@openlink.co.uk</A>. </P>
<H4><A NAME="BM2_2"></A>2.2) ¿Que herramientas hay disponibles para conectar PostgreSQL con p&aacute;ginas Web?</H4>
<P>Puede encontrarse una buena introducci&oacute;n a las p&aacute;ginas Web con dorsal de base de datos en: <A HREF="http://www.webtools.com/">http://www.webtools.com/</A> </P>
<P>Hay otra en: <A HREF="http://www.phone.net/home/mwm/hotlist/">http://www.phone.net/home/mwm/hotlist/</A> </P>
<P>para integraci&oacute;n con Web, PHP es una excelente interfase. Est&aacute; en: <A HREF="http://www.php.net/">http://www.php.net/</A> </P>
<P>PHP es fant&aacute;stico para cosas simples, pero para casos m&aacute;s complejos, puede usarse la interfase con perl y CGI.pm. </P>
<P>Una pasarela WWW basada en WDB usando perl puede descargarse de <A HREF="http://www.eol.ists.ca/~dunlop/wdb-p95">http://www.eol.ists.ca/~dunlop/wdb-p95</A> </P>
<H4><A NAME="BM2_3"></A>2.3) ¿Tiene PostgreSQL una interfase gr&aacute;fica? ¿Y un generador de informes? ¿Y una interfase para lenguajes de consulta empotrados?</H4>
<P>Tenemos una buena interfase gr&aacute;fica llamada <I>pgaccess,</I> que se incluye como parte de la distribuci&oacute;n. <I>Pgaccess</I> tiene tambi&eacute;n un generador de informes. Su p&aacute;gina Web est&aacute; en&nbsp; <A HREF="http://www.flex.ro/pgaccess">http://www.flex.ro/pgaccess</A> </P>
<P>Tambi&eacute;n se incluye <I>ecpg,</I> que es una interfase empotrada para el lenguaje de consultas SQL en C. </P>
<H4><A NAME="BM2_4"></A>2.4) ¿Que lenguajes est&aacute;n disponibles para comunicarse con&nbsp; PostgreSQL?</H4>
<P>Tenemos: </P>

<UL>
<LI>C(libpq) </LI>
<LI>C++(libpq++) </LI>
<LI>Embedded C(ecpg) </LI>
<LI>Java(jdbc) </LI>
<LI>Perl(perl5) </LI>
<LI>ODBC(odbc) </LI>
<LI>Python(PyGreSQL) </LI>
<LI>TCL(libpgtcl) </LI>
<LI>C Easy API(libpgeasy) </LI>
<LI>Embedded HTML(<A HREF="http://www.php.net/">PHP from http://www.php.net</A>) </LI></UL>

<P><HR></P>
<H2 ALIGN="CENTER">Administrative Questions</H2>
<H4><A NAME="BM3_1">3.1</A>) ¿Por qu&eacute; initdb falla?</H4>

<UL>
<LI>Comprueba que no tienes ninguno de los binarios de versiones anteriores en tu camino (Si tu ves el mensaje <CODE>WARN:heap_modifytuple: repl is \ 9</CODE>, este es el problema.) </LI>
<LI>Comprueba si tienes el conjunto de caminos apropiado </LI>
<LI>Comprueba que el usuario <I>postgres</I> es propietario de los ficheros oportunos </LI></UL>

<H4><A NAME="BM3_2">3.2</A>) ¿C&oacute;mo puedo instalar PostgreSQL en alg&uacute;n sitio distinto de /usr/local/pgsql?</H4>
<P>El camino m&aacute;s simple es especificar la --opci&oacute;n de prefijo cuando ejecutas configure. Si tu olvidaste hacerlo cuando t&uacute; puedes editar Makefile.global y cambiar POSTGRESDIR por consiguiente, o crear un Makefile propio y definir POSTGRESDIR aqu&iacute;. </P>
<H4><A NAME="BM3_3">3.3</A>) Cu&aacute;ndo inicio el postmaster, Obtengo un <I>Llamada err&oacute;nea del sistema o un mensaje core dumped</I> . ¿Por qu&eacute;?</H4>
<P>Esto puede ser varios problemas, pero lo primero que hay que comprobar es ver si tenemos instaladas las extensiones del system V en nuestro n&uacute;cleo. PostgreSQL requiere que el n&uacute;cleo soporte la memoria compartida y los sem&aacute;foros. </P>
<H4><A NAME="BM3_4">3.4</A>) Cu&aacute;ndo intento iniciar postmaster, Obtengo un error <I>IpcMemoryCreate</I> errors3. ¿Por qu&eacute;?</H4>
<P>No tienes configurado correctamente la memoria compartido en el n&uacute;cleo o necesitas agrandar la memoria compartida disponible en el n&uacute;cleo. La cantidad exacta que necesitas depende de tu arquitectura y de cuantos buffers y procesos backend configures para ejecutar postmaster. Para muchos sistemas, con el n&uacute;mero por defecto de buffers y procesos, necesitas un m&iacute;nimo de ~1MB. </P>
<H4><A NAME="BM3_5">3.5</A>) Cu&aacute;ndo intento iniciar postmaster, Obtengo un error <I>IpcSemaphoreCreate</I>. ¿Por qu&eacute;?</H4>
<P>Si el mensaje de error es <I>IpcSemaphoreCreate: semget failed (Sin espacio en el dispositivo)</I> entonces tu n&uacute;cleo no est&aacute; configurado con suficientes sem&aacute;foros. Postgres necesita un sem&aacute;foro para cada proceso backend potencial. Una soluci&oacute;n temporal es comenzar postmaster con un n&uacute;mero l&iacute;mite m&aacute;s peque&ntilde;o de procesos backend. Usa <I>-N</I> con un par&aacute;metro m&aacute;s peque&ntilde;o que el 32 por defecto. Una soluci&oacute;n permanente es elevar los par&aacute;metros del tu n&uacute;cleo <SMALL>SEMMNS</SMALL> y <SMALL>SEMMNI</SMALL>. </P>
<P>Si el mensaje de error es algo parecido, tu no debes tener el soporte de sem&aacute;foro configurado del todo en tu n&uacute;cleo. </P>
<H4><A NAME="BM3_6">3.6</A>) ¿C&oacute;mo me prevengo del acceso de otros hosts a mi base de datos PostgreSQL?</H4>
<P>Por defecto, PostgreSQL s&oacute;lo permite conexiones desde la m&aacute;quina local usando los dominios sockets. Otras maquinas no ser&aacute;n capaces de conectarse sin que t&uacute; a&ntilde;adas la opci&oacute;n -i en <I>postmaster,</I> <B>y</B> habilitas la autenticaci&oacute;n basada en el host modificando el fichero <I>$PGDATA/pg_hba.conf</I> .Por consiguiente esto permitir&aacute; las conexiones TCP/IP. </P>
<H4><A NAME="BM3_7">3.7</A>) ¿Por qu&eacute; no puedo conectarme a mi base de datos desde otra m&aacute;quina?</H4>
<P>La configuraci&oacute;n por defecto permite s&oacute;lo conexiones mediante el dominio socket de unix desde la m&aacute;quina local. Para habilitar las conexiones TCP/IP, hay que tener cuidad de que postmaster haya sido iniciado con la opci&oacute;n <I>-i</I>, y a&ntilde;adir la entrada apropiado de host en el fichero <I>pgsql/data/pg_hba.conf</I>. Mira las p&aacute;ginas del manual de <I>pg_hba.conf.</P>
</I><H4><A NAME="BM3_8">3.8</A>) ¿Por qu&eacute; no puedo acceder a la base de datos como usuario root?</H4>
<P>T&uacute; no debes crear usuarios de bases de datos con el identificador de usuario 0 (root) Estos no podr&aacute;n acceder a la base de datos. Es una precauci&oacute;n de seguridad debido a la capacidad de cualquier usuario de poder enlazar din&aacute;micamente m&oacute;dulos objeto al motor de base. </P>
<H4><A NAME="BM3_9">3.9</A>) Todos mis servidores fallan bajo el acceso concurrente a tablas ¿Por qu&eacute;?</H4>
<P>Este problema puede ser causado por el n&uacute;cleo que no est&eacute; configurado para soportar sem&aacute;foros. </P>
<H4><A NAME="BM3_10">3.10</A>) ¿C&oacute;mo afino el motor de base de datos para mejorar el rendimiento?</H4>
<P>Ciertamente, los &iacute;ndices pueden acelerar las consultas. El comando <SMALL>EXPLAIN</SMALL> habilita que t&uacute; veas como PostgreSQL interpreta tu consulta, y que &iacute;ndices est&aacute; usando. </P>
<P>Si est&aacute;s haciendo muchos <SMALL>INSERTs</SMALL>, considera hacerlo en un gran proceso por lotes usando el comando <SMALL>COPY</SMALL>. Esto es m&aacute;s r&aacute;pido que un solo <SMALL>INSERTS </SMALL>individual. Segundo, la sentencia que no esta en un bloque de transacci&oacute;n <SMALL>BEGIN WORK/COMMIT</SMALL> se considera que esta en su propia transacci&oacute;n. Considera la utilizaci&oacute;n de varias sentencias en un mismo bloque transaccional. Esto reduce el gasto transaccional. Tambi&eacute;n considera quitar o recrear &iacute;ndices cuando las modificaciones de los datos son grandes.</P>
<P>Hay bastantes cosas para afinar que puedes hacer. Puedes deshabilitar fsync() al iniciar el postmaster con las opciones <I>-o -F</I>. Esto previene <I>fsync() </I>del vaciado del disco despu&eacute;s de cada transacci&oacute;n. </P>
<P>Tambi&eacute;n puedes usar la opci&oacute;n de postmaster -B para incrementar el n&uacute;mero de buffers de memoria compartida usados por los procesos backend. Si haces que este par&aacute;metro sea muy alto, postmaster nunca inicia porque has excedido el l&iacute;mite de espacio de memoria compartida del n&uacute;cleo. Cada buffer es de 8K y por defecto hay 64 buffers. </P>
<P>T&uacute; puedes tambi&eacute;n usa la opci&oacute;n del backend -S para incrementar la cantidad m&aacute;xima de memoria usada por los procesos backend para las ordenaciones temporales. El valor de -S est&aacute; medido en kilobytes, y por defecto es de 512 (pe, 512K). </P>
<P>Tambi&eacute;n puedes usar el comando <SMALL>CLUSTER</SMALL> para agrupar los datos en una tabla base para indexarla. Mira las p&aacute;ginas del manual cluster(l) para m&aacute;s detalles. </P>
<H4><A NAME="BM3_11">3.11</A>) ¿Qu&eacute; caracter&iacute;sticas de depuraci&oacute;n est&aacute;n disponibles en PostgreSQL?</H4>
<P>PostgreSQL tiene varias caracteristicas que dan informaci&oacute;n del estado que te pueden ser valiosas para depurar. </P>
<P>Primero, ejecutando configure con la opci&oacute;n--enable-cassert, muchos <I>assert() </I>controlan el progreso de los backend y para el programa cuando ocurre algo inesperado.</P>
<P>Ambos, postmaster y postgres tienen varias opciones de depuraci&oacute;n disponibles. Primero, cuando t&uacute; inicias postmaster, ten cuidado de enviar la salida standard y la de error a un fichero de log, como: </P>
<PRE>&#9;cd /usr/local/pgsql
&#9;./bin/postmaster &gt;server.log 2&gt;&amp;1 &amp;</PRE>
<P>Esto pondr&aacute; varios ficheros de log en el nivel m&aacute;s alto del directorio de PostgreSQL. Este fichero contiene informaci&oacute;n &uacute;til acerca de los problemas o errores encontrados por el servidor. Postmaster tiene la opci&oacute;n -d que permite aun m&aacute;s informaci&oacute;n detallada para ser informada. La opci&oacute;n -d coge el n&uacute;mero que especifica el nivel de depuraci&oacute;n. Es peligroso un valor alto del nivel de depuraci&oacute;n ya que genera grandes ficheros de log. </P>
<P>T&uacute; puedes actualmente ejecutar backend de postgres desde la l&iacute;nea de comandos, y escribir tu sentencia SQL directamente. Esto s&oacute;lo se recomienda si el prop&oacute;sito es depurar. Notar que la terminaci&oacute;n de nueva l&iacute;nea de la consulta, no es el punto y coma. Si t&uacute; has compilado con s&iacute;mbolos de depuraci&oacute;n, t&uacute; puedes utilizar el depurador para ver lo que est&aacute; pasando. Debido a que el backend no fue iniciado por el postmaster, este no se ejecuta en un mismo entorno y los problemas de interacci&oacute;n entre backend no pueden ser duplicado. Algunos depuradores pueden adjuntar a un backend que ya est&aacute; ejecut&aacute;ndose; que es el m&eacute;todo m&aacute;s conveniente para diagnosticar los problemas en un entorno normal multi-backend. </P>
<P>El programa postgres tiene las opciones -s, -A, y -t que pueden ser muy &uacute;tiles para la depuraci&oacute;n y la medida del rendimiento. </P>
<P>T&uacute; tambi&eacute;n puedes compilar con el perfil para ver que funciones est&aacute;n usando tiempo de ejecuci&oacute;n. Los ficheros del perfil de los backend estar&aacute;n depositados en el directorio pgsql/data/base/dbname. El perfil del cliente estar&aacute; localizado en el directorio actual del cliente. </P>
<H4><A NAME="BM3_12">3.12</A>) Obtengo 'Sorry, too many clients' cuando intento conectarme. ¿Por qu&eacute;?</H4>
<P>Tu necesitas aumentar el l&iacute;mite del posmaster para cantidad de procesos backend concurrentes que puede iniciar. </P>
<P>En Postgres 6.5 y superiores, el l&iacute;mite por defecto es 32 procesos. T&uacute; puedes aumentarlo reiniciando el postmaster con el m&aacute;s conveniente valor <I>-N</I>. Con la configuraci&oacute;n por defecto t&uacute; puedes poner <I>-N</I> m&aacute;s grande que 1024; si t&uacute; necesitas m&aacute;s, aumenta <SMALL>MAXBACKENDS</SMALL> en <I>include/config.h</I> y reconstruirlo. Puedes poner el valor <I>-N</I> por defecto en tiempo de configuraci&oacute;n, si te gusta, usando el modificador de configuraci&oacute;n <I>--with-maxbackends</I>. </P>
<P>Notar que si incrementas <I>-N</I> m&aacute;s de 32, debes tambi&eacute;n incrementar <I>-B</I> por encima del 64 que es por defecto; -B debe ser dos veces como m&iacute;nimo -N, y probablemente debe ser m&aacute;s para un mejor rendimiento. Para un gran n&uacute;mero de procesos backend, tambi&eacute;n es probable buscar si necesitas incrementar varios par&aacute;metros de configuraci&oacute;n del n&uacute;cleo de Unix. Cosas a mirar incluyen la m&aacute;xima longitud de los bloques de memoria compartida, <SMALL>SHMMAX,</SMALL> el n&uacute;mero m&aacute;ximo de sem&aacute;foros, <SMALL>SEMMNS</SMALL> y <SMALL>SEMMNI,</SMALL> el n&uacute;mero m&aacute;ximo de procesos, <SMALL>NPROC,</SMALL> el n&uacute;mero m&aacute;ximo de procesos por usuario, <SMALL>MAXUPRC,</SMALL> y el n&uacute;mero m&aacute;ximo de ficheros abiertos, <SMALL>NFILE</SMALL> y <SMALL>NINODE.</SMALL> La raz&oacute;n por la que Postgres tiene limitado el n&uacute;mero de procesos backend permitidos es que puedes asegurar que tu sistema no funcionar&aacute; sin recursos. </P>
<P>En las versiones superiores a la 6.5 de Postgres, el n&uacute;mero m&aacute;ximo de backends eran 64, y el cambio requer&iacute;a la reconstrucci&oacute;n despu&eacute;s de alterar la constante MaxBackendId en <I>include/storage/sinvaladt.h.</I> </P>
<H4><A NAME="BM3_13">3.13</A>) ¿Qu&eacute; son los ficheros pg_psort.XXX en mi directorio de base de datos?</H4>
<P>Hay ficheros temporales generados por el ejecutor de consultas. Por ejemplo, si una ordenaci&oacute;n necesita para realizarse satisfacer un <SMALL>ORDER BY,</SMALL> y la ordenaci&oacute;n requiere m&aacute;s espacio del que el par&aacute;metro -S permite, entonces los ficheros temporales son creados para contener los datos extras. </P>
<P>Los ficheros temporales se deber&iacute;an borrar autom&aacute;ticamente, pero podr&iacute;a ser que no si durante una ordenaci&oacute;n el proceso falla. Si no hay transacciones ejecut&aacute;ndose en este mismo momento, es seguro borrar los ficheros pg_tempNNN.NN. </P>
<H4><A NAME="BM3_14">3.14</A>) ¿C&oacute;mo configuro el pg_group?</H4>
<P>Actualmente, no existe una interface f&aacute;cil, para configurar los grupos de usuarios. Tienes que insertar/modificar expl&iacute;citamente la tabla pg_group. Por ejemplo: </P>
<PRE>&#9;jolly=&gt; insert into pg_group (groname, grosysid, grolist)
&#9;jolly=&gt;     values ('posthackers', '1234', '{5443, 8261}');
&#9;INSERT 548224
&#9;jolly=&gt; grant insert on foo to group posthackers;
&#9;CHANGE
&#9;jolly=&gt;</PRE>
<P>Los campos de pg_group son: </P>

<UL>
<LI>groname: el nombre del grupo. Este nombre debe ser puramente alfanum&eacute;rico. No incluir subrayados no otro tipo de signo de puntuaci&oacute;n. </LI>
<LI>grosysid: es el identificador del grupo. Es un int4. Es &uacute;nico para cada grupo. </LI>
<LI>grolist: la lista de los identificadores de pg_user que pertenecen al grupo. Es un int4[]. </LI></UL>

<P><HR></P>
<H2 ALIGN="CENTER">Preguntas acerca del funcionamiento</H2>
<H4><A NAME="BM4_1"></A>4.1) El sistema parece confundirse con las comas, puntos decimales y los formatos de fechas.</H4>
<P>Compruebe su configuraci&oacute;n local. PostgreSQL utiliza la configuraci&oacute;n local del usuario que arranca el proceso postmaster. Existen comandos SET de postgres y psql para controlar el formato de fecha. Fije este valor de acuerdo con su entorno habitual. </P>
<H4><A NAME="BM4_2"></A>4.2) ¿Cu&aacute;l es la diferencia exacta entre cursores binarios y cursores normales?</H4>
<P>Vea la p&aacute;gina del manual de <SMALL>DECLARE</SMALL> para una descripci&oacute;n. </P>
<H4><A NAME="BM4_3"></A><A NAME="BM4_1"></A>4.3) ¿C&oacute;mo <I>seleccionar</I> solamente las primeras filas de una consulta?</H4>
<P>Vea la p&aacute;gina del manual de <SMALL>FETCH</SMALL> o utilice SELECT ... LIMIT.... </P>
<P>Puede que se deba evaluar la consulta entera, aun en el caso de que quiera que eval&uacute;e unas pocas filas. Considere usar una consulta que tenga <SMALL>ORDER BY.</SMALL> Si hay un &iacute;ndice que concuerda con <SMALL>ORDER BY</SMALL>, PostgreSQL ser&aacute; capaz de evaluar s&oacute;lo los primeros registros pedidos o se evaluar&aacute; la totalidad de la consulta hasta que se obtengan las filas requeridas. </P>
<H4><A NAME="BM4_4"></A>4.4) ¿C&oacute;mo obtener una lista de tablas u otras cosas que pueda ver con <I>psql?</H4>
</I><P>Puede leer el c&oacute;digo fuente de <I>psql,</I> pgsql/src/bin/psql/psql.c. Contiene comandos SQL que generan la salida en la l&iacute;nea de comando de psql. Tambi&eacute;n puede arrancar <I>psql</I> con la opci&oacute;n <I>-E</I>, de modo que le mostrar&aacute; las consultas que utiliza para ejecutar los comandos que usted le pasa. </P>
<H4><A NAME="BM4_5"></A>4.5) ¿C&oacute;mo borrar una columna de una tabla?</H4>
<P>No se soporta <SMALL>ALTER TABLE DROP COLUMN,</SMALL> pero puede hacer eso: </P>
<PRE>&#9;SELECT ...  -- seleccione todas las columnas excepto las que quiera borrar
&#9;INTO TABLE nueva_tabla
&#9;FROM vieja_tabla;
&#9;DROP TABLE vieja_tabla;
&#9;ALTER TABLE nueva_tabla RENAME TO vieja_tabla;</PRE>
<H4><A NAME="BM4_6"></A>4.6) ¿Cu&aacute;l es el tama&ntilde;o m&aacute;ximo de una fila, tabla o base de datos?</H4>
<P>Las filas est&aacute;n limitadas a un tama&ntilde;o de 8 Kb, pero esto se puede cambiar editando <I>include/config.h</I> y cambiando <SMALL>BLCKSZ.</SMALL> Para usar atributos m&aacute;s grandes que 8 Kb, puede usar el interfaz para objetos grandes. </P>
<P>Las filas no pasan el l&iacute;mite de 8 Kb, por lo que una fila de 5 Kb requiere 8 Kb para almacenarse. </P>
<P>Para tablas y bases de datos no existen l&iacute;mites. Hay muchas bases de datos que tienen decenas de gigabytes y algunas incluso cientos. </P>
<H4><A NAME="BM4_7"></A>4.7) ¿Cu&aacute;nto espacio de disco requiere una base de datos para almacenar un fichero normal y corriente?</H4>
<P>Una base de datos Postgres puede requerir alrededor de 6 veces y medio m&aacute;s de disco que lo que necesita para almacenar un fichero normal. </P>
<P>Considere un fichero de 300.000 l&iacute;neas con dos enteros en cada l&iacute;nea. Un fichero normal ocupar&iacute;a 2,4 Mb, mientras que una base de datos de PostgreSQL con esos datos se estima que ocupar&iacute;a unos 14 Mb: </P>
<PRE>    36 bytes: cada cabecera de columna (aproximado)
   + 8 bytes: dos campos con enteros, 4 cada uno
   + 4 bytes: puntero en p&aacute;gina a un tuplo
   ----------------------------------------
    48 bytes por fila

   La p&aacute;gina de datos en PostgreSQL es 8192 bytes (8 KB). As&iacute; que:

   8192 bytes por p&aacute;gina
   -------------------   =  171 filas por base de datos (redondeo hacia arriba)
     48 bytes por fila

   300000 filas de datos
   --------------------  =  1755 p&aacute;ginas en la base de datos
      171 filas por p&aacute;gina

1755 p&aacute;gina base datos * 8192 bytes por p&aacute;gina  =  14.376.960 bytes (14 Mb)</PRE>
<P>Los &iacute;ndices no tienen tanta sobrecarga, pero contienen los datos que est&aacute;n siendo indexados, por lo que tambi&eacute;n pueden ser grandes. </P>
<H4><A NAME="BM4_8"></A>4.8) ¿C&oacute;mo saber qu&eacute; &iacute;ndices u operaciones est&aacute;n definidos en la base de datos?</H4>
<I><P>psql</I> tiene una variedad de comandos con barra invertida para mostrar esta informaci&oacute;n. Utilice \? para verlos. </P>
<P>Pruebe tambi&eacute;n <I>pgsql/src/tutorial/syscat.source.</I> Muestra muchos de los <SMALL>SELECT</SMALL>s necesarios para obtener informaci&oacute;n de las tablas del sistema de base de datos. </P>
<H4><A NAME="BM4_9"></A>4.9) Mis consultas van despacio o no hacen uso de &iacute;ndices. ¿Porqu&eacute;?</H4>
<P>PostgreSQL no mantiene autom&aacute;ticamente estad&iacute;sticas. Cada uno debe hacer expl&iacute;citamente una llamada a <SMALL>VACUUM</SMALL> para actualizar las estad&iacute;sticas. Despu&eacute;s de que &eacute;stas se hayan actualizado, el optimizador conoce cu&aacute;ntas filas hay en la tabla y puede decidir mejor si deber&iacute;a utilizar &iacute;ndices. Tenga en cuenta que el optimizador no usa &iacute;ndices en los casos en que la tabla es peque&ntilde;a, debido a que una b&uacute;squeda secuencial es m&aacute;s r&aacute;pida. </P>
<P>Utilice <SMALL>VACUUM ANALYZE</SMALL> para estad&iacute;sticas optimizadas espec&iacute;ficas para columnas. <SMALL>VACUUM ANALYZE</SMALL> es importante para consultas complejas de tipo multi-join, de modo que el optimizador puede estimar el n&uacute;mero de filas devueltas desde cada tabla y escoger el orden correcto de un "join". El backend no trata estad&iacute;sticas de columna por s&iacute; solo, as&iacute; que <SMALL>VACUUM ANALYZE</SMALL> deber&iacute;a ejecutarse peri&oacute;dicamente para obtener peri&oacute;dicamente estas estad&iacute;sticas. </P>
<P>Normalmente no se usan los &iacute;ndices para operaciones de tipo <SMALL>ORDER BY</SMALL>: una b&uacute;squeda secuencial seguida de una ordenaci&oacute;n expl&iacute;cita es m&aacute;s r&aacute;pida que una b&uacute;squeda por &iacute;ndices de todos los tuplos de una tabla grande porque emplea m&aacute;s accesos a disco. </P>
<P>Cuando utilice operadores comod&iacute;n como <SMALL>LIKE</SMALL> o <I>~,</I> los &iacute;ndices s&oacute;lo pueden ser usados si el comienzo de la b&uacute;squeda fijada al comienzo de de la cadena (string). As&iacute; que para usar &iacute;ndices, las b&uacute;squedas con <SMALL>LIKE</SMALL> no deber&iacute;an empezar con <I>%,</I> y <I>~</I> (expresiones regulares de b&uacute;squeda) deber&iacute;a empezar con <I>^.</I> </P>
<H4><A NAME="BM4_10"></A>4.10) ¿C&oacute;mo ver de qu&eacute; manera el optimizador de consultas est&aacute; evaluando mi consulta?</H4>
<P>Vea en el manual la explicaci&oacute;n de <SMALL>EXPLAIN</SMALL>. </P>
<H4><A NAME="BM4_11"></A>4.11) ¿Qu&eacute; es un &iacute;ndice R-tree?</H4>
<P>Un &iacute;ndice r-tree es usado para indexar datos espaciales. Un &iacute;ndice hash no puede manejar b&uacute;squedas por rangos. Un &iacute;ndice B-tree solamente maneja b&uacute;squedas por rango de una dimensi&oacute;n. Los R-tree pueden manejar datos multidimensionales. Por ejemplo, si un &iacute;ndice R-tree index puede ser construido sobre un atributos del tipo <I>point,</I> el sistema puede responder m&aacute;s eficientemente a consultas como seleccionar todos los puntos dentro de un rect&aacute;ngulo. </P>
<P>El escrito que describe el dise&ntilde;o original de los R-Tree es: </P>
<P>Guttman, A. "R-Trees: A Dynamic Index Structure for Spatial Searching." Proc of the 1984 ACM SIGMOD Int'l Conf on Mgmt of Data, 45-57. </P>
<P>Tambi&eacute;n puede encontrar esta documentaci&oacute;n en "Readings in Database Systems", de Stonebraker</P>
<P>Los R-Trees presentes pueden manejar pol&iacute;gono y cahas. En teor&iacute;a los R-trees pueden ser ampliados para manejar un mayor n&uacute;mero de dimensiones. In la pr&aacute;ctica, ampliar los R-trees requiere un poco de trabajo y actualmente no disponemos de documentaci&oacute;n sobre c&oacute;mo hacerlo. </P>
<H4><A NAME="BM4_12"></A>4.12) ¿Qu&eacute; es una optimizaci&oacute;n gen&eacute;rica de una consulta?</H4>
<P>El modulo de PostgreSQL llamado GEQO tiene el prop&oacute;sito de resolver el problema de optimizaci&oacute;n de las consultas que resultan de unir varias tablas por medio de un Algoritmo Gen&eacute;tico (Genetic Algorithm, GA). Permite manejar grandes consultas tipo "join" por medio de b&uacute;squedas no exhaustivas. </P>
<P>Para mayor informaci&oacute;n, consulte la documentaci&oacute;n.</P>
<H4><A NAME="BM4_13"></A>4.13) ¿C&oacute;mo hacer b&uacute;squedas de expresiones regulares y b&uacute;squedas de expresiones regulares sensibles al contexto?</H4>
<P>El operador <I>~</I> realiza coincidencias de expresiones regulares y <I>~*</I> realiza coincidencias sensibles a may&uacute;sculas y min&uacute;sculas en expresiones regulares. No hay ninguna variante de LIKE sensible a may&uacute;sculas/min&uacute;sculas, pero puede obtener el efecto de sensibilidad a may&uacute;scula/min&uacute;sculas <SMALL>LIKE</SMALL> con esto: </P>
<PRE>&#9;WHERE lower(texto) LIKE lower(patr&oacute;n)</PRE>
<H4><A NAME="BM4_14"></A>4.14) En una consulta, ¿c&oacute;mo detectar si un campo es NULL (nulo)?</H4>
<P>Utilice IS NULL e IS NOT NULL. </P>
<H4><A NAME="BM4_15"></A>4.15) ¿Cu&aacute;l es la diferencia entre los diferentes tipos de caracteres?</H4>
<PRE>Tipo          Nombre interno  Notas
--------------------------------------------------
"char"          char            1 car&aacute;cter
CHAR(#)         bpchar          relleno con espacios en blanco hasta la longitud especificada
VARCHAR(#)      varchar         longitud m&aacute;xima, no relleno
TEXT            text            longitud limitada s&oacute;lo por longitud m&aacute;xima de fila
BYTEA           bytea           array de bytes de longitud variable</PRE>
<P>Ver&aacute; el nombre interno cuando examine los cat&aacute;logos de sistema o en algunos mensajes de error. </P>
<P>Los cuatro &uacute;ltimos tipos son tipos "varlena" (es decir, los primeros cuatro bytes son la longitud, seguidos de los datos). <I>char(#)</I> asigna el n&uacute;mero m&aacute;ximo de bytes sin tener en cuenta cu&aacute;nntos datos est&aacute;n almacenados en el campo. <I>text, varchar(#),</I> y <I>bytea</I> tienen una longitud variable en el disco y, por esto, hay una penalizaci&oacute;n en las prestaciones cuando los usa, Esta penalizaci&oacute;n se da cuando accede a todas las columnas despu&eacute;s de acceder a la primera de este tipo. </P>
<H4><A NAME="BM4_16_1"></A>4.16.1) ¿C&oacute;mo crear un campo serie/autoincremento?</H4>
<P>PostgreSQL soporta tipos de datos <SMALL>SERIAL</SMALL>. Autom&aacute;ticamente crea una secuencia e &iacute;ndice en la columna. Por ejemplo, esto... </P>
<PRE>&#9;CREATE TABLE person ( 
&#9;&#9;id   SERIAL, 
&#9;&#9;name TEXT 
&#9;);</PRE>
<P>...se traduce autom&aacute;ticamente a esto otro... </P>
<PRE>&#9;CREATE SEQUENCE person_id_seq;
&#9;CREATE TABLE person ( 
&#9;&#9;id   INT4 NOT NULL DEFAULT nextval('person_id_seq'),
&#9;&#9;name TEXT 
&#9;);
&#9;CREATE UNIQUE INDEX person_id_key ON person ( id );</PRE>
<P>Consulte <I>create_sequence</I> en el manual para tener m&aacute;s informaci&oacute;n sobre secuencias. Tambi&eacute;n puede usar cada campo <I>oid</I> de las filas como valor &uacute;nico. Sin embargo, si necesita volcar y recargar la base de datos deber&aacute; usar la opci&oacute;n <I>pg_dump -o</I> o <SMALL>COPY WITH OIDS</SMALL> para preservar los oid. </P>
<P>Para m&aacute;s detalles vea el cap&iacute;tulo de Bruce Momjian chapter en <A HREF="http://www.postgresql.org/docs/aw_pgsql_book/node74.html">Numbering Rows.</A> </P>
<H4><A NAME="BM4_16_2"></A>4.16.2) ¿C&oacute;mo obtener el valor de una inserci&oacute;n serie (serial insert)?</H4>
<P>Quiz&aacute;s la manera m&aacute;s simple es obteniendo el pr&oacute;ximo valor de la serie del objeto secuencia con la funci&oacute;n <I>nextval()</I> <I>antes</I> de insertar y entonces insertarlo expl&iacute;citamente. Usando la tabla de ejemplo en <A HREF="#BM4_16.1">4.16.1</A>, que aperecer&iacute;a as&iacute;: </P>
<PRE>&#9;$newSerialID = nextval('person_id_seq');
&#9;INSERT INTO person (id, name) VALUES ($newSerialID, 'Blaise Pascal');</PRE>
<P>Entonces tendr&aacute; tambi&eacute;n el nuevo valor almacenado en <CODE>$newSerialID</CODE> para ser usado en otras consultas (por ejemplo, como una clave for&aacute;nea en la tabla <CODE>person</CODE>). Tenga que el nombre que el nombre del objeto secuencia autom&aacute;ticamente creado ser&aacute; &lt;<I>table</I>&gt;_&lt;<I>serialcolumn</I>&gt;_<I>seq</I>, donde <I>table</I> y <I>serialcolumn</I> son los nombres de la tabla y la columna SERIE respectivamente. </P>
<P>Del mismo modo, podr&iacute;a recuperar el reci&eacute;n asignado valor serie con la funci&oacute;n <I>currval</I>() <I>despu&eacute;s</I> de que fuera insertado por defecto. Por ejemplo:</P>
<PRE>&#9;INSERT INTO person (name) VALUES ('Blaise Pascal');
&#9;$newID = currval('person_id_seq');</PRE>
<P>Finalmente, puede utilizar el <A HREF="#BM4_17">oid</A> devuelto desde la declaraci&oacute;n INSERT para encontrar el valor por defecto, aunque esta es la aproximaci&oacute;n menos portable. En perl, usando DBI con el m&oacute;dulo de Edmund Mergl DBD::Pg, el valor oid se muestra disponible por medio de $sth-&gt;{pg_oid_status} despu&eacute;s de $sth-&gt;execute(). </P>
<H4><A NAME="BM4_16_3"></A>4.16.3) ¿No provoca el uso de currval() y nextval() una condici&oacute;n de competencia con otros procesos concurrentes del backend?</H4>
<P>No. Esto es gestionado por los backends. </P>
<H4><A NAME="BM4_17"></A>4.17) ¿Qu&eacute; es un oid? ¿Qu&eacute; es un tid?</H4>
<P>Los OID son las respuesta de PostgreSQL a ids de filas &uacute;nicas. Cada fila que es creada en PostgreSQL obtiene una &uacute;nica oid. Todos los oid generados durante initdb son menos de 16384 (de <I>backend/access/transam.h</I>). Todos los oid creados por el usuario son mayor o igual que este. Por defecto, todos estos oid son &uacute;nicos, no s&oacute;lo dentro de tablas o bases de datos, sino tambi&eacute;n a lo largo de la instalaci&oacute;n de PostgreSQL. </P>
<P>PostgreSQL usa oids en sus tablas internas de sistema para enlazar filas entre tabalas. Estos oids pueden ser usados para identificar filas de un usuario espec&iacute;fico y usados tambi&eacute;n en joins. Se recomienda que use oid tipo columna para almacenar los valores oid. Vea la secci&oacute;n de manual <I>sql(l)</I> para estudiar las otras columnas internas. Puede crear un &iacute;ndice en el campo oid para accesos m&aacute;s r&aacute;pidos. </P>
<P>Los oids se asignan a cada nueva fila de un &aacute;rea central que es usada por todas las bases de datos. Si quiere cambiar el oid a cualquier otro valor o si quiere hacer una copia de una tabla con los oids originales, no hay ninguna raz&oacute;n que se lo impida: </P>
<PRE>        CREATE TABLE new_table(old_oid oid, mycol int);
        SELECT INTO new SELECT old_oid, mycol FROM old;
        COPY new TO '/tmp/pgtable';
        DELETE FROM new;
        COPY new WITH OIDS FROM '/tmp/pgtable';
<!--
	CREATE TABLE new_table (mycol int);
	INSERT INTO new_table (oid, mycol) SELECT oid, mycol FROM old_table;
--></PRE>
<P>Los tids se usan para identificar filas espec&iacute;ficas con bloques y valores de desplazamiento (offset). Los tids cambian despu&eacute;s de que se haya modificado o recargado una fila. Son usado por las entradas de &iacute;ndice apuntar a filas f&iacute;sicas. </P>
<H4><A NAME="BM4_18"></A>4.18) ¿Cu&aacute;l es el significado de algunos t&eacute;rminos usados en PostgreSQL?</H4>
<P>Parte del c&oacute;digo fuente y documentaci&oacute;n vieja usa t&eacute;rminos que tienen un uso m&aacute;s com&uacute;n. Aqu&iacute; est&aacute;n algunos: </P>

<UL>
<LI>table, relation, class </LI>
<LI>row, record, tuple </LI>
<LI>column, field, attribute </LI>
<LI>retrieve, select </LI>
<LI>replace, update </LI>
<LI>append, insert </LI>
<LI>oid, serial value </LI>
<LI>portal, cursor </LI>
<LI>range variable, table name, table alias </LI></UL>

<H4><A NAME="BM4_19"></A>4.19) ¿Porqu&eacute; me da este error "FATAL: palloc failure: memory exhausted?"</H4>
<P>Es posible que su sistema se haya quedado sin memoria virtual o que el kernel tenga un l&iacute;mite muy bajo para ciertos recursos. Intento probar esto antes de arrancar el postmaster: </P>
<PRE>&#9;ulimit -d 65536
&#9;limit datasize 64m</PRE>
<P>Dependiendo de su shell, solamente uno de ellos puede tener &eacute;xito, pero fijar&aacute; el l&iacute;mite del segmento de datos de su proceso a un valor m&aacute;s alto y quiz&aacute;s permita que la consulta termine. Este comando se aplica al proceso actual y a todos los sub-procesos creados despu&eacute;s de que el comando se ejecutara. Si tiene problemas con el cliente SQL porque el backend devuelve demasiados datos, pru&eacute;belo antes de arrancar el cliente. </P>
<H4><A NAME="BM4_20"></A>4.20) ¿C&oacute;mo saber qu&eacute; versi&oacute;n de PostgreSQL estoy usando?</H4>
<P>Desde <I>psql,</I> escriba <CODE>select version();</CODE> </P>
<H4><A NAME="BM4_21"></A>4.21) Las operaciones con objetos grandes me dan el <I>invalid large obj descriptor.</I> ¿Por qu&eacute;? </H4>
<P>Debe poner <CODE>BEGIN WORK</CODE> y <CODE>COMMIT </CODE>para englobar cualquier uso de objetos grandes, esto es, que englobe <CODE>lo_open</CODE> ... <CODE>lo_close.</CODE> </P>
<P>PostgreSQL impone la regla de cerrar el uso de objetos grandes en transacciones y dar&iacute;a un error en el comando <I>lo_open</I> si no se est&aacute; dentro de una transacci&oacute;n. De modo que el primer intento de hacer cualquier cosa con &eacute;l pintar&aacute; en pantalla <I>invalid large obj descriptor.</I> El c&oacute;digo que antes funcionaba generar&aacute; ahora ese mensaje de error si usted falla al realizar una transacci&oacute;n. </P>
<P>Si est&aacute; utilizando un interfaz cliente como ODBC, puede ser necesario que especifique <CODE>auto-commit off.</CODE> </P>
<H4><A NAME="BM4_22"></A>4.22) ¿C&oacute;mo creo una columna que tome por defecto la hora actual?</H4>
<P>Esto siempre funciona: </P>
<CODE><PRE>&#9;CREATE TABLE test (x int, modtime timestamp default now() );</PRE>
</CODE><P>En las versiones 7.0 y posteriores puede usar: </P>
<CODE><PRE>&#9;create table test (x int, modtime timestamp default 'now');</PRE>
</CODE><H4><A NAME="BM4_23"></A>4.23) ¿Porqu&eacute; son tan lentas mis sub-consultas cuando uso <CODE>IN</CODE>?</H4>
<P>Normalmente unimos sub-consultas con otras externas haciendo una b&uacute;squeda secuencial de los resultados de la sub-consulta para cada fila de la consulta externa. Un modo de evitar esto es reemplazar <CODE>IN</CODE> con <CODE>EXISTS</CODE>. Por ejemplo, cambie: </P>
<CODE><PRE>&#9;SELECT *
&#9;FROM tab
&#9;WHERE col1 IN (SELECT col2 FROM TAB2)</PRE>
</CODE><P>por: </P>
<CODE><PRE>&#9;SELECT *
&#9;FROM tab
&#9;WHERE EXISTS (SELECT col2 FROM TAB2 WHERE col1 = col2)</PRE>
</CODE><P>Esperamos eliminar esta limitaci&oacute;n en futuras versiones<HR></P>
<H2 ALIGN="CENTER">Extendiendo PostgreSQL</H2>
<H4><A NAME="BM5_1"></A>5.1) He escrito una funci&oacute;n de usuario. Cuando la ejecuto con <I>psql, </I>¿<I>por qu&eacute; provoca un volcado de n&uacute;cleo (</I>dump core)?</H4>
<P>El problema puede venir por varias cosas. Pruebe su funci&oacute;n de usuario en un programa independiente. </P>
<H4><A NAME="BM5_2"></A>5.2) ¿Que significa el mensaje: <I>NOTICE:PortalHeapMemoryFree: 0x402251d0 not in alloc set!</I> ?</H4>
<P>Est&aacute; liberando con&nbsp; <I>pfree</I> una memoria que no ha sido asignada con&nbsp; <I>palloc.</I> Tenga cuidado de no mezclar <I>malloc/free</I> y <I>palloc/pfree.</I> </P>
<H4><A NAME="BM5_3"></A>5.3) ¿Como puedo contribuir aportando algunos nuevos tipos y funciones a&nbsp; PostgreSQL?</H4>
<P>Env&iacute;e sus extensiones a la lista de correo pgsql-hackers, y puede que sean incluidas en el subdirectorio&nbsp; <I>contrib/</I>. </P>
<H4><A NAME="BM5_4"></A>5.4) ¿Como puedo escribir una funci&oacute;n en C que devuelva un par de valores?</H4>
<P>Esto requiere dominio tan extremo que los autores no lo han intentado nunca, aunque en principio puede hacerse. </P>
<H4><A NAME="BM5_5"></A>5.5) He cambiado un fichero fuente ¿Por qu&eacute; si recompilo no se observa el cambio?</H4>
<P>&nbsp;Makefiles no tiene las dependencias adecuadas para los ficheros incluidos. Tiene que hacer un&nbsp; <I>make clean</I> y despu&eacute;s otro&nbsp; <I>make</I> </P></BODY>
</HTML>
