<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>

<head>

<meta name="keywords" content="Jon C. LeBlanc migraci&oacute;n migrar convertir
Microsoft art&iacute;culo Windows NT 2000 XP UNIX Linux 98 ME Office Outlook
licencias confiabilidad reemplazar Red Hat Caldera IBM QNX SUSE TurboLinux
Mandrake Itanium Hammer AMD Intel Compaq Dell Gateway Apple Hewlett Packard Sun
Solaris Alpha MIPS SGI IRIX Silicon Graphics 32 64 plan CTO CIO Samba comparar
comparaci&oacute;n Passport Hailstorm my .NET servicios Office Unisys NEC
Datacenter Advanced Server Workstation vs versus benchmark Open Source Apache
interoperabilidad integrar plataformas cruzadas conversi&oacute;n
evaluaci&oacute;n opini&oacute;n plan raz&oacute;n t&eacute;cnico hosting instalar
actualizar SGI HP-UX True64 AIX OS X Macintosh educaci&oacute;n Unixware Novell
SunOS p2p virus hack">

<meta name="description" content="This site provides IT executives with
arguments for migrating corporate computing resources away from Microsoft
Windows NT, 2000, and XP to UNIX/Linux.">

<title>
Migre con confianza de Microsoft Windows NT, 2000 y XP a UNIX/Linux
</title>

</head>

<body bgcolor="#ffffff" text="#000000" link="#009900" alink="#808040"
vlink="#ff0000">

<h2>
   <font face="arial,helvetica", color="#000066">
      Migre con confianza de Microsoft Windows NT, 2000 y XP a UNIX/Linux
   </font>
</h2>
 
<h3>
   <font face="arial,helvetica", color="#000066">
      Informaci&oacute;n estrat&eacute;gica para ejecutivos y responsables de TI
   </font>
</h3>

<font face="arial,helvetica", color="#000099">
   Art&iacute;culo de <a href="index.html">Jon C. LeBlanc</a>
   <br>
   Responsable de proyectos de TI,
   <br>
   <font size="2">
      (Profesional de TI certificado por Hewlett Packard, Administrador de
       sistemas certificado por Sun Microsystems)
   </font>
   <br>
   Derechos de copia reservados &copy; 2002 a Jon C. LeBlanc.
   <br>
   <font size="1">
      Este material puede ser distribuido s&oacute;lo bajo los t&eacute;rminos
      y condiciones establecidos en la Licencia de Publicaci&oacute;n Abierta,
      V1.0 o posterior (la &uacute;ltima versi&oacute;n est&aacute; disponible en
      <a href="http://www.opencontent.org/openpub/">
         http://www.opencontent.org/openpub/
      </a>).
      <br>
      Se prohibe la distribuci&oacute;n de versiones sustancialmente modificadas
      de este documento sin el permiso expl&iacute;cito del propietario del
      derecho de copia.
   </font>
   <font size="2">
      Publicado originalmente el <i>29 de marzo de 1.999</i>
      <br>
      &Uacute;ltima actualizaci&oacute;n el <i>22 de febrero de 2.002</i>
      <br>
      Localizaci&oacute;n de este documento en la web
      (original en ingl&eacute;s):
      <a href="http://web.cuug.ab.ca/%7Eleblancj/nt_to_unix.html">
         http://web.cuug.ab.ca/~leblancj/nt_to_unix.html
      </a>
   </font>
</font>
<br>
<br>

<hr width="60%"> 

<br>

<table width="85%" cellspacing="0">
<tbody>
<tr>
<td>
<h4>
   <font face="arial,helvetica", size="2", color="#000066">
      Resumen ejecutivo
   </font>
</h4>

<font face="arial,helvetica", font size="2", font color="#000099">
<ul>
   Este art&iacute;culo y el sitio web que lo alberga pretenden ofrecer
   a los actuales ejecutivos de TI, responsables de proyectos de TI,
   administradores de sistemas y compradores de TI argumentos claros, breves,
   objetivos y realistas en pro de la migraci&oacute;n de algunos o todos sus
   recursos inform&aacute;ticos corporativos desde los sistemas operativos
   Microsoft Windows NT, 2000 y XP hacia una alternativa atractiva y cada vez
   m&aacute;s popular: <i>UNIX/Linux</i>.
   <br>
   En la comunidad corporativa, la toma de decisiones err&oacute;neas puede tener
   resultados fiscales y productivos extremadamente devastadores o, cuanto
   menos, insatisfactorios. Existen razones de peso (eficiencia, seguridad,
   rendimiento, coste del sofware y de las licencias) para migrar los sistemas
   desde Microsoft Windows NT y 2000, as&iacute; como para evitar la compra de la
   versi&oacute;n XP del sistema operativo Microsoft Windows. &iquest;Es
   aplicable este art&iacute;culo a su entorno? Si sus principales aplicaciones
   s&oacute;lo se ejecutan en sistemas operativos Windows y no tiene capacidad
   para cambiarlas, probablemente no. Sin embargo, espero que el
   art&iacute;culo sirva para ilustrar v&iacute;as y alternativas en el futuro.
   <br>
   He instalado sistemas Microsoft Windows NT y 2000 en entornos
   inform&aacute;ticos de &aacute;mbito global, y estoy en contacto directo con
   evaluadores corporativos de Microsoft Windows XP. Al mismo tiempo he
   instalado y administrado, tambi&eacute;n en entornos globales diferentes
   versiones de UNIX de Hewlett-Packard, Sun  Microsystems, IBM y Compaq,
   as&iacute; como distribuciones Linux de Red Hat, Caldera, Mandrake, Corel,
   TurboLinux y SUSE. Actualmente estoy evaluando el sistema operativo X de
   Apple. Como instructor experimentado, responsable de proyectos y
   administrador de sistemas multiplataforma, espero que mis
   <a href="http://web.cuug.ab.ca/~Eleblancj/index.html">
      credenciales
   </a>
   sean de confianza.
   <br>
   (<i>http://web.cuug.ab.ca/~leblancj</i>)
   <br>
   <font color="#ff0000">
      En breve estar&aacute; disponible una discusi&oacute;n sobre el OS X
      (sistema operativo X) de Apple, un escritorio UNIX para la productividad
      laboral y el usuario dom&eacute;stico.
   </font>
</ul>
</font>
<br>

<h4>
   <font face="arial,helvetica", size="2", color="#000066">
      Contenido
   </font>
</h4>
<br>

<font face="arial,helvetica", size="2", color="#000099">
<ul>
   <li>
      <a href="#one">
         La alternativa UNIX/Linux a Microsoft Windows NT, 2000 y XP.
      </a>
   </li>
   <li>
      <a href="#two">
         Compatibilidad de red y compatibilidad del entorno general.
      </a>
   </li>
   <li>
      <a href="#three">
         El futuro de la plataforma .NET de Microsoft.
      </a>
   </li>
   <li>
      <a href="#four">
         Interoperabilidad de plataformas y del software.
      </a>
   </li>
   <li>
      <a href="#five">
         Rendimiento.
      </a>
   </li>
   <li>
      <a href="#six">
         Cuestiones relacionadas con el hardware.
      </a>
   </li>
   <li>
      <a href="#seven">
         Administraci&oacute;n de sistemas.
      </a>
   </li>
   <li>
      <a href="#eight">
         Automatizaci&oacute;n.
      </a>
   </li>
   <li>
      <a href="#nine">
         Seguridad.
      </a>
   </li>
   <li>
      <a href="#ten">
         Escalabilidad.
      </a>
   </li>
   <li>
      <a href="#eleven">
         Percepciones y "compartici&oacute;n de ideas".
      </a>
   </li>
   <li>
      <a href="#twelve">
         Cuestiones de software y compatibilidad.
      </a>
   </li>
   <li>
      <a href="#thirteen">
         "A la caza" del pavo.
      </a>
   </li>
   <li>
      <a href="#fourteen">
         En el escritorio.
      </a>
   </li>
   <li>
      <a href="#fiveteen">
         Meditando su decisi&oacute;n de migrar.
      </a>
   </li>
   <li>
      <a href="#sixteen">
         Resumen y conclusiones.
      </a>
   </li>
   <li>
      <a href="#seventeen">
         Recursos de Internet seleccionados.
      </a>
   </li>
</ul>
</font>

<hr width="60%"> 

<font face="arial,helvetica", size="2", color="#000099">
<ul>

<h4>
   <a name="one"></a>
   <font color="#000066">
      La alternativa UNIX/Linux a Microsoft Windows NT, 2000 y XP.
   </font>
</h4>

Durante las &uacute;ltimas tres d&eacute;cadas distintas variantes del sistema
operativo UNIX (SO UNIX) han estado en desarrollo y se han puesto en
producci&oacute;n, haci&eacute;ndo de &eacute;l uno de los sistemas operativos
m&aacute;s estables, capaces, fiables y mejorados para servidores de altas
prestaciones y supercomputadores, a la vez que siguen siendo la opci&oacute;n
natural para las estaciones de alto rendimiento. Las variantes de UNIX de los
principales distribuidores son <i>Solaris</i> de Sun  Microsystems, <i>AIX</i>
de IBM, <i>HP-UX</i> de Hewlett Packard, <i>True64</i> de Compaq, <i>IRIX</i>
de SGI y <i>SCO</i> de The Santa Cruz Operation (ahora parte de Caldera). Estos
SSOO comerciales son diferentes en peque&ntilde;as particularidades y sin embargo se
adhieren a las especificaciones gen&eacute;ricas de UNIX. Otras variedades de
UNIX se ofrecen con una vena considerablemente menos comercial, aunque son
sistemas completos y capaces ser utilizados en las instalaciones de primera
l&iacute;nea en muchos casos: <i>FreeBSD, NetBSD, OpenBSD,</i> y otros. Cuando
Apple lleg&oacute; a la conclusi&oacute;n de que su SO Macintosh hab&iacute;a
cumplido bien su deber m&aacute;s all&aacute; del tiempo que era de esperar,
volvieron su mirada a UNIX como el sistema base para el moderno y muy superior
producto que deb&iacute;a reemplazarlo llamado OS X.
<br>

<i>Linux</i> es una ramificaci&oacute;n de UNIX que tiene m&aacute;s de diez
a&ntilde;os de desarrollo, y utiliza (y amenudo mejora) las
caracter&iacute;sticas esenciales de dise&ntilde;o, los conceptos, los
est&aacute;ndares y el rendimiento de UNIX. En este sentido, Linux es
considerado a veces como un UNIX <i>cl&oacute;nico</i>, aunque probablemente
ser&iacute;a m&aacute;s adecuado describirlo como "<i>equivalente-a-UNIX</i>".
En la mayor&iacute;a de los casos, y a menos que se est&eacute;n discutiendo
diferencias espec&iacute;ficas entre UNIX y Linux, nos podemos sentir
c&oacute;modos hablando generalmente de ellos en t&eacute;rminos similares. Las
principales <i>distribuciones</i> de Linux (versiones o sabores) son Red Hat,
Caldera, Suse, TurboLinux, Debian y Mandrake. Todas ellas son completamente
interoperables entre s&iacute;. A nivel muldial, el soporte de Linux por parte
de los diferentes distribuidores de hardware incluye entre otros a IBM, HP, Dell,
Compaq y (&uacute;ltimamente) Sun.
<br>

UNIX naci&oacute; y creci&oacute; en un medio de alto rendimiento y conectividad.
Junto al SO <i>UNIX, el lenguaje C y las redes TCP/IP fueron desarrolladas
conjuntamente en los 70 y son intr&iacute;nsecamente inseparables</i>.
Originalmente denominado "Sistema de Tiempo Compartido UNICS" cuando Ken
Thompson, Dennis Ritchie y otros en los Laboratorios Bell lo desarrollaron por
primera vez, UNIX fue dise&ntilde;ado desde sus fundamentos para ser un entorno
inform&aacute;tico multitarea y multiusuario. Linux recibe directamente esa base.
Y los dos han seguido siendo expandidos met&oacute;dicamente para mejorar sus ya
viables capacidades.
<br>

Microsoft Windows NT, Windows 2000 y Windows XP ofrecen se pueden comparar a
UNIX/Linux, pero s&oacute;lo al nivel de las estaciones de trabajo de gama baja y
los servidores de bajas prestaciones. Al comienzo de los 90, Windows NT fue
lanzado por Microsoft como una alternativa de bajo coste basada en DOS y VMS a
UNIX y otros sistemas operativos y, desde luego, que Microsoft no hizo nada para
detener la creciente percepci&oacute;n de &eacute;l como un potencial "asesino de UNIX".
<br>

Los ingenieros y desarrolladores que fueron reclutados de Digital Equipment
Corporation (DEC) trajeron al &aacute;rea de Microsoft una excelente experiencia
basada en VMS. Dave Cutler, considerado el "padre" de NT y quiz&aacute;s el
desarrollador clave del sistema opeativo VMS de DEC, hab&iacute;a estado
trabajando en DEC en un nuevo sistema operativo, apodado "Mica" que
pretend&iacute;a ser el sucesor de VMS. La alta direcci&oacute;n de DEC estaba
preocupada por que Cutler se estuviera aproximando al dise&ntilde;o desde una
perspectiva de sistema independiente de la plataforma. Un concepto central al
dise&ntilde;o de Mica era el de "Nivel de Abstracci&oacute;n Hardware"
(<i>Hardware Abstraction Layer</i> HAL) que ofrec&iacute;a una plataforma
uniforme de software con independencia de la maquinaria inform&aacute;tica
subyacente. Los ejecutivos de DEC, creyendo que los ingresos derivados del
hardware de su propiedad podr&iacute;an bajar si Mica era adaptado al hardware
de otras compa&ntilde;&iacute;as, cancelaron el proyecto Mica. Haciendo una
retrospectiva, se podr&iacute;a decir que HAL fue el precursor de la plataforma
Java de Sun, plataforma que ten&iacute;a metas semejantes y contra la que,
ir&oacute;nicamente, Microsoft ha emprendido una cruzada que todav&iacute;a se
mantiene. Cutler, libre ahora, fue r&aacute;pidamente integrado en Microsoft y
empez&oacute; a trabajar en el proyecto de Windows NT en 1988.
<br>

Con el tiempo, al sospechar de robo de propiedad intelectual, DEC demand&oacute;
a Microsoft con el argumento de que Cutler y su equipo de Mica en realidad
hab&iacute;an continuado el mismo proyecto dentro de Microsoft, que
culmin&oacute; en el nacimiento del sistema operativo Windows NT. Despu&eacute;s de que
Microsoft lleg&oacute; a un acuerdo con DEC por 150 millones de d&oacute;lares,
fuentes internas comentaron que importantes cantidades del c&oacute;digo de NT
(incluso la mayor&iacute;a de los comentarios de los programadores) eran
id&eacute;nticos a los de Mica. Lo que deja impl&iacute;cito esta historia es que
Microsoft ten&iacute;a la promesa de un sistema operativo de primera clase en sus
manos. Si los desarrolladores de Microsoft se hubieran impuesto a su departamento
de marketing, la inform&aacute;tica corporativa hoy podr&iacute;a ser muy
diferente.
<br>

Para el mundo de la inform&aacute;tica corporativa, la raiz de los problemas con
Windows NT y los sistemas operativos sucesores de &eacute;ste est&aacute; en que NT fue
implantado y creci&oacute; dentro de la experiencia de Microsoft muy limitada a
entornos locales y sistemas de escritorio peque&ntilde;os, en los que todos los
ordenadores conectados se consideraban completamente seguros y el sistema
operativo no era capaz de realizar multitarea real o inform&aacute;tica
multiusuario. Desde el principio de NT, el modelo de reemplazo c&iacute;clico
de versiones de Microsoft implic&oacute; que, incluso los mejores esfuerzos por
crear un sistema operativo comercial multiusuario y multitarea fueron in&uacute;tiles
ante la serie de paquetes de caracter&iacute;sticas solicitadas por el
departamento de marketing prioritarios sobre la seguridad t&eacute;cnica
intr&iacute;nseca, la escalabilidad y las mejoras en estabilidad. Microsoft
Windows 2000 y XP est&aacute;n construidos directamente sobre la
tecnolog&iacute;a de Windows NT, como sus pantallazos de carga declaran.
<br>

La mayor&iacute;a de las caracter&iacute;sticas m&aacute;s b&aacute;sicas de los
sistemas operativos de Microsoft son redise&ntilde;adas y reescritas en nombre
de la diferenciaci&oacute;n de las diferentes versiones del producto, a menudo,
dejando varados a los usuarios de versiones anteriores con poco o ning&uacute;n soporte
de continuidad antes de que el fabricante pueda llevar a esas versiones a un
estado de robustez, estabilidad y fiabilidad. El ciclo de producto dirigido por
el departamento de marketing gira otra vez con la salida a finales de 2001 de
Windows XP. Para dejarlo m&aacute;s claro, <i>amenudo la diferenciaci&oacute;n de
las versiones de los productos de Microsoft no se corresponde con mejoras del
producto</i>. La preocupaci&oacute;n de los comerciales por "lanzar al mercado
cuanto antes" ha creado serias dudas sobre la calidad de muchos productos
Microsoft, como se discute m&aacute;s adelante en relaci&oacute;n con las
cuestiones de seguridad.
<br>

Microsoft Windows NT era muy prometedor en el momento de su lanzamiento, como lo
era Windows 2000 y como tambi&eacute;n lo es Windows XP. Muchas de las promesas
m&aacute;s celebradas por el departamento de marketing siguieron sin cumplirse
cuando NT fue retirado con su sexto "service pack" en 1999, mientras que Windows
2000 ofreci&oacute; mejoras pero tambi&eacute;n dificultades adicionales y alternativas
similares. El conjunto de caracter&iacute;sticas de XP, la perspectiva de
seguridad d&eacute;bil y el soporte multitarea y multiusuario generalmente pobre fuerza
el uso de la palabra <i>mejora</i> en comparaci&oacute;n con las ofertas
anteriores de los sistemas operativos de Microsoft.
<br>

<h4>
   <a name="two"></a>
   <font color="#000066">
      Compatibilidad de red y compatibilidad del entorno general.
   </font>
</h4>

Para servidores de gama media y alta, los usuarios corporativos m&aacute;s
importantes tradicionalmente han confiando en UNIX para soportar aquellas
aplicaciones de tipo comercial como Oracle, Sybase, SAP, Lotus Notes y otras.
&Uacute; se est&aacute; haciendo muy habitual el sistema operativo Linux para
los servidores web (t&iacute;picamente ejecutanto un servidor web de
c&oacute;digo abierto muy popular llamado Apache), los servidores de gama baja
para las peque&ntilde;as empresas, los entornos locales y en el centro de datos.
De hecho, la industria de TI ha mostrado una voluntad significativa de migrar
sus sistemas UNIX de gama baja a Linux debido a su sencillez de
sustituci&oacute;n y a la significativa reducci&oacute;n de costes que supone
sobre UNIX. Esto tambi&eacute;n est&aacute; ayudado de manera inestimable por el hecho
de que tanto UNIX como Linux permiten a los administradores integrar
completamente capacidades y metodolog&iacute;as (basadas en est&aacute;ndares
t&eacute;cnicos y protocolos "abiertos" y <i>universales</i>) entre todas estas
m&aacute;quinas, as&iacute; como con la clase de peque&ntilde;os servidores y
estaciones que tambi&eacute;n pueden utilizar UNIX/Linux pero que amenudo son
habitados por Microsoft Windows NT y Windows 2000 (y ahora son el objetivo de
Microsoft para XP).
<br>

Sin embargo, los productos Microsoft est&aacute;n &aacute;mpliamente basados en
protocolos de red, formatos de ficheros y datos, y funcionalidad
<i>propietarios</i>. Todo esto corrompe dicha integraci&oacute;n vertical y lleva
a los responsables de TI a "encerrarse" en el subconjunto cerrado centrado en
Microsoft. Modificar un servidor o estaci&oacute;n de trabajo Windows para que
cumpla con los protocolos universales puede ser dif&iacute;cil y costoso.
<br>

La experiencia de los &uacute;ltimos a&ntilde;os demuestra que cuando las personas que
han hecho sus carreras principal o &uacute;nicamente en el mundo del sistema operativo
Microsoft han sido promocionados en las estructuras de gesti&oacute;n de IT
corporativas, han tendido a ver la inform&aacute;tica corporativa como una
extensi&oacute;n de la inform&aacute;tica de escritorio basada en Microsoft, y
as&iacute; han tendido a resolver los requerimientos de los entornos de
servidores de gama media y alta desde una perspectiva demasiado estrecha. Un
ecosistema resultante de la inform&aacute;tica centrada en Microsoft trae de
forma injustificada la elevaci&oacute;n de los sistemas operativos de Microsoft
a un nivel artificialmente alto en los entornos corporativos, dadas las
capacidades (o su falta de ellas) de los productos de servidor de Microsoft. Tal
y como es la naturaleza humana, esta mentalidad y cultura es dif&iacute;cil de
eliminar, incluso ante la evidencia de la comparaci&oacute;n sin par (de la cual
ahora existe una gran abundancia).
<br>

El resultado neto para la situaci&oacute;n de una red o para la de la
inform&aacute;tica corporativa es una estratificaci&oacute;n artificial de
sistemas operativos basados en sus capacidades (o la falta de ellas) para
interoperar como un &uacute;nico entorno. Los sistemas operativos Windows han creado una
clase de administradores separada y menos flexibles que emplean sus propios
medios administrativos propietarios y que requieren de una formaci&oacute;n
espec&iacute;fica separada de la del campo de UNIX/Linux. En casi todos los
casos, la cantidad de administradores que se requiere para vigilar un entorno
inform&aacute;tico centrado en productos Microsoft es mucho mayor que el
necesario para un entorno UNIX/Linux equivalente, por muchas razones expuestas en
este art&iacute;culo.
<br>

<br>
<p align="center"><img src="nt_to_unix.png"></p>
<br>

La familia de protocolos TCP/IP, creada y desarrollada en UNIX y administrada por
organismos internacionales de estandarizaci&oacute;n, son habitualmente
reestructurados por Microsoft para complicar la interoperabilidad con otros
sistemas. Como ejemplo, la Corporaci&oacute;n Microsoft se apropi&oacute; de e
hizo extensiones a un protocolo p&uacute;blico de seguridad de red, <i>Kerberos</i>, que
hab&iacute;a sido desarrollado en el MIT y puesto a disposici&oacute;n de toda la
comunidad inform&aacute;tica <i>de forma gratu&iacute;ta</i>. Los
dise&ntilde;adores de Kerberos y otros expertos tienen firmes sospechas de que
las extensiones que Microsoft introdujo en la implementaci&oacute;n de Kerberos
para su Windows 2000 no ten&iacute;an otro prop&oacute;sito concebible que
<i>convertir a los productos de la competencia en incompatibles con las
estaciones de trabajo Microsoft</i>, para impulsar a las empresas a adoptar
servidores Microsoft en lugar de UNIX/Linux. A finales del 2001, los
investigadores de la Uni&oacute;n Europea han dado muestras de su
preocupaci&oacute;n sobre tal comportamiento por parte de Microsoft, dando a
entender que multas gigantescas y otras acciones para obligar a Microsoft a
cambiar de actitud pueden estar cerca. En los EEUU, las dificultades legales de
Microsoft se centran alrededor de la corrupci&oacute;n de los protocolos y
est&aacute;ndares universales, tal y como ocurri&oacute; en la p&eacute;rdida frente a
Sun Microsystems de un juicio relacionado con los cambios que Microsoft
hab&iacute;a realizado al lenguaje y plataforma Java en el software de Windows.
<br>

El sistema de red basado en TCP/IP elegido por Microsoft, <i>CIFS-SMB</i>, es un
protocolo inherentemente ineficiente que significativamente requiere de
m&aacute;s tr&aacute;fico para un prop&oacute;sito determinado que el protocolo
UNIX conocido como NFS (el cual tampoco es un modelo de elegancia). CIFS-SMB es
un "charlat&aacute;n", env&iacute;a enormes cantidades de informaci&oacute;n que
puede ser f&aacute;cilmente capturada por la red. Como Microsoft sabe que el uso
de CIFS-SMB deber&aacute; ser eliminado con el tiempo, ha desarrollado un muy
novedoso sistema de ficheros en red, <i>DFS (sistema de ficheros
distribuido)</i>, que trae reminiscencias de NFS en su uso de "montaje" de
sistemas de ficheros remotos, y sin embargo es tan diferente de la
pr&aacute;ctica establecida que los administradores de Windows han sido muy
reacios a adoptarlo, y, al parecer, Microsoft ha hecho poco por popularizarlo.
Ser&iacute;a muy dif&iacute;cil encontrar un administrador de UNIX/Linux que no
utilice NFS y, aunque las primeras versiones de NFS ten&iacute;an dificultades
en cuanto a su estabilidad, estos problemas han desaparecido en su cambio a la
Versi&oacute;n 3.
<br>

Dado que tanto NFS como CIFS-SMB son los est&aacute;ndares actuales para la
interoperabilidad de los sistemas ficheros entre ordenadores, es importante notar
que los servidores UNIX/Linux pueden operar con ambos protocolos de forma
r&aacute;pida y eficiente, mientras que los servidores Windows habitualmente
pierden en los test de comparaci&oacute;n de servicio NFS al no estar bien
preparados para ello. Utilizando un servicio de <i>c&oacute;digo abierto</i>
(gratuito) llamado <i>Samba</i>, una m&aacute;quina con UNIX/Linux puede aparecer
como un servidor de ficheros con Windows NT, 2000 o XP en el interfaz del
<i>Entorno de Red</i> de los clientes de Microsoft. Debido al excelente
rendimiento de la entrada/salida de datos del sistema UNIX/Linux subyacente, un
servidor Samba habitualmente mejora los resultados de su equivalente Microsoft en
velocidad y fiabilidad (mayor duraci&oacute;n del "uptime" -"tiempo transcurrido
desde el &uacute;ltimo arranque del servicio"-).
<br>

Microsoft emplea CIFS-SMB no s&oacute;lo para los servicios de ficheros sino
tambi&eacute;n para los servicios de impresi&oacute;n y la administraci&oacute;n
centralizada de los nombres de los ordenadores y la autenticaci&oacute;n de
usuarios y recursos entre los servidores Microsoft y las estaciones en un entorno
l&oacute;gico denominado "dominio". Cada dominio requiere de un <i>Controlador
Primario del Dominio</i> (PDC), y para protecci&oacute;n contra fallos de un
<i>Controlador de Respaldo del Dominio</i> (BDC). Dependiendo de la antigÅ¸edad y
el tama&ntilde;o del dominio Windows, puede que tambi&eacute;n sean necesarios
<i>servidores de nombres de Internet de Windows</i> (WINS) primarios y
segundarios (WINS es otro protocolo &uacute;nico de Microsoft que no es necesario en
ning&uacute;n otro entorno inform&aacute;tico). 
<br>

Las &uacute;ltimas versiones de Samba permiten a un servidor UNIX/Linux reemplazar
completamente a un PDC Windows (en realidad un reemplazo con ventajas ya que no
necesita de servicio WINS). Para las peque&ntilde;as organizaciones, la conocida
durabilidad de un servidor UNIX/Linux para soportar las necesidades de
compartici&oacute;n de ficheros y servicios de impresi&oacute;n de un conjunto de
clientes Windows es una alternativa muy llamativa frente a la opci&oacute;n del
servidor Windows, costosa y menos estable. Para las grandes organizaciones, las
principales plataformas UNIX como Sun Solaris y HP-UX ejecutan servidores Samba
especialmente adaptados internamente en el n&uacute;cleo de sus sistemas (en lugar de
ser aplicaciones del nivel de usuario) tanto para dar soporte a una <i>SAN</i>
(Sistema de Almacenamiento en Red) como <i>NAS</i> (Sistema de Ficheros en Red)
para dar soporte a grandes grupos de clientes Windows. Un servidor UNIX/Linux
pude dar soporte simult&aacute;neamente a los clientes Windows v&iacute;a Samba a
la vez que da soporte a los clientes UNIX/Linux v&iacute;a NFS, a los clientes
Macintosh v&iacute;a <i>Netatalk</i> (una alternativa de c&oacute;digo abierto a
Appletalk) y soporte limitado a los clientes de Novell Netware v&iacute;a
<i>MarsNWE</i> (un emulador de Netware de c&oacute;digo abierto).
<br>

Como los administradores de NT pronto descubrieron, el nuevo sistema de
"Directorio Activo" de Windows 2000 era costoso y dif&iacute;cil de aprender,
implantar y administrar. A diferencia de la especificaci&oacute;n abierta del
protocolo ligero de acceso a directorio (LDAP) del cual se deriv&oacute;, el
Directorio Activo de Microsoft contiene extensiones propietarias que s&oacute;lo
permiten la operaci&oacute;n con clientes y servidores de Microsoft. La
adopci&oacute;n por parte de la industria del Directorio Activo ha sido limitada,
estimada por algunos analistas por debajo del 12% de los entornos dedicados
Microsoft hacia mediados de 2001. Dado el papel tan cr&iacute;tico de este
servicio, debe recordarse que debido a la inestabilidad inherente de los
servidores Windows, los servidores de Directorio Activo de respaldo son
obligatorios (elevando el gasto en hardware, software y licencias).
<br>

La reputaci&oacute;n del Directorio Activo se ha nublado por las quejas
referentes a su dificultad de administraci&oacute;n y rendimiento decepcionante.
Algunas implantaciones de importantes distribuidores de hardware ejecutando
Windows 2000 con Directorio Activo han sido incapaces de soportar m&aacute;s de
cinco niveles por debajo del nivel raiz de directorio antes de encontrarse con
p&eacute;rdidas de rendimiento inaceptables. Dado que la intenci&oacute;n de la
estructura del t&iacute;pico servicio de directorio es emular o corresponderse
con la estructura real de la corporaci&oacute;n en la que se instala, cinco
niveles es claramente insuficiente para la mayor&iacute;a de las empresas de
tama&ntilde;o medio. En comparaci&oacute;n, las implantaciones avanzadas de LDAP
del tipo que se encuentra en la arquitectura UNIX/Linux puede soportar muchos
niveles de directorio, y en las instalaciones de superordenadores tipo UNIX
pueden verse cientos de niveles de directorio LDAP.
<br>

Microsoft est&aacute; llevando el sistema de directorio de XP hacia el
Directorio Activo. Para aquellas organizaciones que necesitan mantener servicios
de directorio basados en Microsoft pero prefieren los beneficios de UNIX/Linux
en el lado del servidor, el equipo de Samba ha anunciado que la pr&oacute;xima
Versi&oacute;n 3.0 de Samba ser&aacute; completamente capaz de manejar el
Directorio Activo. Es altamente improbable que tal combinaci&oacute;n de
hardware y software sufra de las limitaciones de rendimiento y seguridad de la
actual oferta de Microsoft.
<br>

<h4>
   <a name="three"></a>
   <font color="#000066">
      El futuro de la plataforma .NET de Microsoft
   </font>
</h4>

Windows XP es el sistema operativo de vanguardia de la iniciativa "<i>.NET</i>"
de Microsoft, que claramente pretende crear un entorno de compartici&oacute;n de
datos y autenticaci&oacute;n en un modelo P2P (persona a persona) para Internet.
La gente de la industria ha venido a denominar esta oferta como "servicios web",
pero luego parece que no pueden precisar lo que &eacute;stos son. Los observadores
ven en .NET un intento de Microsoft de privatizar la Internet o de crear
servicios de pago para ella. Habitualmente se sugiere que la meta corporativa
de Microsoft, ante las menores perspectivas de crecimiento y sostenibilidad
del mercado tradicional del PC, es transformarse de distribuidor de sistemas
operativos y software de aplicaciones en intermediario comercial de servicios
basados en Internet para datos, mensajer&iacute;a, software de aplicaciones y
autenticaci&oacute;n. La iniciativa .NET pretende dar acceso a Microsoft al
enorme conjunto usuarios de equipos de escritorio basados en Windows que
est&aacute;n conectados a Internet, dando a Microsoft con el tiempo una
"porci&oacute;n" de todas las transacciones financieras que se realicen mediante
los servicios .NET.
<br>

El sistema operativo Windows XP contiene incrustadas caracter&iacute;sticas
.NET, de utilizaci&oacute;n a menudo obligatoria, tales como la
autenticaci&oacute;n de usuario por "<i>Passport</i>", que el intento de
Microsoft de implantar en Internet una tecnolog&iacute;a de "registro &uacute;nico"
para que los usuarios no tengan que recordar una multitud de nombres de usuario y
contrase&ntilde;as ni tengan que introducir su informaci&oacute;n personal en los
diferentes sitios web. La informaci&oacute;n personal como las listas de
contactos e incluso el calendario de eventos ser&iacute;a tambi&eacute;n almacenada en
el sistema Passport, haciendo que esta tecnolog&iacute;a tendr&aacute; que
depender de un potencialmente colosal almacen de datos privados. En muchas
ocasiones, se implorar&aacute; a los usuarios que se registren para la
pertenencia a Passport y (si Microsoft lo consigue) encontrar&aacute;n que el
acceso a muchas caracter&iacute;sticas populares de Internet no ser&aacute;
posible sin ella. Esta influencia externa del mercado deber&iacute;a ser
considerada como una amenaza no deseable a la seguridad y la privacidad hacia un
entorno inform&aacute;tico sin controles externos. La informaci&oacute;n
sensible y particualr de los usuarios, as&iacute; como los datos corporativos
podr&iacute;an de esa manera encontrar su camino fuera del control de la red
local.
<br>

Incluso si la iniciativa .NET de Microsoft no satura la industria
inform&aacute;tica ganando popularidad en el entorno corporativo, el esquema
promovido por Sun Microsystems "Proyecto Libertad" compite directamente con &eacute;l,
la pr&oacute;xima familia de componentes .NET "<i>Hailstorm</i>" (renombrado como
"Mis Servicios .NET") est&aacute; claramente siendo dise&ntilde;ado para operar
principalmente y de forma &oacute;ptima s&oacute;lo sobre sistemas operativos de
Microsoft, de forma que de nuevo los planes de Microsoft parecen enfrentados a
los entornos de otros sistemas operativos. De nuevo se invoca ostensiblemente a
cuestiones como la aplicabilidad multiplataforma, aunque la propia publicidad
t&eacute;cnica de Microsoft as&iacute; como las entregas del software en desarrollo
contradice las promesas.
<br>

Semejante repositorio de datos privados de los usuarios como el que planea dar
soporte .NET ser&iacute;a un premio muy lucrativo para los intrusos y los
esp&iacute;as industriales. Las implicaciones para la seguridad y la privacidad
de confiar la mensajer&iacute;a b&aacute;sica, la autenticaci&oacute;n, las
operaciones financieras y los datos a los sistemas basados en Internet
controlados por Microsoft como .NET, Passport y Hailstrom son serios en extremo,
tal y como se discute en la secci&oacute;n de Seguridad m&aacute;s adelante
en este art&iacute;culo. De hecho, la prueba conceptual de un vir&uacute;s .NET
llamado W32.DONUT fue escrita con &eacute;xito en enero de 2002, y fue capaz de
infectar instant&aacute;neamente ficheros clave del <i>Lenguaje Intermedio de
Microsoft para .NET</i>, que son la base de la intercomunicaci&oacute;n entre
ordenadores basados en .NET. Presumiblemente (&iquest;u obviamente?) los virus
"<i>reales</i>" est&aacute;n por llegar.
<br>

<h4>
   <a name="four"></a>
   <font color="#000066">
      Platform and Software Inter-Operability
   </font>
</h4>

Los promotores de TI sensatos saben que los entornos de un &uacute;nico fabricante son
mucho menos deseables que los combinados. Un argumento que utilizan el
departamento de ventas de Microsoft es que qued&aacute;ndose en un sistema en el que
todo es Microsoft, la interoperabilidad y la facilidad de uso est&aacute;n garantizadas.
Esto es un claro error. Microsoft pretende asegurarse de que s&oacute;lo se utilizan sus
productos tomando medidas internas al software para cerrar la puerta a las
ofertas de sus competidores, pero por eso mismo no pueden garantizar a sus
clientes que los componentes "mejores de su clase" son en realidad escogidos.
<br>

El dise&ntilde;o celular de los paquetes de software de Microsoft (debido al hecho de
que a lo largo de los a&ntilde;os Microsoft ha comprado casi todas sus principales
aplicaciones de software a otros grupos) casi garantiza que necesitar&aacute;
personal adicional que se especialice en su administraci&oacute;n. Las interfaces
y los procedimientos son muy diferentes. Por dar un ejemplo real, las
aplicaciones como Exchange, IIS y SQL Server comparten un entorno de aplicaciones
que se ejecutan en servidores Microsoft NT, 2000 y XP. As&iacute;, las vulnerabilidades
de dichos sistemas operativos ponen en peligro a todas ellas a la vez. Como
se ilustra en la secci&oacute;n de seguridad m&aacute;s abajo, varias ocurrencias de este
punto ya han ocurrido en los entornos de servidores Microsoft.
<br>

La aproximaci&oacute;n de UNIX/Linux hacen que las versiones, el hardware y la
capacidad de los entornos inform&aacute;ticos deban ser contrastadas a cada situaci&oacute;n.
Es com&uacute;n encontrar sistemas corporativos que emplean diferentes versiones
de UNIX/Linux a la vez. Un ejemplo real, un entorno inform&aacute;tico empresarial
puede consistir en un servidor Lotus Domino sobre un HP-UX, una base de datos
Oracle sobre un True64, mientras que a su lado el servidor web ejecuta Apache
sobre Linux, un servidor de comercio electr&oacute;nico est&aacute; sobre Solaris y todo el
sistema hace sus copias de seguridad utilizando Veritas en un AIX. Dado que
todos ellos utilizan los comandos est&aacute;ndar y protocolos de UNIX/Linux, las
tareas de automatizaci&oacute;n y programas de administraci&oacute;n se ejecutan f&aacute;cilmente
en todos ellos (a menudo de manera remota) con una adaptaci&oacute;n de las 
herramientas o entrenamiento del personal m&iacute;nimo o nulo. Aunque un entorno tan
diverso puede tener sus inconvenientes (la confusi&oacute;n de conseguir el soporte
de tantos distribuidores, etc.) el responsable de TI podr&iacute;a encontrar que
ese entorno competitivo supone una ventaja presupuestaria y de segurida.
<br>

Entre los sistemas operativos para servidores, UNIX/Linux es excepcionalmente
capaz de soportar el software de otros sistemas operativos y clientes de red.
Las opciones que da Microsoft en Windows NT, 2000 y XP para soportar UNIX/Linux
u otros sistemas operativos cliente son m&iacute;nimas en comparaci&oacute;n. Aunque tanto
UNIX/Linux como Windows pueden emular los servicios de Netware y Appletalk,
el sistema operativo subyacente supone una gran diferencia para la velocidad y
estabilidad del servidor, y UNIX/Linux prevalece.
<br>

<h4>
   <a name="five"></a>
   <font color="#000066">
      Rendimieto
   </font>
</h4>

Las comparaciones entre sistemas con hardware equivalente muestran que UNIX/Linux
es m&aacute;s estable, requiere menos administraci&oacute;n y es m&aacute;s r&aacute;pido en las operaciones
de entrada salida al disco que Microsoft Windows NT y Windows 2000, incluso
aunque est&eacute; &uacute;ltimo disfruta de las &uacute;ltimas mejoras del sistema de archivos
Microsoft <i>NTFS</i>. La evidencia de una refutaci&oacute;n cre&iacute;ble de esta afirmaci&oacute;n
no se encuentra, ni en la web ni en el boca a boca entre la gente de la
industria. Microsoft ha prohibido a la mayor&iacute;a de las publicaciones del mundo de
la inform&aacute;tica que den tales comparativas. En verdad, s&oacute;lo los tests de
de rendimiento m&aacute;s pomposos y obtusos pueden hacer que NT o 2000 muestren una
superioridad particular sobre una m&aacute;quina UNIX/Linux con una especificaci&oacute;n
equivalente de hardware.
<br>

La evidencia del mundo real corporativo ha demostrado de forma concluyente que
las m&aacute;quinas UNIX/Linux operan durante meses, si no a&ntilde;os, sin necesidad de
rearrancar y que las ca&iacute;das son raras. Esto no es as&iacute; para Windows NT, que es
susceptible de un desastre por razones inexplicables incluso despu&eacute;s de haber
aplicado todos los Service Packs disponibles. En cualquier sitio y en cualquier
momento, se recomienda que Microsoft Windows NT sea abandonado. La evidencia
muestra que Windows 2000 puede ser cuantitativamente m&aacute;s estable que NT, pero
sigue sin estar en la misma liga que UNIX/Linux. Windows 2000 tambi&eacute;n ofrece
monitorizaci&oacute;n mejorada de fallos y mejores herramientas de recuperaci&oacute;n que
su predecesor. Microsoft promete que XP ofrecer&aacute; m&aacute;s estabilidad en su n&uacute;cleo.
<br>

Con un coste mucho mayor, la naturaleza menos fiable de los sistemas operativos
de Microsoft pueden ser abordados "agrup&aacute;ndolos" (<i>clustering</i>) para
conseguir la <i>Alta Disponibilidad (HD)</i>, que introduce un nivel de
complejidad que est&aacute; m&aacute;s all&aacute; de la mayor&iacute;a de los administradores formados en
Windows. Microsoft <i>Datacenter</i> es un producto en cluster disponible
s&oacute;lo atrav&eacute;s de ciertos distribuidores certificados por Microsoft. Bas&aacute;ndose
en las aplicaciones que son utilizadas en el entorno local, se crea
espec&iacute;ficamente para cada sitio una soluci&oacute;n personalizada de Windows 2000. De
esa forma cada implantaci&oacute;n es diferente y la creaci&oacute;n del sistema muy amenudo
implica consultas al distribuidor, a los ingenieros del fabricante o los
fabricantes del hardware y Microsoft. La soluci&oacute;n que resulta de ello se graba
definitivamente en un CD y es transportada al cliente para que sea instalada.
Para los promotores de TI, es inevitable perder un cierto control puesto que a
los administradores locales no se les permite hacer ning&uacute;n cambio, aunque
podr&iacute;a argumentarse que esta es una petici&oacute;n l&oacute;gica puesto que el acuerdo de
Datacenter amenudo garantiza una fiabilidad del 99.999%.
<br>

Puesto que no se permite hacer cambios, como Service Packs o parches de
seguridad, a una implantaci&oacute;n de Microsoft Datacenter una vez entregado, se
producen problematicas deficiencias en la dependencia de una organizaci&oacute;n
externa para semejantes actualizaciones cr&iacute;ticas, como se discute m&aacute;s adelante
con relaci&oacute;n a la seguridad. Adem&aacute;s, el distribuidor requiere acceso 24 horas
al d&iacute;a para monitorizar el sistema Datacenter, as&iacute; que la red local debe
proporcionar acceso remoto a una organizaci&oacute;n externa, lo que introduce cuestiones
de seguridad de la red.
<br>

Poner m&aacute;quinas UNIX/Linux en cluster de HD es rutinario, aunque hay una categor&iacute;a
m&aacute;s de la cual los sistemas operativos Microsoft est&aacute;n notablemente ausentes:
<i>Clustering de Alto Rendimiento (HPC)</i>. Las capacidades de HA y HPC est&aacute;n
disponibles en los principales distribuidores UNIX/Linux a alto coste,
configuradas por individuos especialmente formados en entornos de misi&oacute;n cr&iacute;tica
como el de desarrollo cient&iacute;fico, el de comercio electr&oacute;nico y el financiero. En
los &uacute;ltimos a&ntilde;os, una alternativa viable de bajo coste para HPC basada en Linux
ha aparecido. Cuando se agrupan en configuraciones HA o HPC, Linux proporciona
una plataforma comparativamente de bajo coste (pero con resultados de alta
productividad) para prop&oacute;sitos como la recuperaci&oacute;n del servicio web con Apache
o como el desarrollo cient&iacute;fico de aplicaciones velocidad ultraalta utilizando
el software de c&oacute;digo abierto <i>Beowulf</i>.  En realidad, muchas organizaciones
acad&eacute;micas, cient&iacute;ficas y militares (como los laboratorios del ej&eacute;rcito
norteamericano de Sandia y Livermore) han implantado clusters basados en Linux y
Beowulf. Algunas universidades han descubierto los beneficios de la
supercomputaci&oacute;n a precio de saldo creando clusters basados en Linux y Beowulf
con montones de PCs comunes usados (por supuesto ampliados con dispositivos
de red especialmente adecuados).
<br>

Para ser realistas, la mayor&iacute;a de las aplicaciones del software comercial no
necesitan la clase de beneficios que ofrecen los superordenadores, pero es muy
ilustrativo ver c&uacute;an facilmente UNIX/Linux puede adaptarse a este y muchos otros
roles mientras los sistemas operativos de Microsoft s&iacute;mplemente no pueden. Debe
notarse que, al igual que con Microsoft Datacenter, los sistemas UNIX/Linux de
HA y HPC de gama alta son generalmente gestionados por organizaciones externas
con acuerdos muy limitados de administraci&oacute;n local, aunque la documentaci&oacute;n
y el software para crear un cluster Linux/Beowulf est&aacute; <i>libremente
disponible</i> en la comunidad de c&oacute;digo abierto.
<br>

Para los entornos medianos a peque&ntilde;os que no requieren rendimiento HA o HPC,
los sistemas operativos no son tan fiables como los UNIX/Linux. La inmensa
mayor&iacute;a de los fallos ocurridos en los sistemas operativos Windows son causados
por problemas en el software. Puesto que los servidores UNIX/Linux son mucho
menos proclives a crear dificultades basadas en el software, las preocupaciones
que quedan sobre la fiabilidad debe dirigirse al hardware utilizado.
Hist&oacute;ricamente esos fallos son pocos, en realidad microsc&oacute;picos en n&uacute;mero
en comparaci&oacute;n con los fallos de los sistemas operativos Windows. As&iacute;, mientras
que el mundo basado en Windows se enfrenta a la inestabilidad del sistema
opeativo agrupando unos cuantos servidores hardware para protegerse frente
a un fallo, un s&oacute;lo servidor UNIX/Linux con hardware redundante puede reemplazar
habitualmente a un cluster de servidores Windows sin p&eacute;rdida apreciable de
disponibilidad. Las historias de enormes cantidades de servidores Windows que
son reemplazados por uno o unos pocos servidores UNIX/Linux son cada vez m&aacute;s
frecuentes en el mundo actual de la TI.
<br>

La menor disponibilidad de las m&aacute;quinas con Windows NT y Windows 2000 puede
ser cara en dinero, pero tambi&eacute;n lo es en productividad. Los cambios a la
configuraci&oacute;n de una m&aacute;quina NT realizados por un administrador cualificado
a menudo requieren rearrancar completamente la m&aacute;quina, incluso para alteraciones
que en el mundo UNIX/Linux ser&iacute;an consideradas de rutina y trivales en una
m&aacute;quina en funcionamiento permantente. Windows 2000 ha reducido
significativamente la cantidad de rearraques necesarios, aunque todav&iacute;a se
necesita rearrancar con mucha mayor frecuencia que en UNIX/Linux. La
disponibilidad de las aplicaciones en los sistemas operativos Windows es por
ello menos robusta que en UNIX/Linux.
<br>

Los compradores potenciales de Windows XP deben ser conscientes de que la
respuesta a la pregunta de si una organizaci&oacute;n puede confiar en la nueva
versi&oacute;n no se puede responder con seguridad, especialmente en lo que
concierne a la inform&aacute;tica financiera o al comercio electr&oacute;nico. A diferencia
de UNIX/Linux, no se pueden encontrar evidencias significativas de la estabilidad
del n&uacute;cleo de Windows XP (los datos para UNIX/Linux son sobradamente conocidos).
Rearrancar una m&aacute;quina para corregir problemas, una t&eacute;cnica com&uacute;n de la
administraci&oacute;n de un sistema Microsoft, es contraproductiva y costosa. Los
promotores de TI m&aacute;s arriesgados pueden encontrar la adopci&oacute;n de XP estimulante.
<br>


UNIX/Linux es modular por naturaleza, adapt&aacute;ndose a las condiciones cambiantes
con aplomo. Unos de los comandos favoritos de un administrador UNIX/Linux es
<i>uptime</i>, que visualiza el tiempo transcurrido desde la &uacute;ltima vez que
se rearranc&oacute; el sistema. A diferencia de los per&iacute;odos t&iacute;picos de d&iacute;as para
Windows NT o una o dos semanas para Windows 2000, el per&iacute;odo de servicio habitual
en UNIX/Linux se mide en meses, si no a&ntilde;os. Indudablemente algunos
administradores de Windows obtienen tiempos de servicio continuo por encima de la
media con diligente cuidado y atenci&oacute;n, pero por lo general dichas m&aacute;quinas no
est&aacute;n cargadas de trabajo.
<br>

Otro aspecto que disminuye el tiempo de servicio en los servidores Windows es la
necesidad de rearrancar la m&aacute;quina como parte de la rutina de las actividades de
actualizaci&oacute;n de antivirus, lo que quiere decir que incluso si los sistemas no
se ha vuelto inestables siguen necesitando de tiempo de parada del servicio. Como
se decribe m&aacute;s adelante, las m&aacute;quinas UNIX/Linux no son susceptibles de esas
dificultades con los virus. Debido a la durabilidad y los largos per&iacute;odos de
servicio sin interrupci&oacute;n, tareas como el comercio electr&oacute;nico y las
manipulaciones cr&iacute;ticas de datos son mejor servidas por UNIX/Linux que por
Microsoft Windows NT, 2000 o XP.
<br>

El superior rendimiento y capacidades multitarea de UNIX/Linux implica que se
puede reducir la cantidad de servidores cuando se realiza la conversi&oacute;n desde
Microsoft Windows o 2000. Sirva aqu&iacute; una analog&iacute;a, <i>tirar de un carro siempre
es mejor cuando se hace con un caballo que con doscientos pollos</i>. Menos
m&aacute;quinas implica mayor eficiencia, menos electricidad y conseguir antes la
integraci&oacute;n de nuevas aplicaciones. Como se describre m&aacute;s adelante, las grandes
corporaciones de TI est&aacute;n encontrando en esto una verdad absoluta.
<br>

<h4>
   <a name="six"></a>
   <font color="#000066">
      Cuestiones relacionadas con el hardware
   </font>
</h4>

Linux y ciertas variedades de UNIX (FreeBSD, NetBSD, OpenBSD, SCO, Solarix-x86,
etc.) operan de forma &aacute;gil y eficiente sobre hardware de tipos Intel (x86) que
ha sido definido por Microsoft como "<i>obsoleto</i>" para muchas de sus
versiones de NT 4.0 (Internet Information Server, Back Office Server y otras
ediciones de servidores "empresariales") as&iacute; como para todas las versiones de
Windows 2000 y ofrecen una funcionalidad igual o similar a los productos de
Microsoft. La mayor duraci&oacute;n de la vida &uacute;til de una m&aacute;quina que se obtiene con
los sistemas operativos UNIX/Linux implica que los costes de capital asociados
al hardware se pueden amortizar durante m&aacute;s tiempo, mientras que los costes
asociados a la migraci&oacute;n desde NT y 2000 son m&iacute;nimos o nulos. Durante a&ntilde;os, se
ha echado la culpa de la falta de estabilidad de los sistemas operativos Windows
a la plataforma hardware Intel x86 en vez de al verdadero culpable: el propio
sistema operativo Windows. Como ha sido demostrado por las alternativas Linux
y UNIX, no hay que dudar de la capacidad de los fabricantes de sistemas Intel
y AMD, <i>no hay nada incorrecto en esos equipos que un sistema operativo
decente no pueda curar</i>.
<br>

Como fue el caso con Windows 2000, aquellos que pretendan actualizarse a
Microsoft Windows XP deben estar preparados para el coste del hardware adicional
que &eacute;sta versi&oacute;n demandar&aacute;. Dado que los sistemas operativos de Microsoft
normalmente tienen menor rendimiento cuando son comparados con UNIX/Linux sobre
el mismo hardware, la estrategia t&eacute;cnica de Microsoft ha sido obtener mayor
rendimiento mediante hardware m&aacute;s potente. Aunque este punto ha ayudado
a los vendedores de hardware a lo largo de la historia, la sensatez de las
consideraciones presupuestarias de los departamentos de TI no han recibido
por parte de Microsoft esa misma consideraci&oacute;n.
<br>

Fue necesario hacer costosas actualizaciones de RAM y CPU para pasar a Windows
2000, lo que implic&oacute; que fueron necesarias nuevas m&aacute;quinas m&aacute;s r&aacute;pidas para
reemplazar a las m&aacute;quinas adecuadamente operativas que ya estaban en uso. Una
vez m&aacute;s Microsoft demanda de los ya estirados presupuestos de TI que los
actuales inventarios de las m&aacute;quinas que ahora ofrecen un rendimiento aceptable
(para Windows) se conviertan en <i>in&uacute;tiles</i> para Microsoft Windows XP.
<br>

Esta "<i>obsolescencia forzada del hardware</i>" implica que muchas de las
tarjetas de interfaz hardware m&aacute;s comunes hoy en d&iacute;a (controladoras de red,
disco, video, audio) no sean soportadas por el nuevos sistema operativo. A menos
que los drivers sean proporcionados por los propios fabricantes de las
tarjetas, muchos PCs que se hab&iacute;an comprado con anterioridad no ser&aacute;n
configurables en Windows XP, de la misma manera que muchos fuero abandonados
por Windows 2000. Una encuesta r&aacute;pida a los sitios web es suficiente para ver que
pocos juegos de drivers compatibles con XP han sido remitidos a Microsoft para
su "firma" (reconicimiento oficial de que el driver de verdad opera de forma
satisfactoria).
<br>

Es un hecho que en comparaci&oacute;n con los sistemas operativos de Microsoft, Linux y
otras versiones de UNIX basadas en la plataforma x86 han tenido habitualmente
menos para las nuevas interfaces de hardware, dado que los fabricantes siempre
han dado prioridad a la escritura de drivers para los sistemas operativos
dominantes de Microsoft. Sin embargo, esto casi nunca ha sido una deficiencia
dado que esos sistemas operativos ofrecen un rendimiento y capacidades hoy, con
el hardware actual, que Microsoft s&oacute;lo intenta obtener con los equipos m&aacute;s
modernos y m&aacute;s caros. Adem&aacute;s, deber&iacute;a notarse que, en los &uacute;ltimos a&ntilde;os, la
industria del hardware basado en x86, como se ejemplifica en la actividad de
compa&ntilde;&iacute;as como Creative Labs, Adaptec, 3Com y muchas otras, r&aacute;pidamente se ha
movilizado para ofrecer soporte Linux para sus productos m&aacute;s novedosos. Para la
mayor&iacute;a de estas compa&ntilde;&iacute;as, el soporte Linux para sus productos antigÅ¸os y
actuales es ahora un hecho.
<br>

Las organizaciones que operan en servidores y estaciones de trabajo Alpha de
Compaq (antes DEC) con Windows NT se quedaron at&oacute;nitos cuando Compaq y Microsoft
descontinuaron de manera abrupta el desarrollo de Microsoft Windows NT 4.0 para
esa plataforma. Sobre todo porque cuando se quer&iacute;a demostrar la "escalabilidad"
de Windows NT 4.0 sobre varias CPUs, Microsoft siempre hab&iacute;a recurrido a su
versi&oacute;n para Alpha. Afortunadamente, los propietarios de un Alpha encontraron
que la versi&oacute;n de Linux para Alpha es completamente funcional en esas mismas
m&aacute;quinas. Aunque, por supuesto, que la conversi&oacute;n al propio UNIX True64 de
Compaq es tambi&eacute;n una opci&oacute;n muy atractiva.
<br>

Posteriormente, <i>Microsoft Windows 2000 y XP operan s&oacute;lo en la plataforma x86
de Intel</i>. El escenario hardware de Alpha era el paradigma de la potencia que
Microsoft tra&iacute;a a las organizaciones de TI. La fusi&oacute;n entre HP y Compaq a finales
del 2001 y la reducci&oacute;n resultante en el campo de los fabricantes de hardwar
 para servidores b&aacute;sicamente a tres entidades principales (las otras dos son Dell
e IBM) sirve para ilustrar el hecho de que los promotores de TI que desean
mantener su propio criterio en cuanto a la elecci&oacute;n de qu&eacute; software y hardware
deben escoger deber&iacute;an alejarse de la naturaleza "cerrada" de un entorno s&oacute;lo
Microsoft.
<br>

Por eso, mientras que Microsoft Windows NT, 2000 y XP <i>s&oacute;lo</i> operan en la
arquitectura x86 (Intel &amp; cl&oacute;nicos), Linux est&aacute; disponible a coste nulo para
x86 y tambi&eacute;n para Sparc, UltraSparc, PowerPC, Alpha, iMac, PA-RISC, y muchas
otras plataformas hardware. La apariencia de Linux en esa cantidad de
arquitecturas tan dispares es extraordinariamente semejante con independencia de
la plataforma hardware. Para las organizaciones que utilizan diferentes
plataformas, Linux es un aut&eacute;ntico beneficio.
<br>

IBM ha portado (adaptado) Linux a su familia m&aacute;s potente de ordenadores mainframe
permitiendo que Linux opere en configuraciones ya sean <i>lado a lado</i>
(montones de sistemas operativos Linux ejecutando directamente sobre una m&aacute;quina
f&iacute;sica) o <i>virtuales</i> (un sistema Linux ejecutando en una m&aacute;quina virtual en
memoria soportada por otro sistema operativo). IBM ha convertido su "gran hierro"
(las series <i>z</i> de mainframe, las series <i>i</i> de servidores
departamentales y las series <i>p</i> de tipo AIX) para operar con las versiones
de 64 bits de Linux de Red Hat y Suse.
<br>

A finales de 2001 este escenario de Linux en el mainframe fue adoptado por la
compa&ntilde;&iacute;a de telecomunicaciones finlandesa Sonera, que provee el acceso Internet
de alta velocidad a 500.000 usuarios privados y 70.000 subscriptores
corporativos. Utilizando un &uacute;nico mainframe de IBM, Sonera fue capaz de
reemplazar 60 servidores diferentes basados en Unix y Windows NT. La clave para
el &eacute;xito est&aacute; en la ejecuci&oacute;n en el mainframe de 500 servidores virtuales
ejecutando un Linux de Red Hat y SuSE. Este ejemplo no es el &uacute;nico, ya que IBM
ha convencido a otros grandes jugadores del entorno corporativo para que
utilicen Linux, incluyendo entre estos a la compa&ntilde;&iacute;a petrol&iacute;fera angloholandesa
Roya Dutch/Shell, el Banco Mercantil de Venezuela y la compa&ntilde;&iacute;a de
telecomunicaciones sueca Telia. En todos los casos, la mayor&iacute;a de, sino todos,
sus servidores Windows fueron reemplazados o abandonados.
<br>


IBM no est&aacute; sola en su elevaci&oacute;n de Linux a los niveles m&aacute;s altos de la
inform&aacute;tica corporativa. Las corporaciones Intel y Hewlett Packard hicieron de
Linux uno de los primeros sistemas operativos disponibles para la CPU basada
en el chip de 64 bits <i>Itanium</i>. Contribuyendo con recursos destinados al
esfuerzo Linux-Itanium se encuentran organizaciones como Caldera, el CERN, IBM,
Red Hat, SGI, SuSE, TurboLinux y VA Linux Systems. Asimismo, IBM, Hewlett
Packard y SGI ofrecen paquetes de desarrollo software para Linux sobre Itanium
y se est&aacute;n preparando las versiones compatibles del compilador de GNU "gcc" y
las "binutils". En este punto, Intel, IBM, HP, Red Hat y SGI se unieron en una
cumbre en junio de 2001 para trabajar sobre la mejora de gcc para Itanium.
Es tremendamente significativo que Itanium no es una extensi&oacute;n de la plataforma
de 32 bits de x86 y tampoco est&aacute; basada en la tecnolog&iacute;a RISC (como era el caso
del hardware t&iacute;pico para UNIX en la d&eacute;cada de los 90) sino que es una nueva
s&iacute;ntesis de experiencia obtenida en la nueva arquitectura del nuevo procesador
EPIC de Itanium que ha includio a la comunidad del c&oacute;digo abierto de una forma
tan fundamental.
<br>

En el horizonte inmediato est&aacute; la pr&oacute;xima CPU <i>Hammer</i> de 64 bits de AMD,
que difiere de la aproximaci&oacute;n EPIC de Itanium porque hace extensiones a la
plataforma x86 de 32 bits. Esto implicar&aacute; recodificar el sistema operativo
espec&iacute;ficamente para la nueva plataforma - algo en lo que Linux destaca.
Los portavoces de Microsoft han indicado que su foco de atenci&oacute;n est&aacute; puesto
en Itanium para 64 bits y que la oferta de sistemas operativos Windows sobre
Hammer no es por eso una prioridad. Adem&aacute;s, Sun Microsystems se est&aacute; moviendo
aparentemente para ofrecer CPUs basadas en el Hammer de AMD en una nueva
familia de servidores de peque&ntilde;o tama&ntilde;o basados en uno o dos procesadores x86
que ejecutar&aacute;n la pr&oacute;xima distribuci&oacute;n de Linux que va a sacar el propio Sun.
<br>

Puesto que Linux ya ha estado siendo ejecutado en un modo de 64 bits durante
a&ntilde;os, esencialmente todas sus aplicaciones estar&aacute;n disponibles para Itanium y
Hammer en seguida, y Hewlett Packard est&aacute; anunciando su propia versi&oacute;n especial
de alta seguridad de Linux sobre Itanium. Microsoft planea tener una versi&oacute;n de
64 bits de Windows 2000 basada en Itanium en el 2002, aunque los analistas
predicen que menos de cinco aplicaciones (probablemente sus propios productos:
Exchange, IIS, SQL Server, etc.) ser&aacute;n aceptadas por Microsoft como compatibles.
Con la letan&iacute;a de problemas de seguridad que esas aplicaciones de Microsoft han
mostrado en el pasado, esto no es muy prometedor.
<br>

<h4>
   <a name="seven"></a>
   <font color="#000066">
      Administraci&oacute;n de sistemas
   </font>
</h4>

En casi todos los casos, excepto con licencias adicionales y mayor precio,
no es posible hacer telnet <i>(conectar desde una m&aacute;quina remota mediante un
interfaz independiente de la plataforma para realizar tareas en local)</i>
en un servidor o estaci&oacute;n de trabajo NT. Esa administraci&oacute;n remota es
<i>rutinaria</i> en UNIX/Linux, lo que implica que tales servidores se pueden
tener <i>descabezado</i> (sin monitor, ni teclado, ni rat&oacute;n, etc.) y sin una
<i>IGU</i> (interfaz gr&aacute;fica de usuario) de forma que se pueda dedicar la mayor
energ&iacute;a posible a las tareas espec&iacute;ficas que se tiene entre manos. Windows 2000
y XP ir&oacute;nicamente abordaron el tema del <i>telnet</i> (hasta cierto punto) al
mismo tiempo que la mayor&iacute;a de los administradores UNIX/Linux adoptaban los
terminales SSH y OpenSSH que son much&iacute;simo m&aacute;s seguros.
<br>

M&aacute;s problem&aacute;tico, Microsoft nunca ha abordado el tema de que los servidores
Windows NT, 2000 y XP no pueden ser operados en modo <i>descabezado</i>. Dichos
sistemas operativos requieren el contacto directo humano y tienen siempre que
disponber de un monitor y un teclado para poder administrarlos. La &uacute;nica soluci&oacute;n
de Microsoft es su software Windows Terminal Server que tiene un coste adicional
y que tambi&eacute;n requiere una m&aacute;quina adicional. As&iacute; que para llegar a tener una
funcionalidad parecida a la de UNIX/Linux, se deben comprar hardware, software y
licencias adicionales.
<br>

Adem&aacute;s, los sistemas operativos Windows deben dedicar constantemente energ&iacute;a y
espacio en memoria a mantener operativos sus IGUs. Debido quiz&aacute;s a su experiencia
como compa&ntilde;&iacute;a dirigida por el marketing y preocupada por la respuesta del usuario
final a sus IGUs, Microsoft parece haber haber impulsado alegremente la
disposici&oacute;n en Windows NT, 2000 y, muy especialmente en XP, de un escritorio
lleno de colorido y musicalment atractivo.
<br>

Una m&aacute;quina UNIX/Linux s&oacute;lo requiere de una conexi&oacute;n de red o por puerto serie
y no necesita IGU para ser completamente funcional. Los servidores de Microsoft
se pueden en verdad conectar con coste adicional de compra de licencias a
dispositivos hardware para proporcional una operativa <i>claramente
descabezada</i>, pero el problema de la IGU no puede ser evitado.
<br>

Las interfaces administrativas finales han sido modificadas entre Windows NT y
2000, y de nuevo en cierta medida con XP y sin embargo siguen si ser tan
intuitivas o eficientes como la administraci&oacute;n autom&aacute;tica y completa que es
posible cuando se utilizan programas interpretados que es un paradigma esencial
de UNIX/Linux.
<br>

Aunque lo atractivo de un entorno gr&aacute;fico para el usuario final de una estaci&oacute;n
de trabajo es de consideraci&oacute;n indudable para algunos, generalmente no es una
cualidad deseada cuando se realiza el ajuste de rendimiento de una m&aacute;quina de
tipo servidor. Las versiones de UNIX/Linux son de verdad completamente capaces de
proporcionar un entorno de IGU, pero un administrador de sistemas con experiencia
aprecia la opci&oacute;n de librarse de semejante drenador de rendimiento y optar por
el entorno potente de linea de comando de UNIX/Linux. Separar Windows NT de su
entorno IGU es una tarea m&aacute;s all&aacute; de la mayor&iacute;a de los individuos formados en
Microsoft, y es imposible con Windows 2000 y XP.
<br>

<h4>
   <a name="eight"></a>
   <font color="#000066">
      Automatizaci&oacute;n
   </font>
</h4>

Los administradores UNIX/Linux se han beneficiado durante mucho tiempo de un
entorno de programaci&oacute;n altamente robusto y capaz que se encuentra en el propio
sistema operativo. <i>Los guiones del int&eacute;rprete de comandos</i> han permitido
al administrador automatizar enormemente los procesos del sistema y la
programaci&oacute;n de los mismos a la vez que se aseguraba la continuidad de los
procedimientos, la recuperaci&oacute;n fiable ante desastres y la facilidad de la
administraci&oacute;n remota. Los administradores Microsoft han tenido que conformarse
con <i>ficheros por lotes</i>, que comparativamente son remanentes primitivos de
los d&iacute;as en que Microsoft era la compa&ntilde;&iacute;a del DOS. Indudablemente, aunque algunos
autores han creado soluciones muy inteligentes en este entorno, los ficheros
por lotes de DOS son incomparablemente peores que las capacidades de los guiones
de los int&eacute;rpretes de comandos de UNIX/Linux.
<br>

Incluso aunque se piensa que Microsoft ha buscado m&aacute;s compatibilidad con los
protocolos universales de red en Windows 2000 que en versiones previas, ese
sistema operativo tiene m&eacute;todos altamente propietarios basados en su IGU (que
implican el uso de la pantalla, el teclado y el rat&oacute;n) que le hacen incapaz de
compartir los guiones de automatizaci&oacute;n m&aacute;s rutinarios y los procedimientos de
la misma menra que todas las versiones de UNIX y Linux hacen. XP no es diferente.
<br>

Microsoft adopt&oacute; <i>VBScript</i> una ramificaci&oacute;n del <i>JavaScript</i> de la
Corporaci&oacute;n Netscape, como el medio para conseguir capacidades parecidas a las
de los guiones UNIX/Linux. Adem&aacute;s, VBScript ha demostrado ser una fuente
de problemas importantes de seguridad, puesto que su posici&oacute;n inherente ante
la seguridad es la de "<i>permisividad</i>", que es lo mismo que decir que la
mayor&iacute;a o todas sus subrutinas se consideran "<i>fiables</i>" a menos que
sea configurado de otro modo. Esto es justamente lo opuesto al paradigma de
seguridad de UNIX/Linux, en el que la postura por defecto es "<i>denegar</i>"
hasta que se reconfigure de otro modo. La utilizaci&oacute;n del modelo de seguridad
d&eacute;bil del VBScript de Microsoft es lo que aparentemente ha facilitado que el
c&oacute;digo con malas intenciones pueda da&ntilde;ar los recursos del sistema operativo
Microsoft tal y como se ha visto en una letan&iacute;a de asaltos v&iacute;ricos de alcance
mundial.
<br>

Casi todas las rutinas de administraci&oacute;n de sistemas desarrolladas pra una
m&aacute;quina UNX pueden ser ejecutadas instant&aacute;nemente en una m&aacute;quina Linux con
adaptaciones m&iacute;nimas. Estas rutinas no funcionan en las plataformas Microsoft.
As&iacute;, los entornos operativos mixtos siguen necesitando que los administradores
creen un conjunto de "guiones" universales y un segundo conjunto de ficheros
por lotes y procedimientos basados en VBScript interactivos (no automatizados)
"s&oacute;lo para Microsoft". Como paradigma de la industria o con relacion a la
eficacia en su papel, VBScript no ha cumplido su parte y su adopci&oacute;n ha sido
baja.
<br>

Para administradores experimentados de entornos multiplataforma de TI, el
software de c&oacute;digo abierto ha ayudado enormemente a reducir el salto. Quiz&aacute;s
el lenguaje m&aacute;s adecuado y popular para la adminsitraci&oacute;n de sistemas
multiplataforma sea <i>Perl</i>, el "Lenguaje Pr&aacute;ctico de Extracci&oacute;n e
Informes" creado por Larry Wall y ofrecido de forma gratu&iacute;ta. Perl no es
un reci&oacute;n llegado; ha estado disponible durante muchos a&ntilde;os para los sistemas
operativos UNIX y Linux, y ha sido portado a la plataforma Windows. Ser&iacute;a dif&iacute;cil
encontrar un lenguaje inform&aacute;tico que halla sido tan extensible, flexible y
seguro como Perl. Inevitablemente la popularidad de Perl cal&oacute; en el mundo de
Windows, y as&iacute; una gran parte de la administraci&oacute;n desde otras plataformas
se ha hecho posible gracias a las contribuciones de c&oacute;digo abierto de mucha
gente a lo largo de los a&ntilde;os. Comparado con Perl, VBScript es una opci&oacute;n pobre.
<br>

<h4>
   <a name="nine"></a>
   <font color="#000066">
      Seguridad
   </font>
</h4>

La gran cantidad de software de seguridad no-Microsoft y parches de seguridad
para los sistemas operativos Microsoft testifica sobre la debilidad fundamental
de Microsoft Windows NT, 2000 y XP en comparaci&oacute;n con los sistemas operativos
UNIX/Linux. Semejantes antivirus y mejoras a la seguridad de terceras partes
son simplemente innecesarios en Linux. Para ser justos, todos los sistemas
operativos pueden ser vulnerables a ataques maliciosos, pero hay una gran
diferencia de grado entre UNIX/Linux y los sistemas operativos de Microsoft. 
<br>

Windows NT y 2000 son vulnerables a los mas de sesenta y cinco mil virus
inform&aacute;ticos conocidos (cuando escrib&iacute; este art&iacute;culo por vez primera en 1999
esa cantidad era aproximadamente de cuarenta mil) mientras que el n&uacute;mero de
los que afectan a UNIX/Linux pueden contarse con los dedos de una mano. XP
tambi&eacute;n es vulnerable a los mismos virus que sus predecesores de Microsoft,
lo que indica que Microsoft claramente rehusa "endurecer" sus sistemas
operativos.
<br>

S&oacute;lo en 1999, el virus Chernobyl y el gusano Melissa provocaron un da&ntilde;o indecible a
los ordenadores basados en Microsoft en todo el mundo debido a vulnerabilidades del
software de Microsoft sobre sistemas operativos de Microsoft. De nuevo en el 2000,
el virus "I Love You" camp&oacute; a sus anchas por las m&aacute;quinas Microsoft causando muchos
millones de d&oacute;lares en da&ntilde;o por p&eacute;rdida de datos y productividad. Como en 1999,
las m&aacute;quinas UNIX y Linux s&oacute;lo fueron afectadas de forma indirecta, no debido a un
ataque directo de esos virus sobre ellas (no hubo ninguno) sino por el hecho de que
las maquinas UNIX/Linux se utilizan de forma rutinaria como servidores para
transportar los mismos virus y gusanos que son letales para los productos de
Microsoft.
<br>

En Julio de 2001, los ataques de "Code Red" el gusano "SirCam" y el asalto
del gusano "NIMDA" en septiembre de 2001 (que los expertos en seguridad
inform&aacute;tica estiman que cost&oacute; a las compa&ntilde;&iacute;as unos 2 mil millones de d&oacute;lares
s&oacute;lo en EEUU) una vez m&aacute;s demostraron la mediocre seguridad de los sistemas
operativos Microsoft Windows NT y Windows 2000, as&iacute; como el paquete de
software del servidor IIS de Microsoft. Una vez m&aacute;s, UNIX y Linux prevalecieron
con ning&uacute;n efecto negativo directo. Como se referencia m&aacute;s abajo, el
prestigioso <i>Gartner Group</i> abog&oacute; por el r&aacute;pido <i>abandono</i> de los
productos de servidor de Microsoft. M&aacute;s a&uacute;n, el fabricante de software de
servidores Halcyonsoft ha descubierto que IBM ha implantado pol&iacute;ticas
corportarivas que prohiben los servidores IIS de Microsoft en sus sitos
Web conectados a Internet. Sin embargo, algunos fueron instalados por error,
y esos sitios basados en IIS ya han sido penetrados y desfigurados varias
veces en el 2001.
<br>

Entre el software de Microsoft particularmente maldito se incluye su l&iacute;nea
de servidores de mensajer&iacute;a (fundamentalmente para correo electr&oacute;nico)
Exchange, su servidor web IIS y su cliente de escritorio para correo
electr&oacute;nico Outlook (los tres han sido particularmente famosos por sus
vulnerabilidades de seguridad, aunque especialmente el producto IIS). Las
alternativas UNIX/Linux a dichos productos de Microsft incluyen iPlanet y
Lotus Notes para servicio web y mensajer&iacute;a, as&iacute; como opciones de c&oacute;digo
abierto tales como las venerables y constantemente mejoradas aplicaciones
de servicio de correo electr&oacute;nico Sendmail y Qmail y el popular servidor
web Apache.
<br>

Un comentario que ha circulado por los medios de comunicaci&oacute;n relacionados
con las TI (prensa, web, etc.) intenta sugerir que la cantidad de agujeros
de seguridad del software de Microsoft puede explicarse como resultado
directo de su popularidad. Esta teor&iacute;a mantiene que cuando una pieza de software
determinada crece en lo referente a su adopci&oacute;n y uso com&uacute;n, tambi&eacute;n lo hace
la cantidad de programaci&oacute;n il&iacute;cita destinada a ella. Puesto que una revisi&oacute;n
de sobria de los problemas de seguridad publicados en sitios web como
CERT <i>no muestran semejante patr&oacute;n</i>, este argumento puede ignorarse.
Quiz&aacute;s la prueba m&aacute;s simple contra &eacute;l est&aacute; en la arena del software de
servidores web, en el cual el servidor web de C&oacute;digo Abierto <i>Apache</i>
mantiene un liderazgo de 3-a-1 en cuanto al uso sobre el servidor de
Microsoft IIS, y a&uacute;n as&iacute; la tasa y profundidad de la predaci&oacute;n  del producto
de Microsoft (debido a su inadecuado modelo de seguridad) empeque&ntilde;ece los
relativamente oscuros agujeros de Apache, que han sido r&aacute;pidamente corregidos
en las versiones m&aacute;s modernas.
<br>

Con referencia a la alta disponibilidad en cluster del antedicho Microsoft
Datacenter, los administradores locales no tienen ning&uacute;n recurso para aplicar 
parches y actualizaciones de seguridad en caso de crisis, puesto que el software
de Datacenter s&oacute;lo est&aacute; disponible atrav&eacute;s del fabricante y no puede ser cambiado
por el cliente. En el caso de los gusanos Code Red y Nimda, los administradores
locales se encontraron con las manos atadas, y esas instalaciones cr&iacute;ticas para
la empresa fueron vulnerables durante d&iacute;as, m&aacute;s a&uacute;n teniendo en cuenta que la
mayor&iacute;a de los sistemas Datacenter utilizaban el servidor web inseguro IIS de
Microsoft (al cual atacaba Nimda espec&iacute;ficamente) para proporcionar capacidad
de Servidor de Terminales. El resultado es que un entorno cr&iacute;tico de empresa
Datacenter muy costoso pudo quedarse paralizado durante d&iacute;as antes de que se
encontrase una soluci&oacute;n. Los sistemas de alta disponibilidad UNIX/Linux simplemente
no son susceptibles a dichos ataques.
<br>

ÅøHay programas maliciosos que afecten a UNIX/Linux? Por supuesto, pero la
defensa contra ellos es rutinaria y no es dif&iacute;cil ni costosa. Por otro lado,
los administradores de Microsoft Windows NT y 2000 incurren en significativos 
para esterilizar sus m&aacute;quinas y protegerlas de ataques. Presumiblemente Microsoft
est&aacute; preocupada por que la "experiencia" del usuario final sea negativa debido
a un problema de seguridad. Esto podr&iacute;a entenderse que es una forma deliberada
de trasladar el tema de la seguridad a los grupos de TI locales, lo cual implica
mayores costos de software y la tarea de dar soporte a los productos de
baja seguridad de Microsoft.
<br>

Todo lo que un potencial comprador puede hacer es o aceptar el riesgo que implica
utilizar los SSOO de Microsoft inmediatamente tras su salida al mercado o esperar a
que los parches y actualizaciones de seguridad de Microsoft eleven con el tiempo a
un nivel aceptable de seguridad. Como se comentaba antes, hist&oacute;ricamente Microsoft
ha reemplazado sus SSOO antes de que pudieran alcanzar ese nivel. Adem&aacute;s, los
responsables de TI no deben olvidar que hay que contabilizar aparte en los
presupuestos el coste adicional del software de seguridad que no fabrica Microsoft
tal como Symantec, McAfee y Sygate, entre otros.
<br>

Microsoft dice que Windows XP es el sistema operativo m&aacute;s seguro de la historia.
Al instalarlo o utilizarlo por vez primera, todos los ordenadores con XP deben
registrarse como parte del requisito de "activaci&oacute;n del producto" de Microsoft.
Puesto que el SO que se instala desde el CD est&aacute; desfasado antes de haber sido
ejecutado por vez primera (un problema al que se enfrentan todos los SSOO
comerciales) es necesario una red o una conexi&oacute;n por m&oacute;dem para que el SO pueda
ser "adecuadamente" activado, utilizando la caracter&iacute;stica de "<i>Actualizaci&oacute;n
Autom&aacute;tica</i>" de Microsoft. En diciembre de 2001, poco despu&eacute;s de su liberaci&oacute;n,
se encontr&oacute; que Microsoft Windows XP exhib&iacute;a lo que objetivamente puede ser
descrito conmo un agujero de seguridad de dimensiones considerables: la tecnolog&iacute;a
de Microsoft de activaci&oacute;n por defecto del "<i>Plug & Play Universal</i>",
que permite a ordenadores remotos conectarse directamente a la m&aacute;quina local
con privilegios de sistema, cortocircuitando cualquier noci&oacute;n de autenticaci&oacute;n
de la entidad remota. Esencialmente, la m&aacute;quina sin el parche adecuado est&aacute;
completamente abierta al m&aacute;s letal de los ataques.
<br>

Dado que los ordenadores con XP deben "telefonear a casa" antes de que puedan
ser adecuadamente configurados (o incluso parcheados), este agujero deja en la
pr&aacute;ctica a los ordenadores con XP completamente abiertos a un ataque durante
la primera fase del uso, lo que quiere decir que <i>todas las nuevas instalaciones
de XP tienen un per&iacute;odo de vulnerabilidad contra un riesgo severo que no puede
ser evitado</i>. El problema est&aacute; tan intr&iacute;nsecamente unido al SO Windows XP de
Microsoft que s&oacute;lo puede ser tratado mediante el redise&ntilde;o del mismo. Los ejecutivos
de Microsoft tuvieron que hacer frente a los interrogatorios por parte del FBI
sobre este tema, y Windows XP ha sido colocado en el primer puesto de la lista
de problemas serios de seguridad nacional que mantiene el Centro de Protecci&oacute;n
de Infraestructuras Nacional del gobierno de los Estados Unidos. Hacia mediados
de enero, quedaba claro que los parches que Microsoft liber&oacute; para arreglar el
agujero del Plug & Play Universal y otras cuestiones hab&iacute;a causado por s&iacute; mismo
serios problemas. Los profesionales de TI han informado que el bombardeo de
actualizaciones autom&aacute;ticas de Microsoft hab&iacute;an dejado a muchas instalaciones
clave en XP as&iacute; como a los dispositivos perif&eacute;ricos inutilizables o inutilizables.
A decir verdad, Microsoft est&aacute; luchando a brazo partido para resolver los problemas
de seguridad y rendimiento con la mayor prontitud. Sin embargo, Microsoft rehusa
proporcionar la documentaci&oacute;n o incluso la indicaci&oacute;n sobre el contenido de
dichos parches a los profesionales de TI, haciendo que la depuraci&oacute;n y la
correci&oacute;n de errores de los problemas de las actualizaciones autom&aacute;ticas sean
casi imposibles.
<br>

 Microsoft has added a new wrinkle to the "phone home" nature of their Windows
XP OS with the  release of its <i>Product Use Rights (PUR)</i> volume license
agreement (published on  Microsoft's web site and often altered without fanfare
or due customer notice). In the section on  Windows XP Professional, the
"Internet-Based Services Components" section reads, in part: "<i>You  acknowledge
and agree that Microsoft may automatically check the version of the Product
and/or its  components that you are utilizing and may provide upgrades or
fixes to the Product that will be  automatically downloaded to your Workstation
Computer.</i>" Taken at its word, Microsoft has thus been  given carte blanche
to access Windows XP computers anywhere at any time. As "owner" of the machine(s)
 in question, the local IT organization therefore has had any options to
prevent such access completely  removed, and in fact has been placed into
an extremely awkward position of having no control over  privacy and security
of XP computers. Implicit is that all XP computers must be accessible to
Microsoft  by network at all times in order to receive <i>Automatic Update</i>
 transactions. Advice: before ever  committing to using XP, have your corporate
legal personnel review the question of whether the  disabling of Automatic
Update would therefore void this Microsoft "agreement". History reminds us
that  voiding Microsoft user agreements can be a messy, unfortunate affair. 
<br>

El 15 de enero de 2002, el principal responsable de Microsoft Bill Gates
envi&oacute; un correo electr&oacute;nico extraordinario con el t&iacute;tulo "<i>inform&aacute;tica
digna de confianza</i>" a todo el personal de Microsoft a nivel mundial que
fue distribuido profusamente a los c&iacute;rculos de la prensa y los medios
informativos. En su misiva, Gates rogaba a sus trabajadores que pusieran
la "m&aacute;xima prioridad" al tema de la <i>seguridad</i>, siendo "m&aacute;s importante"
que cualquier otra parte del trabajo de la compa&ntilde;&iacute;a. Con una falta de rumbo
desafortunada, Gates opina que esta nueva conciencia sobre la seguridad en
Microsoft es el resultado del despertar que supuso el ataque terrorista del
11 de septiembre de 2001 en la Ciudad de Nueva York. Esto es transparentemente
grosero y sin venir a cuento, dado que las cr&iacute;ticas sobre los pobres
esfuerzos de Microsoft en el tema de la seguridad datan de los a&ntilde;os 80.
Muchos en la industria de la TI infieren que la carta de Gates es una
admisi&oacute;n de que la seguridad nunca ha sido una preocupaci&oacute;n importante
en Microsoft. La pregunta inevitable es hasta que punto puede inculcarse la
mentalidad necesaria en las maneras anteriormente descuidadas de la
organizaci&oacute;n. Adem&aacute;s este cambio de rumbo en el objetivo corporativo puede
ser realizado con prisa, ante el reto de la ambiciosa y mal concebida
estrategia del .NET. La conveniencia antes que la eficacia puede ser
desastrosa.
<br>

Como se menciona antes, el modelo de seguridad por defecto de los productos
de Microsoft es casi siempre "<i>la permisividad</i>", lo que es una postura
potencialmente desastrosa en el entorno actual de la inform&aacute;tica. La
aproximaci&oacute;n de UNIX/Linux, con su postura por defecto en seguridad del
"<i>cerrado</i>", implica que los agujeros son raros.
<br>

<h4>
   <a name="ten"></a>
   <font color="#000066">
      Escalabilidad
   </font>
</h4>

Respecto a las plataformas hardware en las que se ejecuta un UNIX propietario
como RS6000 de IBM, HP 9000, MIPS de SGI, los Ultras de Sun y los anteriormente
mencionados Alphas de Compaq, est&aacute; claro que estas corporaciones han ajustado
cuidadosamente sus sistemas operativos de 32 y 64 bits para obtener la m&aacute;ximas
ventajas del hardware multiprocesador subyacente. Todos estos sistemas son
"escalables", lo que quiere decir que se puede a&ntilde;adir hardware y ajustar la
red para mejorar significativamente la capacidad del sistema.
<br>

Estos SSOO UNIX de gama alta soportan m&uacute;ltiples placas, as&iacute; que el sistema
puede almacenar de forma acumulativa desde dos a m&aacute;s de cien procesadores,
y donde los avances t&eacute;cnicos regulares permiten superar esas cifras. Las
instalaciones de "alta disponibilidad" presumen de una fiabilidad cercana al
100%, con protecci&oacute;n interna contra "fallos" para prevenir las ca&iacute;das.
<br>

Los sistemas operativos de Microsoft de 32 bits Windows NT y 2000 pueden
operar s&oacute;lo sobre ciertos, y pocos, sistemas multiprocesador que s&oacute;lo tienen
una capacidad fraccional de la que ofrecen las variedades de los principales
fabricantes de hardware UNIX. Los sistemas basados en Microsoft son f&aacute;cilmente
tasados por un menor n&uacute;mero de procesos concurrentes en el n&uacute;cleo, y su
escalabilidad, comprada con UNIX, es menor. Por estas razones, simplemente
<i>no aparece</i> Microsoft Windows NT y 2000 en las clases de servidor que
se engloban bajo los t&eacute;rminos Supercomputador y Alta Disponibilidad. XP tambi&eacute;n
est&aacute; destinado a no ser incluido nunca en ellas.
<br>

En las encuestas semestrales de los 500 ordenadores m&aacute;s r&aacute;pidos del mundo, los
sistemas operativos UNIX rutinariamente aparecen en casi todos. De forma
reveladora, las configuraciones Linux se pueden ver cada vez m&aacute;s, alcanzando
incluso la posici&oacute;n 44 en una de las encuestas de 1998. Ning&uacute;n sistema operativo
de Microsoft ha aparecido <i>nunca</i> en la encuesta. Este vac&iacute;o de la
presencia de Microsoft en los niveles m&aacute;s altos de la computaci&oacute;n es sumamente
informativa.
<br>

Bajo el liderazgo de Rick Beluzzo, el fabricante de UNIX Silicon Graphics
gast&oacute; una gran cantidad de dinero y energ&iacute;a para ofrecer en las estaciones
basadas en Windows NT los gr&aacute;ficos de alto rendimiento del tipo del que son
requeridos en las industrias del CAD/CAM, la televisi&oacute;n y el cine. Despu&eacute;s
de contin&uacute;as decepciones debido a la inestabilidad y el bajo rendimiento obtenido,
el ahora financieramente tocado SGI abandon&oacute; la l&iacute;nea de Microsoft Windows NT.
Pronto, Beluzzo dej&oacute; SGI por un puesto ejecutivo en Microsoft en un campo
de responsabilidad no relacionado con el proyecto, mientras que SGI volv&iacute;a a su
solicitad&iacute;sima versi&oacute;n de UNIX, IRIX, ofreciendo tambi&eacute;n Linux con soporte
completo.
<br>

Los cin&eacute;filos que han visto la pel&iacute;cula de animaci&oacute;n de Hollywood "Shrek"
o el bombazo que fue "Titanic" podr&iacute;an sorprenderse al saber que las secuencias
animadas fueron creadas enteramente en estaciones gr&aacute;ficas de generaci&oacute;n de
im&aacute;genes basadas en Linux. La animaci&oacute;n por ordenador de la popular pel&iacute;cula del
2001-02 "El Se&ntilde;or de los Anillos" fue generada en servidores UNIX y estaciones
de trabajo con IRIX. Durante muchos a&ntilde;os, los animadores cinematogr&aacute;ficos
y los generadores gr&aacute;ficos de pel&iacute;culas como "Monsters, Inc." y "Toy Story"
han sabido que s&oacute;lo UNIX/Linux cumple su papel cuando se trata de semejantes
requerimientos computacionalmente intensivos. Los productos de Microsoft
no se utilizan apenas.
<br>

El sistema operativo Linux de 32 bits, en su actual estado, tiene una capacidad
que en rango supera a la de Microsoft Windows NT y 2000 y se solapa con la de
las instalaciones de gama baja de 32 bits de UNIX. El sistema operativo Linux
de 64 bits (para Compaq Alpha y Sun UltraSparc) sigue mejorando y retando
a las principales versiones de UNIX, y la anteriormente mencionada version
de 64 bits de Linux para Itanium tendr&aacute; su lugar como un igual entre las
restantes versiones UNIX para esa plataforma. Linux ser&aacute; probablemente el
primer SO de 64 bits para la UCP Hammer de AMD.
<br>

<h4>
   <a name="eleven"></a>
   <font color="#000066">
      Percepciones y "compartici&oacute; de ideas"
   </font>
</h4>

La percepci&oacute;n del sistema operativo Linux es que se trata de una opci&oacute;n
viable, potente y marcadamente poco costosa para librar a un sistema inform&aacute;tico
de Microsoft Windows NT y 2000, y que es una alternativa igualmente atractiva
a la instalaci&oacute;n de Windows XP.
<br>

Mirando m&aacute;s all&aacute; de la migraci&oacute;n, los planes futuros de compra podr&iacute;an estar
basados en Linux, pero m&aacute;s importante es que la experiencia acumulada por el
personal de administraci&oacute;n de sistemas en Linux durante la fase de recuperaci&oacute;n
desde NT/2000 podr&iacute;an hacer de la transici&oacute;n a un sistema UNIX de primera fila
una alternativa posible. Es interesante que esa transici&oacute;n puede ser facilitada
por el hecho de que las versiones de desarrollo de los pr&oacute;ximos UNIX dentro de
la corriente principal, como Solaris 9 y HP-UX 12 muestran que las versiones
finales ofrecer&aacute;n API (soporte para aplicaciones e interfaces compatibles)
completas para Linux. Por ejemplo, llevar aplicaciones desde m&aacute;quinas Linux
m&aacute;s peque&ntilde;as a m&aacute;quinas UNIX m&aacute;s grandes no requerir&aacute; grandes esfuerzos si 
&eacute;stas no est&aacute;n espec&iacute;ficamente ajustadas al entorno hardware particular
(pocas lo son).
<br>

Como defensa contra las campa&ntilde;as de marketing de Microsoft t&iacute;picamente
masivas y saturadoras, los sitios web de los principales distribuidores de
UNIX se mantienen ah&iacute; ofreciendo informaci&oacute;n sobre sus ofertas espec&iacute;ficas
para UNIX y Linux. Puesto que Linux es software de Fuente Abierta, la
carencia de una autoridad central o "propiedad" parece que est&aacute; evitando
que Microsoft pueda contrarrestar eficazmente su aumento de popularidad y
aceptaci&oacute;n.
<br>

En verdad, la popularidad de Linux atrav&eacute;s del boca a boca no tiene precedentes
en el mundo de la inform&aacute;tica. Espec&iacute;ficamente en relaci&oacute;n con Microsoft, un
elemento principal del fen&oacute;meno Linux es que ha promovido un repudio de los
"atrapados" en la agenda de Microsoft, con los antedichos duros efectos sobre
los presupuestos de TI.
<br>

Las mayores corporaciones de la industria del software y hardware inform&aacute;ticos
ahora ofrecen rutinariamente soporte 24 para Linux en sus plataformas espec&iacute;ficas
despu&eacute;s de la compra, mientras Linux est&aacute; alcanzando su lugar en los centros
educativos de inform&aacute;tica en todo el mundo. Un creciente n&uacute;mero de instituciones
acad&eacute;micas por todo el mundo utilizan el n&uacute;cleo de Linux para los estudios
superiores de Inform&aacute;tica, garantizando que la pr&oacute;xima ola de expertos en
software y hardware ser&aacute;n &iacute;ntimamente familiares con Linux. Los proveedores
de cursos ahora ofrecen de forma rutinaria cursos de familiarizaci&oacute;n y
administraci&oacute;n de sistemas Linux. De las principales corporaciones inform&aacute;ticas,
s&oacute;lo Microsoft parece estar evitando Linux.
<br>

<h1>Traducido hasta aqu&iacute;</h1>

<h4>
   <a name="twelve"></a>
   <font color="#000066">
      Cuestiones de software y compatibilidad
   </font>
</h4>

 Does Linux's non-centralized origin and "Open Source" development process
make it in any way less credible or "safe" a choice than UNIX or Microsoft
Windows NT, 2000, and XP? Clearly not, judging by the huge corporate embrace
of Linux. The list of major computer corporations actively supporting Linux
continues to grow at a steep climb. Included are such companies as  Sun
Microsystems, IBM, Hewlett Packard, Oracle, Compaq, Dell, Sybase, Sony, AOL/Time
Warner, Novell, Intel, Informix, Adaptec, and many more.
<br>

 Based on this list of corporate luminaries, fears that major non-Microsoft
software packages available for Windows NT and 2000 would not be available
on Linux are proving to be mostly unwarranted as new product versions are
released. The quantity of commercial and freeware software solutions for
Linux continues to grow. Similarly, organizations that abandoned UNIX varieties
of software for NT will find the return to UNIX/Linux increasingly easier
as a growing number of consultants offer migration services.
<br>

 An added benefit of Linux's Open Source community of developers is that
significant improvements, patches, fixes, upgrades, and new versions become
available for usage (and individual modification) at a rate that makes Microsoft
appear to be motionless. To discount or misunderstand the merits of such
"peer review" of the Linux code base is to dispute the validity of academic
inquiry and the <i>scientific method</i>, as practiced for centuries. Peer
review of Linux and Open Source code in public is what guarantees its best
qualities. Conversely, closed source code requires placing an inordinate
trust in its vendor.
<br>

 Open Source code is freely available, and can be readily inspected prior
to installation. By compiling such code locally, the program is optimized
completely for the local machine. This is not so with Microsoft pre-packaged
binary files, which are compiled distantly to generic PC specifications.
The performance implications of this software difference can be significant.
Since inspecting the contents of a <i>canned</i> Microsoft binary is impossible,
a system administrator must accept that what is inside is beneficial. It
has been demonstrated that what lurks inside Microsoft binaries often is
not.
<br>

 Microsoft-produced binary files are known to often contain "easter eggs",
which are internal sequences of code that are not central to the purpose
of the original file. The best known of these is the flight simulator found
in Microsoft's Excel spreadsheet program. Such Microsoft-distributed software
is known derisively in the computer industry as "bloatware". There is no
justification for wasting computer energy on such non-essential software,
however entertaining some end users may find it to be.
<br>

 Windows 2000's installation software is approximately five times as large
as that for Windows NT 4. The code itself contains almost double the lines
(complexity) as NT 4.0 version, which is itself overly complex for its designated
tasks (see GUI and "headless" problems above). As with previous OS versions,
Microsoft continues its practice of not publishing critical APIs <i>(critical
programming interfaces used by software makers)</i> for Windows XP, effectively
disadvantaging the offerings of any company but their own. In fact, Microsoft
is tying so many additional applications into XP that the complexity of the
code now overwhelms comparison with NT. An old adage states that "the fewer
the moving parts, the less there is to go wrong." Microsoft evidently feels
that IT personnel have nothing to fear from XP's mushrooming code size and
complexity.
<br>

 In contrast, Linux code is continually tuned and optimized by a public
community of highly skilled developers from around the world. Their only
agenda is to implement better functionality. There are no secrets to the
code, no hidden APIs, no "easter eggs". In almost any comparable situation,
Linux code is proportionally smaller than that of other OSes. Thus, it
is very fast, easy to optimize for local needs, and free of <i>junk</i>.
As traditional UNIX vendors embrace Linux, they are helping the Open Source
<i>GCC</i> compiler team to ensure that local GCC-created binaries
can achieve similar efficiency on their hardware as from their own proprietary
compilers. As mentioned previously, the mainstream UNIX versions are highly
tuned and calibrated by their manufacturers to suit their appropriate hardware. 
<br>

 UNIX/Linux program setup files, often called "binaries", are markedly smaller
than Microsoft ones, since they rely on previously installed operating system
<i>libraries</i>. Libraries provide centralized information and
code routines to all programs, allowing programmers to concentrate on the
merits and performance of their own code while simply invoking tried-and-true
library routines as needed.
<br>

 The Windows NT, 2000, and XP operating systems provide sparse <i>library</i>
support. Microsoft programs must therefore install a selection of <i>".DLL"</i>
(Dynamic Link Library) files that contain their needed libraries. These
.DLL file installations often overwrite critical, previously installed versions
of the same file. A result is that de-installation of software from a Windows
machine can cause the undesired deletion of critical files, accompanied by
the loss of functionality of unrelated software, or even the operating system
itself. Sometimes a complete re-installation of the operating system is
required.
<br>

 A common Windows de-installation message warns the administrator of potential
problems about multi-use files, yet does not provide any detailed information
on the danger at hand. In the face of this, a typical administrator will
opt to leave the "conflicting" files on the machine rather than risk the
consequences of their removal. Thus, the Windows file system continues to
accumulate more and more files that have no present use, taking up space
that could be better used for data. Microsoft themselves have referred to
their ongoing library problems as ".DLL Hell".
<br>

 Microsoft's solution to ".DLL Hell" was to borrow a common UNIX/Linux strategy
for Windows 2000 and XP in which replaced files are held in storage so that
a rollback to a previous configuration can be achieved if the newer addition
causes problems. Given the less stable kernel of Windows OSes, this strategy
is proving not to be as recoverable as on UNIX/Linux in real time. The effort
by Microsoft in this area was nonetheless urgently required and generally
appreciated.
<br>

 The UNIX/Linux programming paradigm does not allow for such de-installation
difficulties. Programs are purposely installed into disk or file system
areas that are safely removed from the critical operating system binaries
and libraries put in place at OS installation time. Programs only make library
"calls" and do not typically install their own.
<br>

 Also, since UNIX/Linux versions keep their configuration files in the <i>/etc</i>
directory and allow tight access to those files, frequent tuning,
cleanup, and backup of those files is simple and easy to automate in real
time. What's more, these files are easily adapted to other similar machines,
so portability of configuration attributes across an IT environment is quite
easy. The Windows OSes instead rely on a single binary file called the "<i>
registry</i>" to define the majority of the machine's configuration attributes.
A registry file is not transferable to another machine. Registry contents
are notoriously messy after several software changes, and inefficiencies
eventually abound. Such companies as Symantec sell products that improve
the efficiency and tidiness of registry files, begging the question as to
why Microsoft themselves sell such a maintenance-dependent system that requires
additional non-Microsoft software and licenses for its best performance.
<br>

<h4>
   <a name="thirteen"></a>
   <font color="#000066">
      "A la caza" del pavo
   </font>
</h4>

 Mainstream UNIX versions, and Microsoft Windows NT, 2000, and especially
XP, follow the procedure of <i>bundling</i> only select software options
as part of the initial operating system purchase. Only superficially is
there a clear comparison between Microsoft and UNIX OSes, because the quantity
of basic capabilities available in any generic UNIX supercedes that of NT,
2000, and XP.
<br>

 While the quantity of installation software and lines of code surged in
Microsoft Windows 2000 from NT, it was still lacking in basic server functionality
in comparison with UNIX/Linux. XP will similarly not address many of these
basic server functions without additional cost.
<br>

 Training costs for Microsoft-certified IT staff continue to be proportionally
much higher than for UNIX/Linux. Typically an MCSE candidate will face as
many as 12 courses (before taking exams) to achieve certification. UNIX/Linux
candidates can achieve major vendor certification in less than 4 courses
typically before taking exams, owing to the innate learnability and sensibility
of UNIX/Linux. Some people suggest that UNIX/Linux is cryptic and difficult
to learn. To the many who have easily learned it, especially in today's
rapidly growing Linux user population, this ill-informed sentiment is amusing. 
<br>

 In the area of bundled (available as part of the operating system installation)
software, Linux is the absolute champion, no questions asked. For example,
a full installation of Mandrake Linux 8.1 can install over 1.4 gigabytes
of world-class software <i>free of charge.</i> This software bundle ranges
in functionality from advanced Internet servers (Apache Web Server, INN News 
Server, Sendmail, etc.) to print services, to remote network management, to
database support, to fully featured office productivity suites, and more. 
<br>

<h4>
   <a name="fourteen"></a>
   <font color="#000066">
      En el escritorio
   </font>
</h4>

 Microsoft products, such as Windows 95, 98, NT, 2000, and soon XP, are entrenched
as the most implemented workstation environment throughout the corporate
computing world. <i>A wholesale takeover of such desktop environments from
the Microsoft products by any competitor is likely not imminent</i>, despite
great strides in the quality of such Open Source desktop products as <i>KDE</i>
and <i>Gnome</i> for UNIX/Linux. Historically, the rise of Windows products
at the expense of UNIX can be seen in the wide cost differential between
the low-tech Intel x86-based PCs (both IBM and clone) and the proprietary,
leading edge UNIX workstations. Additionally, Windows-platform-exclusive
availability of office-related application software such as <i>Microsoft
Office</i> cemented the use of the PC-based desktop, and Microsoft routinely
changed (and changes) file formats of their applications to thwart compatibility
with competitors' products, effectively locking IT organizations into a
software and license upgrading cycle. For a variety of reasons well outside
the scope of this white paper, Apple's Macintosh did not succeed in countering
the PC desktop wave with the notable exception of having conquered the graphical
design and musical industries.
<br>

 Until now, the traditional desktop alternative of the UNIX world has not
been embraced in the IT field even after many years of use. The venerable
<i>CDE</i> (Common Desktop Environment) used by Solaris, HP-UX, AIX,
SCO, and True64 was intended to provide a uniform user interface that would
allow ease of application programming across those UNIX versions. Differentiation
ensued among them, with unfortunate consequences to organizations that operated
a mix of UNIX versions on their workstations. Further, as no UNIX-based
alternative to Microsoft's Office application products was able to surmount
the file format difficulties to become truly competitive, the UNIX desktop
was not typically considered an option to Microsoft Windows.
<br>

 Today, since the KDE and Gnome products answer the need for desktop uniformity,
and as software applications continue to improve, a viable UNIX/Linux-based
alternative to the Microsoft Windows desktop environment is increasingly
credible. While CDE has a rather limited future, almost all of its vendors
have announced that their updated UNIX versions will offer one (or both)
of the KDE and Gnome desktops to match all leading Linux distributions.
<br>

 Beyond the Microsoft license and software fee implications for freedom
of choice, Microsoft's greatest sore point in the IT desktop environment
owes to the productivity losses accumulated from lost time and lost files
as a result of Windows OS instability. A reboot can be a costly affair, either
at that particular moment or when pro-rated with all others over time. KDE
and Gnome, operating on Linux-based PC workstations, are fast, inexpensive,
stable, and secure. UNIX workstations on proprietary hardware, such as Sun's
SunBlade models or HP's B, C, or J-class models, offer increasingly competitive
pricing to x86-based PCs running Microsoft operating systems, while providing
superior OS stability. Such machines excel at their traditional role, usually
for design and CAD/CAM use.
<br>

 In the area of software applications for UNIX/Linux that are competitive
with Windows-based desktop products, Sun's <i>free-of-charge</i> and ever-improving
<i>StarOffice</i> suite (based on an Open Source platform called
OpenOffice and built for UNIX/Linux <i>and</i> Windows OSes) is proving to
be an acceptable package for organizations wishing to leave the Microsoft
Office platform. Another product, Corel's WordPerfect Office Suite for Linux,
contains functionality on a par with (or superior to) Microsoft's own Office
Suite (of which no Linux-compatible version exists or is foreseen to be developed).
Unfortunately, Corel discontinued development of this competitive product
at the time of receiving a financial bail out of approximately $135 million
from Microsoft. After this event, Corel has turned instead to producing
products for Microsoft's .NET environment.
<br>

 Given the historic popularity of the Macintosh OS among people within the
graphical arts and musical communities, it is a cinch that as the leading
software applications of those industries are ported over to Apple OS X,
these highly creative people will follow to the new UNIX-based platform.
<br>

<h4>
   <a name="fiveteen"></a>
   <font color="#000066">
      Meditando su decisi&oacute;n de migrar
   </font>
</h4>

 Be alert to the realization that <i>only</i> Microsoft, among <i>all</i>
major computer corporations, is avoiding a commitment to Linux. Rather,
their marketing teams are now engaged in attacking it.
<br>

 Choose carefully whether to accept Microsoft's advertisements and information.
Bear in mind that <b><i>Microsoft chooses UNIX to handle the huge Internet
loads upon their largest Internet services.</i></b>
<br>

 Almost 95% of the servers at Microsoft Hotmail run Apache web servers on
FreeBSD UNIX, according to <i>Netcraft</i>, while MSN runs on Solaris and
Microsoft LinkExchange runs entirely on Apache/FreeBSD. Microsoft themselves
appear to understand that it is not worthwhile to run their very own operating
systems or web server software, after spending almost four years on the task
of shifting to Windows NT (then 2000) and fifteen months after the first
load balancing machines began to be shifted from FreeBSD. As the web site
<i>The Register</i> has noted, more of Microsoft's FreeBSD servers
just seem to pop up again and again. When confronted with public whimsey
at evidence of their UNIX and Open Source software usage, Microsoft installed
"interceptor" servers that prevent identification of these non-Microsoft
machines from being displayed, as in the redirect of queries of <i>LinkExchange</i>
servers to Microsoft's <i>BCentral</i> site.
<br>

 Perhaps a new Microsoft advertising slogan is in order: "<i><b>At Microsoft,
We Don't Use NT, 2000, or even XP. Why Should You?</b></i>"
<br>

<h4>
   <a name="sixteen"></a>
   <font color="#000066">
      Resumen y conclusiones
   </font>
</h4>

 It is in every IT leader's interest to install the "most capable at least
expense" computer operating system. With the Linux operating system available
<i>free of charge</i> as a complete, almost one-for-one replacement
for Microsoft Windows NT, 2000, and XP in most routine server tasks, an existing
Microsoft-based system can be readily converted with only incidental cost,
but at great benefit in reduced license fees and no future obligations to
the XP licence subscription service. Beyond monetary obligations, IT organizations
can now navigate towards maximum freedom in achieving their goals, perhaps
for the first time ever. Vendor-imposed limitations, expenses, and inadequacies
can often be made a thing of the past by employing Open Source software. 
<br>

 Now more than ever, in the heightened global security climate, rote acceptance
and purchasing of Microsoft products without proper, fair, objective research
of Open Source, third party, and UNIX/Linux alternatives is inexcusable,
and may even be grounds for concerns of misconduct and negligence, if not
incompetence. It is an open, well documented fact that Microsoft products
are especially inadequate in the area of trusted computing environments. 
<br>

 For those organizations that invested (usually heavily) in the Microsoft
Windows NT and 2000 operating systems, it should be unacceptible to continue
justifying the large financial outlays needed to correct the security and
capability inferiorities of the Windows OSes and applications. Herein lies
the essential, "real world" superiority of the Linux operating system: a
wide variety of benefits, improvements, and new capabilities is available
at little or no extra cost. Linux is absolutely <i>free of charge</i>, with
<i>no</i> licensing fees for any of its features, now or in the
future.
<br>

 In situations where Linux may not be an ideal replacement, UNIX may fit
the bill. For tasks such as high volume e-commerce or finance, there is
no better solution than a migration to a mainstream UNIX multi-processor
machine. Initial cost may seem high, but cost benefits related to lesser
system administration staff, fewer servers per assigned load, less electricity,
and of course sheer processing capacity, may outweigh these concerns.
In many high-end areas, Linux is not yet a match for a high-end UNIX version,
but this gap continues to be erased rapidly.
<br>

 Migration is change, and change is stressful to personnel if not managed
well. Deft navigation of available options is essential, and limited viewpoints
can only result in limited results. Given the availability of a wide range
of proven, secure, and powerful UNIX/Linux computing capabilities, today's
IT leaders who made their careers primarily or only in the Microsoft OS
world must look past personally limiting viewpoints, eschew "desktop-centric"
mindsets, and ensure that technical merit prevails in decision-making.
<br>

 Computer system administrators will be called upon to learn new OS techniques
as part of the migration, and this should not be problematic if the people
are of good quality. Downsizing of staff will almost certainly occur in
the migration from Windows OSes to UNIX/Linux (as this is one of the central
benefits of migration to UNIX/Linux for an organization). IT leaders will
thus need to be watchful for the truly knowledgeable and talented administrators
in their midst who can thrive in new environments. Even so, training will
go a long way to smoothing the technical transition, while a healthy component
of good will is needed to suppress notions of elitism sometimes felt by practitioners
of the superior UNIX/Linux computing environment towards their Windows-only
colleagues. Such inter-personal concepts as "techno-elitism" are poison
to efficacious migrations.
<br>

 For the reasons outlined in this white paper and supported by a great deal
of factual data readily accumulating on the World Wide Web and in corporate
computing environments, it is safe, sound, and productive to migrate to
UNIX/Linux and say "<i><b>No Thank You</b></i>" to Microsoft Windows NT,
2000, and XP.
<br>

<hr width="60%">
<br>

<h4>
   <a name="seventeen"></a>
   <font color="#000066">
      Recursos de Internet seleccionados
   </font>
</h4>

 The following Internet resources contain abundant and compelling evidence
of Microsoft Windows OS inferiority to UNIX/Linux, and of the difficulties
and cost to be expected with implementing Windows XP. I urge IT leaders
to take note of the high calibre of these sites:
<br>

 The January, 2002 issue of CIO Magazine contains the article
"<a href="http://www.cio.com/archive/010102/shop_content.html">How To Run a Microsoft-Free Shop</a>",
outlining 12 necessary conditions that will allow any IT organization
to make the transition away from Microsoft product usage. For a publication
such as CIO to offer such an article, it would seem that the thinking throughout
the IT world is now in regards to <i>how</i> to migrate to UNIX/Linux and
not <i>whether</i> to make the move.
(<i>http://www.cio.com/archive/010102/shop_content.html</i>)
<br>

 The mainstream press in North America, as seen in the Los Angeles Times
article
"<a href="https://www.latimes.com/business/la-000003463jan14.story?coll=la-headlines-business-manual">Security Flaws May Be Pitfall for Microsoft</a>",
has come to reflect the serious concerns IT leaders have expressed about
Microsoft's woeful track record regarding security. This article stops just
short of recommending OS alternatives, although the Open Source web server
Apache is mentioned as a replacement for IIS and the UNIX/Linux option is
implicit.
(<i>https://www.latimes.com/business/la-000003463jan14.story?coll=la-headlines-business-manual</i>)
<br>

 According to an article in U.S. News &amp; World Report called
"<a href="http://www.usnews.com/usnews/issue/020114/tech/14linux.htm">Out the Windows, Breaking with Microsoft Gets a Little Easier</a>",
the time to migrate away from Microsoft products has not only never been
better, but becomes simpler and easier as Linux and Open Source products
continue to improve.
(<i>http://www.usnews.com/usnews/issue/020114/tech/14linux.htm</i>)
<br>

 Do you know of IT leaders who want to migrate to Microsoft Windows XP? Show
them the article
"<a href="http://www.zdnet.com/zdnn/stories/comment/0,5859,2834779,00.html?chkpt=zdnnp1tp01">XP's 'Plug and Prey' Hole</a>"
from the prestigious Gartner Group. Gartner's advice in a nutshell: wait
for more evidence of further XP holes and problems before making a decision
to use that OS.
(<i>http://www.zdnet.com/zdnn/stories/comment/0,5859,2834779,00.html?chkpt=zdnnp1tp01</i>)
<br>

 Is Microsoft taking Linux seriously? Absolutely yes, and so should you,
judging from a leaked internal memo posted to The Register's site in the
article
"<a href="http://www.theregister.co.uk/content/4/23518.html">MS Struggles to Discredit Linux</a>".
Although the journalist points out the questionable veracity of most
or all of the Microsoft claims (IT leaders can thus be prepared for the
upcoming Microsoft marketing misdirection) it is troubling that Microsoft
sales personnel would expect that IT leaders would so casually allow them
(or any outsiders) tours and walkthroughs of computing centers. If your
site allows such access, there is a fundamental weakness in your security
that should be addressed.
(<i>http://www.theregister.co.uk/content/4/23518.html</i>)
<br>

 Computerworld columnist Dan Gillmor asks
"<a href="http://www.computerworld.com/storyba/0,4125,NAV47_STO66635,00.html">Has the Door Widened for Linux?</a>"
in an article that pointedly questions the sustainibility of IT budgets
in the face of Microsoft's pricing structures, given the great progress
of Linux and Open Source software at achieving enterprise-ready capabilities
at much reduced cost. Perhaps a corollary to his question might be: "Is Microsoft
pushing IT towards Open Source?", of which the answer is undoubtedly yes. 
(<i>http://www.computerworld.com/storyba/0,4125,NAV47_STO66635,00.html</i>)
<br>

 The weak security and stability of Microsoft OSes is not a myth concocted
by the supposed "ABM (<i>Anybody But Microsoft</i>) crowd", as Microsoft
PR personnel would have us believe. In fact, the government of the United
States of America is a leading chronicler of computer vulnerabilities, as
seen in the
"<a href="http://www.nipc.gov/">National Infrastructure Protection Center</a>"
site, which serves as "...a national critical infrastructure threat assessment,
warning, vulnerability, and law enforcement investigation and response entity."
Even just a cursorial glance is enough to see the deluge of Microsoft problems
versus the slight mention of UNIX and Open Source troubles.
(<i>http://www.nipc.gov/</i>)
<br>

 One of the leading publications devoted to cheerleading Microsoft OS administration,
"<a href="http://www.secadministrator.com/Articles/Index.cfm?DepartmentID=752">Security Administrator</a>",
routinely and objectively details security issues of both Windows-based
and Open Source software. Observe the panoply of Windows 2000 and Windows
XP problems versus the minimal troubles in the Open Source and UNIX camp. 
(<i>http://www.secadministrator.com/Articles/Index.cfm?DepartmentID=752</i>)
<br>

 Looking for a consultant to help your organization migrate from Windows
to Linux? This "<a href="http://www.linuxlinks.com/Companies/Support/">Linuxlinks</a>"
page is a start. Of course contacting the big IT vendors like IBM, HP,
Dell, Compaq, and major Linux distributors (Red Hat in North America, SUSE
in Europe, Turbolinux in Asia/Pacific) is sensible.
(<i>http://www.linuxlinks.com/Companies/Support/</i>)
<br>

 Fed up with Microsoft's licensing schemes, the city of Turku, Finland has
announced their plan to transition from Microsoft products to Linux replacements.
This translation of their
"<a href="http://linuxtoday.com/news_story.php3?ltsn=2001-12-20-004-20-NW-DP">press release</a>"
gives some information, which follows the increasingly popular rationale
of other local governments around the world that have decided not to run
Microsoft's gauntlet of fiscal hurdles.
(<i>http://linuxtoday.com/news_story.php3?ltsn=2001-12-20-004-20-NW-DP</i>)
<br>

 Although this white paper has always been intended for IT leaders, I'm gratified
that it seems to have resonated with end users. Migration of a personal
PC is not a carefree issue, but the article
"<a href="http://www.theregister.co.uk/content/4/23436.html">Mandrake 8.1 Easier Than Win-XP</a>"
from The Register describes the ease with which Linux can be installed
in place of Microsoft Windows XP, not shying away from some facts about
application usage that may argue against such a switch for certain game
users. As identified in this white paper, the freedom from viruses and malicious
exploits is the greatest bonus.
(<i>http://www.theregister.co.uk/content/4/23436.html</i>)
<br>

 Let there be no doubt that Linux is ready for the enterprise, as the Network Computing article
"<a href="http://www.networkcomputing.com/1224/1224f1.html">Special Report: Are We There Yet?</a>"
confirms. Their central argument: for certain stubborn IT leaders who have
not welcomed Linux, such mindsets are no longer appropriate or justifiable.
(<i>http://www.networkcomputing.com/1224/1224f1.html</i>)
<br>

 The Linux Operating System is making swift and deep inroads into the commercial computing environment,
most often at the market share expense of mainstream UNIX versions. The IT-Director article
"<a href="http://www.it-director.com/article.php?id=2332">Linux: The Penguin Marches On</a>"
projects that more and more Windows shops will soon make the transition,
given the cost and performance superiorities of Linux.
(<i>http://www.it-director.com/article.php?id=2332</i>)
<br>

 The Open Source software movement has enjoyed notable advancements towards acceptance and
usage. Its future is very bright in the IT world, as discussed in the C/Net article
"<a href="http://news.cnet.com/news/0-1275-210-7632187-1.html?tag=bt_bh">The Coming "Open Monopoly" in Software</a>".
Particularly, a strong economic argument is made that the Open Source
movement could cure many of today's software industry ills.
(<i>http://news.cnet.com/news/0-1275-210-7632187-1.html?tag=bt_bh</i>)
<br>

 As discussed in my white paper, the presence of Microsoft Windows in the
data center is low, and according to the Tech Republic article
"<a href="http://techupdate.zdnet.com/techupdate/stories/main/0,14179,2822837,00.html?chkpt=zdnnp1tu">Is HP-UX Intel's Ticket Into the Datacenter?</a>",
is destined never to take off as UNIX and Linux maintain their well earned,
logical ascendancy in such high performance, mission critical environments.
(<i>http://techupdate.zdnet.com/techupdate/stories/main/0,14179,2822837,00.html?chkpt=zdnnp1tu</i>)
<br>

 The Linux OS is essentially a kernel wrapped by OS development organizations
with their own choice of software to create a unique "distribution". Given
the opportunities for competition in the Open Source paradigm, many such
Linux distributions exit. For those new to the Linux world, this amount
of choice can be a bit bewildering. The Linuxdistro article
"<a href="http://www.distrowatch.com/game.htm">The Linux Distribution Game</a>"
serves as a primer for home users and newcomers to today's Linux distributions,
and is informative for IT leaders new to Linux.
(<i>http://www.distrowatch.com/game.htm</i>)
<br>

 When I first wrote this white paper in 1999 I would have loved to have provided an article such as
"<a href="http://www.zdnet.com/zdnn/stories/news/0,4586,2820864,00.html?chkpt=zdnnp1tp02">Is Microsoft losing its grip in Asia?</a>",
in which the essential ideas of this and similar documents have been
brought to bear so well in so many real situations.
(<i>http://www.zdnet.com/zdnn/stories/news/0,4586,2820864,00.html?chkpt=zdnnp1tp02</i>)
<br>

 Microsoft's XP advertising campaing is in full gear, but David Coursey's opinion piece
"<a href="http://www.zdnet.com/zdnn/stories/comment/0,5859,2819063,00.html">Meet the Dark Side of Windows XP</a>"
offers some compelling viewpoints that you won't be seeing in Microsoft's media barrage.
(<i>http://www.zdnet.com/zdnn/stories/comment/0,5859,2819063,00.html</i>
)
<br>

 An article at the CIO.com site displays the growing sense of exasperation
over the licensing and upgrade policies of major software vendors, and Microsoft
in particular, in the article
"<a href="http://www.cio.com/archive/101501/wasting.html">Let's Stop Wasting $78 Billion A Year</a>".
Given the target audience, it is clear that the final paragraphs show
that awareness and acceptance of Open Source software (such as Linux) is
now more solid than ever at the highest levels of the IT customer marketplace.
The second item in this <a href="http://www.cio.com/archive/101501/wasting_sidebar_1.html">side bar</a>
is particularly straightforward.
(<i>http://www.cio.com/archive/101501/wasting.html</i>)
<br>

 With the September, 2001 onslaught of the NIMDA worm, which specifically
exploited security holes in Microsoft server operating systems, the Gartner Group's paper
"<a href="http://www3.gartner.com/DisplayDocument?doc_cd=101034">Nimda Worm Shows You Can't Always Patch Fast Enough</a>"
directly counselled IT administrators to quickly abandon such Microsoft
products as the IIS web server in favour of much more secure competitors
like Apache and iPlanet. Coming from such a respected organization, this
has been perhaps the most blunt scolding of Microsoft for their lack of
sound security provision in their products.
(<i>http://www3.gartner.com/DisplayDocument?doc_cd=101034</i>)
<br>

 As more and more organizations migrate their <i>server</i> resources from
Windows to UNIX/Linux, the amount of technical information for administrators
available on the Web continues to grow. But what of <i>desktop</i> migrations
from Windows to UNIX/Linux? This area has been slow to accumulate, but the site
"<a href="http://www.robval.com/linux/desktop/index.asp">Linux as a Replacement for Windows 2000</a>"
is one of a new breed of sites that directly compares desktop migration
options in a clear and balanced manner, offering compelling "real world"
evidence for such a migration.
(<i>http://www.robval.com/linux/desktop/index.asp</i>)
<br>

 The CNN article
"<a href="http://cnnfn.cnn.com/2001/08/31/technology/wires/virus_re/">Virus costs skyrocket: Coping with computer attacks tops $10 billion</a>"
does not mention Microsoft by name, but it should be noted that every
virus mentioned in the article, bar one (Code Red), was a client-side Microsoft
Outlook virus. The Code Red virus attacked and plundered countless Microsoft
IIS servers while completely sparing UNIX/Linux servers.
(<i>http://cnnfn.cnn.com/2001/08/31/technology/wires/virus_re/</i>)
<br>

 Making an organizational switch away from Microsoft products may seem like
a daunting concept for some, but the Anandtech article "<a href="http://www.anandtech.com/IT/showdoc.html?i=1527&amp;p=1">
The State of Corporate IT: A Case for Linux</a>
" provides a real world example of a 7000+ person organization that successfully
transitioned, saving enormous Microsoft licensing fees and avoiding Microsoft's
"forced upgrading" ploys.
(<i>http://www.anandtech.com/IT/showdoc.html?i=1527&amp;p=1</i>)
<br>

 Okay, so you are persuaded. You would like to plan a migration, but need
a strong strategic framework. Dan Shearer has provided such a roadmap in
his web site called:
"<a href="http://shearer.org/remplacement.html">How to Replace Windows NT with Linux and BSD</a>".
While my paper is about the "why" of migration, Dan's is about the "how". 
(<i>http://shearer.org/remplacement.html</i>)
<br>

 Real world transition advice of the highest order can be found at the site
"<a href="http://www.troubleshooters.com/tpromag/200104/tcstory.htm">Troubleshooters.Com's Windows to Linux Transition: The Whole Story</a>",
which illustrates a planned, methodical Windows-to-Linux migration in
detail, with no sugar coating of the difficulties first faced.
(<i>http://www.troubleshooters.com/tpromag/200104/tcstory.htm</i>)
<br>

 A look at the prospects of Linux becoming a serious desktop workstation
operating system (as opposed to its typical server-class role) is provided
by CNN in their article:
"<a href="http://cnn.com/2000/TECH/computing/06/05/linux.expo.idg/index.html">Linux Works Its Way Toward Prime Time</a>".
(<i>http://cnn.com/2000/TECH/computing/06/05/linux.expo.idg/index.html</i>)
<br>

 The world is quickly waking up to the inherently weak security posture of
all Microsoft operating systems. In the Computerworld article
"<a href="http://www.computerworld.com/cwi/story/0,1199,NAV47_STO44856,00.html">Windows Easy Hacker Target</a>"
is a brief but essential discussion of the dangers in comparison to the solid security of UNIX/Linux.
(<i>http://www.computerworld.com/home/print.nsf/(frames)/000515DF36?OpenDocument&amp;~f</i>)
<br>

 Given the inherent weakness of Microsoft's OS and application software security
stance, systems professionals are increasingly concerned with that corporation's
attitude to ameliorating their concerns. The ZDNet article
"<a href="http://www.zdnet.com/zdnn/stories/news/0,4586,2568904,00.html">Microsoft's Outlook: Cloudy Security</a>"
discusses the growing discontent.
(<i>http://www.zdnet.com/zdnn/stories/news/0,4586,2568904,00.html</i>)
<br>

 In a security advisory by The Privacy Software Corporation called
"<a href="http://www.nsclean.com/psc-vbs.html">Extreme Risks in Microsoft VBS Scripting Host</a>",
the potentially dangerous VBScript vulnerabilities of Microsoft OSes are
discussed, and remedies suggested.
(<i>http://www.nsclean.com/psc-vbs.html</i>)
<br>

 Regarding viruses and their comparitive effects on Microsoft Windows NT
&amp; 2000 (heavy) versus UNIX/Linux (miniscule), the SecurityPortal article
"<a href="http://securityportal.com/direct.cgi?/closet/closet20000308.html">UNIX (and Linux especially) Viruses - The Real Story</a>"
spells it out.
(<i>http://securityportal.com/direct.cgi?/closet/closet20000308.html</i>)
<br>

 The Intel Itanium 64-bit processor will propel Linux into the realm of high 
performance computing heretofore reserved by UNIX and mainframes, as discussed
in the C/Net News article
"<a href="http://news.cnet.com/news/0-1003-200-1889928.html?tag=st.ne.1002.bgif.ni">Linux Makes Inroads Into High-End Computers</a>",
while Microsoft's Windows 2000 version for Itanium remains in limbo.
(<i>http://news.cnet.com/news/0-1003-200-1889928.html?tag=st.ne.1002.bgif.ni</i>)
<br>

 A brief summary of Microsoft's apparent hijacking of the open source security
protocol Kerberos can be found on the page:
"<a href="http://www.thestandard.com/article/display/0,1151,15325,00.html">Kerberos Loophole May Close Around Microsoft's Neck</a>".
(<i>http://www.thestandard.com/article/display/0,1151,15325,00.html</i>) 
<br>

 A major triumph for Linux has been its deployment in Internet server roles, 
as described in the Techweb article:
"<a href="http://www.techweb.com/wire/story/TWB20000530S0011">Google Bets The Ranch On Linux</a>".
(<i>http://www.techweb.com/wire/story/TWB20000530S0011</i>)
<br>

 A simple demography can tell a compelling story. In the article
"<a href="http://technology.news.com.au/news/4277663.htm">Linux Use Surges As Compaq Offers Help</a>"
from Technology News, corporate migration to Linux servers is occurring
at a rapid rate.
(<i>http://technology.news.com.au/news/4277663.htm</i>)
<br>

 A revealing look at the increasing sourness of the IT world towards the
Microsoft 2000 operating system's forthcoming release is found in the ZDNet
article
"<a href="http://www.zdnet.com/zdnn/stories/news/0,4586,2346321,00.html?chkpt=hpqsnewstest">Win 2000 Burns IT Managers</a>".
(<i>http://www.zdnet.com/zdnn/stories/news/0,4586,2346321,00.html?chkpt=hpqsnewstest</i>)
<br>

 In a similar vein, the projected high cost of preparing IT departments
for Windows 2000 is outlined in the Computerworld article
"<a href="http://www.computerworld.com/home/news.nsf/all/9910181win2k">Win 2K Review: Forget NT, This Is Something Very Different</a>".
(<i>http://www.computerworld.com/home/news.nsf/all/9910181win2k</i>)
<br>

 Regarding known difficulties with hardware and driver support, a ZDNet analyst wrote
"<a href="http://www.zdnet.com/zdnn/stories/comment/0,5859,2386174,00.html">Windows 2000's Big Headaches</a>"
in exasperation.
(<i>http://www.zdnet.com/zdnn/stories/comment/0,5859,2386174,00.html</i>)
<br>

 No Information Technology executive, manager, planner, purchaser, or system 
administrator responsible for <i>server-class</i> computers should make an operating
system purchasing decision before thoroughly reading the world famous white paper
"<a href="http://www.unix-vs-nt.org/kirch">Microsoft Windows NT Server 4.0 versus UNIX</a>"
created by John Kirch, Certified Microsoft Professional; Network Engineer.
(<i>http://www.unix-vs-nt.org/kirch</i>)
<br>

 Similarly, those desiring <i>high availability</i> installations or who
rely on <i>real-time</i> applications should not decide on implementing Microsoft
Windows NT before thoroughly examining the IACT white paper
"<a href="http://pages.cthome.net/iact/features/24x7reports/iact-24x7-NTreal.html">Windows NT and Real-Time Applications: Solution, or Problem?</a>"
created by John Drabik, President of AWI, a computer software and consulting
firm.
(<i>http://pages.cthome.net/iact/features/24x7reports/iact-24x7-NTreal.html</i>)
<br>

 I heartily recommend the Gartner Group article
"<a href="http://gartner12.gartnerweb.com/public/static/hotc/hc00085832.html">Debunking Open-Source Myths: Origins and Players</a>",
which demystifies some current fallacies regarding the nature of the
Open Source software movement.
(<i>http://gartner12.gartnerweb.com/public/static/hotc/hc00085832.html</i>)
<br>

 For an interesting proof of the inherent bloatedness of Microsoft operating
systems and application software, read the
"<a href="http://www.eggheaven2000.com">Egg Heaven</a>"
web site. Entertaining as some "Easter Eggs" might be, remember that such
programming excesses have no place on a corporate-class computer.
(<i>http://www.eggheaven2000.com</i>)
<br>

 To buttress several of my arguments, I refer you to Norman M. Jacobitz's
white paper:
"<a href="%20%0Ahttp://members.aa.net/%7Enormj/Articles/Migrate1.html">Migrating To Linux (Parts 1, 2, and 3)</a>".
(<i>http://members.aa.net/~normj/Articles/Migrate1.html</i>)
<br>

 The Linux community has arisen on a considerably less official plane than
Microsoft or the major UNIX vendors. This, however, is changing rapidly with
Linux's markedly increasing status as a commercial, professional operating
system. The "<a href="http://www.linuxlinks.com">LinuxLinks</a>"
site is dedicated to providing web page links to almost all information
regarding Linux.
(<i>http://www.linuxlinks.com</i>)
<br>

</ul>
<br>

<hr width="60%">

<i>The opinions expressed in this white paper, unless expressly attributed
to another person or source, are my own and do not represent those of any
organization to which I am affiliated.</i>
<br>

<a href="http://web.cuug.ab.ca/~Eleblancj">Click Here</a> to jump to my main web page.
(<i>http://web.cuug.ab.ca/~leblancj</i>).
<br>

<a href="mailto:leblancj@cuug.ab.ca">Click Here</a> to email me.
(<i>leblancj@cuug.ab.ca</i>) <b><font color="#ff0000">NOTE:</font></b>
I do not provide free advice or free computer consulting. I reserve the
right to answer email inquiries at my leisure (of which I have almost none). 
<br>

"<a href="http://www.bell-labs.com/history/unix/">UNIX</a>"
is a registered trademark of <i>The Open Group</i>.
<br>

"<a href="http://www.linux.org">Linux</a>"
is a registered trademark of <i>Linus Torvalds</i>.
<br>

"Windows NT", "Windows 2000", and "Windows XP" are U.S. registered trademarks
of <i>Microsoft Corp.</i>
<br>

</font>
</td>
</tr>
</tbody>
</table>
</font> 

</body>
</html>
