<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=iso-8859-1">
	<TITLE>Why Open Source Software / Free Software (OSS/FS)? Look at the Numbers!</TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice.org 641  (Linux)">
	<META NAME="CREATED" CONTENT="20020131;22354200">
	<META NAME="CHANGED" CONTENT="20020418;190100">
	<META NAME="DESCRIPTION" CONTENT="This paper provides quantitative data that, in many cases, open source software / free software is equal to or superior to their proprietary competition.  The paper examines market share, reliability, performance, scaleability, security, and total cost of ownership; it also gives commentary on non-quantitative issues and unnecessary fears.">
	<META NAME="KEYWORDS" CONTENT="open source, open source software, free software, Linux, freedom, software, free, OSS, FS, OSS/FS, GNU, GNU/Linux, Unix, Windows, NT, Windows 2000, Apache, fuzz, performance, scaleability, reliability, market, references, cost, total cost of ownership, quantitative, study, numbers">
</HEAD>
<BODY LANG="en-US" BGCOLOR="#ffffff">
<H1 ALIGN=CENTER><FONT COLOR="#339900">&iquest;Porqu&eacute; Software
de Fuente Abierta / Software Libre (OSS/FS)? &iexcl;Mire los N&uacute;meros!</FONT></H1>
<P ALIGN=CENTER>David A. Wheeler</P>
<P ALIGN=CENTER>dwheeler@dwheeler.com</P>
<P ALIGN=CENTER>Revisado el 25 de Enero de 2001<BR>Traducido por
Eduardo Maldonado<BR>eduardo.maldonado@hispalinux.es</P>
<P>El Software de Fuente Abierta / Software Libre (OSS/FS, del ingl&eacute;s
Open Source Software / Free Software) est&aacute; surgiendo con
fuerza. Si no est&aacute; usted seguro de lo que significan estos
t&eacute;rminos, puede conseguir una explicaci&oacute;n de los mismos
e informaci&oacute;n relacionada en mi <A HREF="oss_fs_refs.html">list
of Open Source Software / Free Software (OSS/FS) references at
http://www.dwheeler.com/oss_fs_refs.html</A>. Brevemente, los
programas OSS/FS son programas cuya licencia permite a los usuarios
la libertad de correr el programa para cualquier prop&oacute;sito,
modificar el programa o redistribuir el programa original o el
modificado (sin pago o restricciones sobre a quien le puedan entregar
el programa). Aquellos que utilizan el t&eacute;rmino &quot;software
de fuente abierta&quot; (open source software) tienen a emfatizar las
ventajas t&eacute;cnicas de tal software (como rendimiento o
seguridad), mientras que lo que usan el t&eacute;rmino &quot;software
libre&quot; (free software) tienden a emfatizar la libertad sobre el
control por cualquier otro. Lo opuesto a OSS/FS es el software
&quot;cerrado&quot; o &quot;propietario&quot;. T&eacute;ngase en
cuenta que muchos programas OSS/FS son programas comerciales, de
forma que conviene no cometer el error de llamar al software OSS/FS
software &quot;no-comercial&quot;, y casi no hay programas SS/FS en
el &quot;dominio p&uacute;blico&quot;, de modo que no utilice tampoco
ese t&eacute;rmino.</P>
<P>Algunas direcciones proporcionan unas pocas an&eacute;cdotas sobre
porqu&eacute; deber&iacute;a usted utilizar OSS/FS, pero por mucha
que haya nunca hay suficiente informaci&oacute;n para justificar el
uso de OSS/FS. En su lugar, este documento pone su atenci&oacute;n en
las medidas <I>cuantitativas</I> (tales como experimentos y estudios
de mercado) que muestran porqu&eacute; el uso de productos OSS/FS es,
en algunas circunstancias, una decisi&oacute;n razonable e incluso
superior. Quiero dejar claro que, aunque encuentro muchos motivos
para que me guste el OSS/FS, no soy un furibundo defensor. Yo mismo
utilizo tanto productos propietarios como OSS/FS. Los vendedores de
productos propietarios trabajan tambi&eacute;n muy duro para
encontrar n&uacute;meros que justifiquen su oferta; esta p&aacute;gina
proporciona una ant&iacute;doto utilizable de figuras complejas para
ayudar en la comparaci&oacute;n de estos productos propietarios con
los OSS/FS.</P>
<P>Observerse adem&aacute;s que el objetivo de este documento <I>no</I>
es mostrar que todo el software OSS/FS es mejor que todo el software
propietario. Hay quienes piensan que esto es cierto desde
aproximaciones &eacute;ticas, morales o sociales, pero ning&uacute;n
n&uacute;mero demostrar&iacute;a ese tipo de aproximaci&oacute;n. En
su lugar, simplemente compararemos software com&uacute;nmente usaso
OSS/FS con software propietario com&uacute;nmente usado, para mostrar
que al menos en ciertas situaciones y bajo ciertas medidas, OSS/FS es
al menos tan bueno, si no mejor, que sus competidores propietarios.</P>
<P>Pondremos especial inter&eacute;s en el sistema operativo
GNU/Linux (que algunos abrevian como &quot;Linux&quot;) y el servidor
web Apache, una vez que estos son dos de los m&aacute;s visibles
proyectos OSS/FS. Los compararemos inicialmente con Microsoft
Windows, puesto que Windows tiene una cuota de mercado significativa,
y Microsoft es uno de los defensores m&aacute;s fuertes del software
propietario. Mencionaremos tambi&eacute;n de pasada los sistemas
Unix, aunque la situaci&oacute;n de Unix es m&aacute;s compleja;
muchos sistemas Unix incluyen una cierta porci&oacute;n de
componentes OSS/FS o de software propietario derivado inicialmente de
componentes OSS/FS. Por ello, la comparaci&oacute;n de sistemas Unix
propietarios con sistemas OSS/FS (cuando se examina el sistema
entero) no es un trabajo claro. Tanto Unix como GNU/Linux son
sistemas &quot;de tipo Unix&quot;. El sistema operativo m&aacute;s
reciente de Apple Macintosh (MacOS X) presenta el mismo tipo de
complicaciones; las versiones anteriores de MacOS eran completamente
propietarias, pero el sistema operativo de Apple ha sido
completamente redise&ntilde;ado, de modo que ahora se basa en un
sistema Unix con una sustancial contribuci&oacute;n de programas
OSS/FS. Es m&aacute;s, <A HREF="http://www.opensource.apple.com/">Apple
est&aacute; ahora reforzando abiertamente la colaboraci&oacute;n con
desarrolladores OSS/FS</A>. Incluiremos datos de una serie de a&ntilde;os,
no s&oacute;lo el a&ntilde;o pasado; creo que todos los datos
relevantes deber&iacute;an considerarse cuando se debe tomar una
decisi&oacute;n, en lugar de ignorar arbitrariamente los datos m&aacute;s
ant&iacute;guos, y los datos m&aacute;s antiguos muestran que OSS/FS
tiene una historia con muchos rasgos positivos.</P>
<P>Lo siguiente es la discusi&oacute;n de datos de <A HREF="#market_share">cuota
de mercado</A>, <A HREF="#reliability">estabilidad</A>, <A HREF="#performance">rendimiento</A>,
<A HREF="#scaleability">escalabilidad</A>, <A HREF="#security">seguridad</A>,
and <A HREF="#tco">coste total de propiedad</A>. Cerraremos con una
breve discusi&oacute;n de <A HREF="#non_quantitative">aspectos no
cuantitativos</A>, <A HREF="#fears">temores infundados</A>, <A HREF="#other">otras
direcciones que proporcionan inforaci&oacute;n relacionada</A>, and
<A HREF="#conclusions">conclusiones</A>. 
</P>
<H1>Cuota de Mercado</H1>
<P>Mucha gente piensa que un producto s&oacute;lo es un ganador si
tiene una cuota de mercado significativa. Esto es muy simplista, pero
tiene una base racional: los productos con una gran cuota de mercado
tienen aplicaciones, usuarios entrenados, y mantenimientos que
reducen riesgos futuros. Algunos autores argullen contra OSS/FS o
GNU/Linux que &quot;no forma parte de la corriente mayoritaria&quot;,
que es minoritario, pero tal aseveraci&oacute;n refleja el pasado, no
el presente.<!-- E.G., Computerworld, July 2, 2001, Vol. 35, #27, page 23,
    "Linux is Full of Fanatics, Potential" by Bill Laberis -->
Hay excelentes evidencias de que OSS/FS tiene una cuota de mercado
significativa en numerosos mercados: 
</P>
<OL>
	<LI><P><B>Apache es el 1&ordm; servidor web en la Internet P&uacute;blica,
	y lo ha sido as&iacute; desde Abril de 1996.</B> <A HREF="http://www.netcraft.com/survey">Las
	estad&iacute;sticas de servidores web de Netcraft</A> han mostrado a
	Apache (un servidor web OSS/FS) como dominante del mercado de
	servidores web en la Internet P&uacute;blica desde que Apache se
	convirti&oacute; en el primero de los servidores web en Abril de
	1996. Por ejemplo, en Noviembre de 2001, Netcraft prob&oacute; todos
	los sitios web que pudo encontrar (en total 36.458.394), y encontr&oacute;
	que de todos los sitios que pudo probar, Apache ten&iacute;a un
	56'81 % del mercado, Microsoft ten&iacute;a un 29,74 %, iPlanet
	(antes Netscape) un 3,59 % y Zeus un 2,20 %..<!-- The original Netcraft graphic was too large to correctly view
 or print for many.

 My thanks to Mark Bucciarelli, mark, at easymailings dot com,
 for figuring out how to use "mogrify" to create an easy-to-read result.
 His approach was to get the gif, then do the following:

 $ identify netcraft.gif
 netcraft.gif 806x250+0+0 PseudoClass 8c 8867b GIF 2s

  [250 * 640 / 806 = 198.5]

 $ cp netcraft.gif netcraft640.gif
 $ mogrify -geometry 640x198 netcraft640.gif
 $ mogrify -format png netcraft640.gif

  [touch up legend with different font]
 -->
		</P>
	<P ALIGN=CENTER>Cuota de Mercado de los Principales Servidores Web,
	Agosto 1995 - Noviembre 2001<BR><FONT COLOR="#000080"><A HREF="frozen/netcraft2001.png"><FONT COLOR="#000080"><IMG SRC="frozen/netcraft2001.png" NAME="Imagen1" ALT="Thumbnail graph of market share for top servers across all domains, August 1995 - November 2001" ALIGN=MIDDLE WIDTH=638 HEIGHT=198 BORDER=1></FONT></A></FONT></P>
	<P>M&aacute;s recientemente, Netcraft ha intentado distinguir los
	sitios &quot;inactivos&quot;, puesto que se han instalado muchos
	sitios que son simplemente &quot;ocupadores de espacio&quot;, que no
	est&aacute;n siendo utilizados activamente. Cuando se cuentan sitios
	activos, Apache sale incluso mejor parado: en Noviembre de 2001,
	Apache ten&iacute;a un 61,88 % de los servidores web del mercado,
	Microsoft ten&iacute;a un 26,40 %, iPlanet un 1,48 % y Zeus un 0,04
	%. 
	</P>
	<P ALIGN=CENTER><!-- Original file is at http://www.netcraft.com/survey/Reports/200111/overalld.gif -->Cuota
	de Mercado para Servidores Web Activos, Junio 2000 - Noviembre
	2001<BR><FONT COLOR="#000080"><A HREF="frozen/netcraft-active2001.gif"><FONT COLOR="#000080"><IMG SRC="frozen/netcraft-active2001.gif" NAME="Imagen2" ALT="Active servers across all domains, June 2000 - November 2001" ALIGN=MIDDLE WIDTH=458 HEIGHT=250 BORDER=1></FONT></A></FONT></P>
	<P>Los mismos resultados generales los ha mostrado de forma
	independiente <A HREF="http://www.securityspace.com/s_survey">E-soft</A>
	- su informe publicado el 1 de Julio de 2.001 revis&oacute;
	3,178,197 servidores web, y encontr&oacute; que Apache era el 1&ordm;
	(59.84%), Microsoft IIS 2&ordm; (28.42%). Obviamente, estas figuras
	fluct&uacute;an mensualmente; vea <A HREF="http://www.netcraft.com/survey">Netcraft</A>
	y <A HREF="http://www.securityspace.com/s_survey">E-soft</A> para
	obtener las &uacute;ltimas figuras de revisi&oacute;n. 
	</P>
	<LI><P><B>GNU/Linux es el 2&ordm; sistema operativo sirviendo web en
	la Internet P&uacute;blica (contando por direcci&oacute;n IP), de
	acuerdo al estudio de revisi&oacute;n de Marzo y Junio de 2.001.</B>
	Algunas de las revisiones de <A HREF="http://www.netcraft.com/">Netcraft</A>
	tamb&iacute;en han incluido datos sobre sistemas operativos; dos
	revisioens en 2.001 (las de <A HREF="http://www.netcraft.com/Survey/index-200106.html">Junio
	de 2001</A> y <A HREF="http://www.netcraft.com/Survey/index-200109.html">Septiembre
	de 2001</A>) encontraron que GNU/Linux es el 2&ordm; sistema
	operativo para servidores web cuando se cuentan por direcci&oacute;n
	IP (y ha ido ganando consistentemente cuota de mercado desde Febrero
	de 1.999). Cada conexi&oacute;n a una red accesible al p&uacute;blico
	se da por un n&uacute;mero &uacute;nico llamado direcci&oacute;n IP,
	y esta revisi&oacute;n utiliza las direcciones IP (su revisi&oacute;n
	de servidores web cuenta por nombre, no por direcci&oacute;n IP). Un
	a&ntilde;adido r&aacute;pido: Netcraft da la fecha de su informaci&oacute;n
	basada en las revisiones de servidores web (no en la fecha de
	publicaci&oacute;n), y los &uacute;nicos informes de sistemas
	operativos resumen datos de un mes inicial. As&iacute;, la revisi&oacute;n
	con fecha &quot;Junio de 2001&quot; se public&oacute; en Julio, y
	cubre resultados de revisiones de sistemas operativos de Marzo de
	2.001, mientras que la revisi&oacute;n de fecha &quot;Septiembre de
	2.001&quot; se public&oacute; en Octubre, y cubre los resultados de
	su revisi&oacute;n de Junio de 2.001. Aqu&iacute; tenemos un resumen
	del estudio de Netcraft: 
	</P>
	<TABLE WIDTH=675 BORDER=1 CELLPADDING=2 CELLSPACING=3>
		<COL WIDTH=87>
		<COL WIDTH=111>
		<COL WIDTH=106>
		<COL WIDTH=339>
		<TR BGCOLOR="#bac0ff">
			<TH WIDTH=87>
				<P ALIGN=LEFT><FONT SIZE=2>Grupo de S.O,s</FONT></TH>
			<TH WIDTH=111>
				<P ALIGN=RIGHT><FONT SIZE=2>Porcentaje (Marzo)</FONT></TH>
			<TH WIDTH=106>
				<P ALIGN=RIGHT><FONT SIZE=2>Porcentaje (Junio)</FONT></TH>
			<TH WIDTH=339>
				<P ALIGN=LEFT><FONT SIZE=2>Composici&oacute;n</FONT></TH>
		</TR>
		<TR BGCOLOR="#ccccfe">
			<TD WIDTH=87>
				<P ALIGN=LEFT><FONT SIZE=2><B>Windows</B></FONT></TD>
			<TD WIDTH=111>
				<P ALIGN=RIGHT><FONT SIZE=2>49.2%</FONT></TD>
			<TD WIDTH=106>
				<P ALIGN=RIGHT><FONT SIZE=2>49.6%</FONT></TD>
			<TD WIDTH=339>
				<P ALIGN=LEFT><FONT SIZE=2>Windows 2000, NT4, NT3, Windows 95,
				Windows 98</FONT></TD>
		</TR>
		<TR BGCOLOR="#ccccfe">
			<TD WIDTH=87>
				<P ALIGN=LEFT><FONT SIZE=2><B>[GNU/]Linux</B></FONT></TD>
			<TD WIDTH=111>
				<P ALIGN=RIGHT><FONT SIZE=2>28.5%</FONT></TD>
			<TD WIDTH=106>
				<P ALIGN=RIGHT><FONT SIZE=2>29.6%</FONT></TD>
			<TD WIDTH=339>
				<P ALIGN=LEFT><FONT SIZE=2>[GNU/]Linux</FONT></TD>
		</TR>
		<TR BGCOLOR="#ccccfe">
			<TD WIDTH=87>
				<P ALIGN=LEFT><FONT SIZE=2><B>Solaris</B></FONT></TD>
			<TD WIDTH=111>
				<P ALIGN=RIGHT><FONT SIZE=2>7.6%</FONT></TD>
			<TD WIDTH=106>
				<P ALIGN=RIGHT><FONT SIZE=2>7.1%</FONT></TD>
			<TD WIDTH=339>
				<P ALIGN=LEFT><FONT SIZE=2>Solaris 2, Solaris 7, Solaris 8</FONT></TD>
		</TR>
		<TR BGCOLOR="#ccccfe">
			<TD WIDTH=87>
				<P ALIGN=LEFT><FONT SIZE=2><B>BSD</B></FONT></TD>
			<TD WIDTH=111>
				<P ALIGN=RIGHT><FONT SIZE=2>6.3%</FONT></TD>
			<TD WIDTH=106>
				<P ALIGN=RIGHT><FONT SIZE=2>6.1%</FONT></TD>
			<TD WIDTH=339>
				<P ALIGN=LEFT><FONT SIZE=2>BSDI BSD/OS, FreeBSD, NetBSD, OpenBSD</FONT></TD>
		</TR>
		<TR BGCOLOR="#ccccfe">
			<TD WIDTH=87>
				<P ALIGN=LEFT><FONT SIZE=2><B>Other Unix</B></FONT></TD>
			<TD WIDTH=111>
				<P ALIGN=RIGHT><FONT SIZE=2>2.4%</FONT></TD>
			<TD WIDTH=106>
				<P ALIGN=RIGHT><FONT SIZE=2>2.2%</FONT></TD>
			<TD WIDTH=339>
				<P ALIGN=LEFT><FONT SIZE=2>AIX, Compaq Tru64, HP-UX, IRIX, SCO
				Unix, SunOS 4 y otros</FONT></TD>
		</TR>
		<TR BGCOLOR="#ccccfe">
			<TD WIDTH=87>
				<P ALIGN=LEFT><FONT SIZE=2><B>Other no-Unix</B></FONT></TD>
			<TD WIDTH=111>
				<P ALIGN=RIGHT><FONT SIZE=2>2.5%</FONT></TD>
			<TD WIDTH=106>
				<P ALIGN=RIGHT><FONT SIZE=2>2.4%</FONT></TD>
			<TD WIDTH=339>
				<P ALIGN=LEFT><FONT SIZE=2>MacOS, NetWare, SO,s proprietarios de
				IBM </FONT>
			</TD>
		</TR>
		<TR BGCOLOR="#ccccfe">
			<TD WIDTH=87>
				<P ALIGN=LEFT><FONT SIZE=2><B>Desconocidos</B></FONT></TD>
			<TD WIDTH=111>
				<P ALIGN=RIGHT><FONT SIZE=2>3.6%</FONT></TD>
			<TD WIDTH=106>
				<P ALIGN=RIGHT><FONT SIZE=2>3.0%</FONT></TD>
			<TD WIDTH=339>
				<P ALIGN=LEFT><FONT SIZE=2>SO;s no identificados por el detector
				de Netcraft</FONT></TD>
		</TR>
	</TABLE>
	<P>Mucho depende de lo que quiera medir. Varios de los sistemas BSDs
	(FreeBSD, NetBSD, and OpenBSD) son tambi&eacute;n OSS/FS; de modo
	que al menos una porci&oacute;n del 6.1% de BSD se deber&iacute;a
	a&ntilde;adir al 29,6 % de GNU/Linux para determinar el porcentaje
	de sistemas operativos OSS/FS utilizados como servidores web. De
	esta forma, aproximadamente una tercera parte de los ordenadores
	servidores web utilizan sistemas operativos OSS/FS. Hay adem&aacute;s
	diferencias regionales, por ejemplo, GNU/Linux supera a Windows en
	Alemania, Hungr&iacute;a, Rep&uacute;blica Checa y Polonia.</P>
	<P><!-- I checked these as of November 30, 2001: -->Sitios Web bien
	conocidos que utilizan GNU/Linux incluyen <A HREF="http://uptime.netcraft.com/up/graph/?mode_u=off&amp;mode_w=on&amp;site=www.whitehouse.gov&amp;submit=Examine">the
	White House</A>, <A HREF="http://uptime.netcraft.com/up/graph/?mode_u=on&amp;mode_w=on&amp;site=www.google.com">Google</A>,
	y <A HREF="http://uptime.netcraft.com/up/graph/?mode_u=on&amp;mode_w=on&amp;site=www.rackspace.com">Rackspace</A>.
	Otros sitions web bien conocidos que utilizan otros sistemas
	operativos OSS/FS son, por ejemplo <A HREF="http://uptime.netcraft.com/up/graph/?mode_u=on&amp;mode_w=on&amp;site=www.yahoo.com">Yahoo</A>
	y <A HREF="http://uptime.netcraft.com/up/graph/?mode_u=on&amp;mode_w=on&amp;site=www.sony.co.jp">Sony
	Japan,</A> que usan FreeBSD. 
	</P>
	<P>Si realmente quiere saber la relaci&oacute;n del mercado de
	servidores web entre &quot;Unix y Windows&quot;, lo puede encontrar
	tambi&eacute;n es este estudio. Todos los sistemas operativos
	Windows se han reunido en un &uacute;nico n&uacute;mero, (incluso
	Windows 95/98 y Windows 2000/NT4/NT&middot; se han juntado, aunque
	son fundmentalmente muy diferentes). Una reuni&oacute;n similar de
	los ordenadores Unix produce un total del 44'8 % para sistemas de
	tipo Unix en Marzo de 2.001 (comparado con el 49,2 % de Windows). 
	</P>
	<P>N&oacute;tese que estas figuras prob&aacute;blemente diferir&iacute;an
	mucho si estuviesen basadas en direcciones web en lugar de
	direcciones IP; en tal caso, una clara mayor&iacute;a de direcciones
	web se encuentran en sistemas de tipo Unix. Como establece Netcraft,
	&quot;Aunque Apache corriendo en varios sistemas Unix corre m&aacute;s
	sitios que Windows, Apache est&aacute; fundamentalmente instalado en
	compa&ntilde;&iacute;as de hosting y ISP,s que corren tantos sitios
	como pueden en un &uacute;nico ordenador para ahorrar costes&quot;. 
	</P>
	<LI><P><B>GNU/Linux es el 1&ordm; de los sistemas operativos de
	servidores en la Internet p&uacute;blica (contando por nombre de
	dominio), de acuerdo a una revisi&oacute;n de 1.999 de sitios
	educativos y fundamentalmente europeos.</B> El primer estudio que he
	encontrado que revis&oacute; la penetraci&oacute;n del mercado de
	GNU/Linux es una revisi&oacute;n de <A HREF="http://www.leb.net/hzo/ioscount">Zoebelein
	in April 1999</A>. Esta revisi&oacute;n encontr&oacute; que, del
	total de servidores desplegados en Internet en 1.999 (corriendo al
	menos ftp, news, o http (<A HREF="http://WWW/">WWW</A>)) en una base
	de datos de nombres que &eacute;l utiliz&oacute;, el primer sistema
	operativo era GNU/Linux (con un 28,5 %), con el resto detr&aacute;s.
	Es importante notar que en esa revisi&oacute;n, que es la primera
	que he encontrado que intenta responder a cuestiones de cuota de
	mercado, utiliz&oacute; bases de datos preexistentes de servidores
	de .edu (dominio educativo) y la base de datos RIPE (que cubre
	Europa, Oriente Medio, partes de Asia, y partes de Africa), de forma
	que esto no es realmente una revisi&oacute;n de &quot;todo Internet&quot;
	(por ejemplo, omite &quot;.com&quot; y &quot;.net&quot;). Es una
	cuenta por <I>nombre</I> de dominio (es decir, el texto del nombre
	que se teclea en la barra de direcciones del navegador), en lugar de
	por direcci&oacute;n IP, de forma que esta cuenta es diferente de la
	de Netcraft.com de Junio de 2.001. Adem&aacute;s, este estudio cont&oacute;
	los servidores que proporcionan servicios de ftp y news (y no s&oacute;lo
	servidores web). 
	</P>
	<P>Aqu&iacute; tenemos c&oacute;mo aparecen en el estudio los
	diferentes sistemas operativos:<!-- with others trailing (24.4% for all Windows 95/98/NT
combined, 17.7% for Solaris or SunOS,
15% for the BSD family, and 5.3% for IRIX). -->
		</P>
	<TABLE WIDTH=646 BORDER=1 CELLPADDING=2 CELLSPACING=3>
		<COL WIDTH=96>
		<COL WIDTH=123>
		<COL WIDTH=402>
		<TR BGCOLOR="#bac0ff">
			<TH WIDTH=96>
				<P ALIGN=LEFT>Cuota de Mercado</TH>
			<TH WIDTH=123>
				<P ALIGN=LEFT>Sistema Operativo</TH>
			<TH WIDTH=402>
				<P ALIGN=LEFT>Composici&oacute;n</TH>
		</TR>
		<TR BGCOLOR="#ccccfe">
			<TD WIDTH=96>
				<P><B>GNU/Linux</B></TD>
			<TD WIDTH=123>
				<P ALIGN=RIGHT>28.5%</TD>
			<TD WIDTH=402>
				<P>GNU/Linux</TD>
		</TR>
		<TR BGCOLOR="#ccccfe">
			<TD WIDTH=96>
				<P><B>Windows</B></TD>
			<TD WIDTH=123>
				<P ALIGN=RIGHT>24.4%</TD>
			<TD WIDTH=402>
				<P>Todos los Windows combinados (incluyendo 95, 98, NT)</TD>
		</TR>
		<TR BGCOLOR="#ccccfe">
			<TD WIDTH=96>
				<P><B>Sun</B></TD>
			<TD WIDTH=123>
				<P ALIGN=RIGHT>17.7%</TD>
			<TD WIDTH=402>
				<P>Sun Solaris o SunOS</TD>
		</TR>
		<TR BGCOLOR="#ccccfe">
			<TD WIDTH=96>
				<P><B>BSD</B></TD>
			<TD WIDTH=123>
				<P ALIGN=RIGHT>15.0%</TD>
			<TD WIDTH=402>
				<P>Familia BSD (FreeBSD, NetBSD, OpenBSD, BSDI, ...)</TD>
		</TR>
		<TR BGCOLOR="#ccccfe">
			<TD WIDTH=96>
				<P><B>IRIX</B></TD>
			<TD WIDTH=123>
				<P ALIGN=RIGHT>5.3%</TD>
			<TD WIDTH=402>
				<P>SGI IRIX</TD>
		</TR>
	</TABLE>
	<P>Una porci&oacute;n de la familia BSD es tambi&eacute;n OSS/FS, de
	modo que el total de sistemas operatiovs OSS/FS es incluso mayor; si
	alrededor de 2/3 de los BSD,s son OSS/FS, la cuota total de OSS/FS
	ser&iacute;a alrededor del 40%. Los defensores de los sistemas de
	tipo UNIX notar&aacute;n que la mayor&iacute;a (alrededor del 66%)
	estaban corriendo sistemas UNIX, mientras que s&oacute;lo alrededor
	de un 24 % corr&iacute;an variantes de Microsoft Windows. 
	</P>
	<LI><P><B>GNU/Linux es el 2&ordm; sistema operatiov m&aacute;s
	vendido en 1.999 y 2.000, y el de m&aacute;s r&aacute;pido
	crecimiento.</B> De acuerdo a la <A HREF="http://www.idc.com/itforecaster/itf20000808.stm">revisi&oacute;n
	de Junio de 2.000 de IDC</A> de 1999 licenses, 24% de todos los
	servidores ( contanto tanto servidores de Internet como intranets)
	instalados en 1999 corr&iacute;an GNU/Linux. Windows NT fu&eacute;
	el primero con el 36%; todos los otros UNIX combinados sumaban el
	15%. De nuevo, una vez que algunos de los UNIX son sistemas OSS/FS
	(p.e., FreeBSD, OpenBSD, y NetBSD), el n&uacute;mero de sistemas
	OSS/FS es en realidad mayor de lo que muestran las figuras de
	GNU/Linux. Not&eacute;se que todo depende de lo que se quiera
	contar; 39% de todos los servidores instalados seg&uacute;n la
	revisi&oacute;n eran de tipo UNIX (esto es: 24%+15%), de forma que
	los servidores ``tipo UNIX'' eran en ese momento los primeros en la
	cuota de mercado instalado, una vez que se cuenten juntos GNU/Linux
	y Unix. 
	</P>
	<P>IDC proporcion&oacute; un estudio similar el 17 de Enero de 2001
	titulado <A HREF="http://www.computer.org/computer/homepage/june/ind_trends/index.htm">``Server
	Operating Environments: 2000 Year in Review''</A>.<!-- Neal Leavitt, "Linux: At a Turning Point?", IEEE Computer. -->
	En el servidor, Windows cont&oacute; un 41 % de las ventas de
	sistemas operativos para nuevos servidores del a&ntilde;o 2.000,
	creciendo un 20 % - pero GNU/Linux cont&oacute; un 27% y creci&oacute;
	incluso m&aacute;s r&aacute;pido, un 24%. Otros UNIX principales
	ten&iacute;an un 13%.<!-- Linux figure from "Why Microsoft Is Wary of Open Source" CNet (06/18/01);
      Wilcox, Joe; Shankland, Stephen --><!-- The rest of the figures are from:
 http://www.nwfusion.com/news/2001/0228growth.html John Fontana's
 article quotes interesting information from it.
 I don't have the original study it's quite expensive.

 According to InfoWorld, November 5, 2001, "The Penguin Swoops into the
 OS fray" by P.J. Connolly, IDC reported in September 2001 that the
 market shares for servers in 2000 were: Linux 27%, Windows 41%,
 NetWare 13.8%, major Unix 13.9%, Other 4.3% (includes BSD).
 Note the difference in Novell numbers; the January report claimed
 (to 17%); this isn't important to the discussion.
 The other numbers look like trivial corrections, and since I can't
 reference the September report, I'm using the numbers that everyone
 can obtain (they're almost the same anyway).
 --><!-- An interview with IDC is at:
     http://slashdot.org/interviews/01/06/21/154203.shtml
    Note in particular that IDC does NOT do sponsored market surveys,
    which is ethically far cleaner than Gartner doing a market survey
    sponsored by Microsoft.  IDC, at least, doesn't have a conflict
    of interest.
 -->
		</P>
	<P>Este tipo de datos (y los datos proporcionados por TCO m&aacute;s
	tarde) han inspirado exclamaciones como esta del director de TI el
	12 de Noviembre de 2.001: <A HREF="http://www.it-director.com/article.php?id=2332">``Linux
	en el escritorio est&aacute; demasiado verde para utilizarlo, pero
	en el servidor ya parece ser imparable.''<!-- "Linux: The Penguin Marches On" Monday 12th November 2001.
 --></A>
		</P>
	<P>Estas medidas <I>no </I>miden todos los sistemas instalados
	durante el a&ntilde;o: algunos sistemas Windows no han sido pagados
	(pues ha sido ilegalmente pirateados), y los sistemas OSS/FS como
	GNU/Linux y BSD,s son en ocasiones descargados e instalador en
	m&uacute;ltiples sistemas (dado que es legal y libre hacerlo). 
	</P>
	<LI><P><B>Un estudio de Evans Data publicado en Noviembre de 2.001
	encontr&oacute; que el 48.1% de los desarrolladores internacionales
	y el 39.6% de los norteamericanos planean dirigir la mayor&iacute;a
	de sus aplicaciones a GNU/Linux.</B> La <A HREF="http://www.businesswire.com/cgi-bin/f_headline.cgi?bw.111301/213170209"><I>edici&oacute;n
	de Noviembre de 2.001 de la Serie de Estudios del Desarrollo
	Internacional de Evans Data</I></A> inform&oacute; tras entrevistas
	personales con m&aacute;s de 400 desarrolladores que representan a
	alrededor de 70 paises que cuando se les preguntaba sobre el sistema
	operativo para el que planeaban dirigir la mayor&iacute;a de sus
	aplicaciones en el pr&oacute;ximo a&ntilde;o, el 48,1 % de los
	desarrolladores internacionales y el 39,6 % de los norteamericanos
	indicaron a GNU/Linux. Esto es particularmente sorprendente una vez
	que s&oacute;lo un a&ntilde;o antes, menos de un tercio de la
	comunidad de desarrolladores internacionales estaba escribiendo
	aplicaciones GNU/Linux. El informe tambi&eacute;n indicaba que el
	37,8 % de la comunidad de desarrolladores internacionales y el 33,7
	% de los desarrolladores norteamericanos ya hab&iacute;an escrito
	aplicaciones para GNU/Linux, y que m&aacute;s de la mitad de ellos
	indicaban tener suficiente confianza en GNU/Linux para aplicaciones
	de misi&oacute;n cr&iacute;tica.<!-- No longer working: http://news.cnet.com/news/0-1003-200-1549312.html -->
		</P>
	<LI><P><B>Microsoft financi&oacute; su propia investigaci&oacute;n
	para &quot;demostrar&quot; que GNU/Linux no se estaba usando
	extensamente, pero se ha demostrado que esta investigaci&oacute;n
	estaba seriamente manipulada.</B> Microsoft financi&oacute; un
	<A HREF="http://www.zdnet.com/zdnn/stories/news/0,4586,2772060,00.html">informe
	Dataquest del Gartner Group</A> que indicaba que s&oacute;lo el 8,6
	% de los servidores vendidos en Estados Unidos durante el tercer
	cuarto de 2.000 estaba basado en Linux. Sin embargo, hay serias
	sopechas de que Microsoft, (como financiador de la investigaci&oacute;n)
	hab&iacute;a incentivado la aparici&oacute;n de n&uacute;meros
	bajos, y esto n&uacute;meros difieren claramente de los de la
	investigaci&oacute;n de IDC sobre el mismo tema. Kusnetzky, de IDC,
	coment&oacute; que explicaci&oacute;n sencillamente era que el
	Gartner hab&iacute;a utilizado una definici&oacute;n de &quot;vendido&quot;
	muy limitada: pensaba que el n&uacute;mero era &quot;muy razonable&quot;
	si s&oacute;lo se miran nuevos servidores con Linux, &quot;pero
	nuestra investigaci&oacute;n indica que esta no es la forma en que
	la mayor&iacute;a de los clientes adquieren Linux. Hemos detectado
	que s&oacute;lo un 10 o 15 por ciento de la adopci&oacute;n de Linux
	viene de m&aacute;quinas preinstaladas... porque por cada copia
	pagada de Linux, hay una copia gratu&iacute;ta que puede replicarse
	15 veces&quot;. T&eacute;ngase en cuenta que es muy dificil comprar
	un nuevo ordenador x86 que no tenga un sistema operativo Microsoft
	instalado (Microsoft establece contratos con los fabricantes de
	ordenadores para asegurarse esto), pero eso no indica que sea ese el
	sistema que luego se utilice. Gartner indic&oacute; que hab&iacute;a
	utilizado entrevistas para descontar este problema, pero los
	resultados finales de su investigaci&oacute;n (cuando se comparan
	con los hechos conocidos) sugieren que Gartner no tuvo realmente en
	cuenta ese efecto. Por ejemplo, Gartner indica las ventas de Linux
	en el terreno de las supercomputadoras fueron &quot;cero&quot;. De
	hecho, Linux se emplea ampliamente en el campo de clusters paralelos
	en muchos sitios cient&iacute;ficos, incluyendo un cierto n&uacute;mero
	de sitios de alto perfil. Muchos de esos sistemas se ensamblaron &quot;en
	el sitio&quot;, mostrando que el m&eacute;todo de Gartner de definir
	una &quot;venta&quot; no parece corresponderse con las instalaciones
	que est&aacute;n trabajando. El art&iacute;culo del Register,
	<A HREF="http://www.theregister.co.uk/content/4/19662.html">``Nadie
	est&aacute; usando Linux''</A> (con su compa&ntilde;ero <A HREF="http://www.theregister.co.uk/content/4/19661.html">``90%
	Windows..''</A>) discute este punto m&aacute;s a fondo. En resumen,
	la investigaci&oacute;n financiada por Microsoft muestra n&uacute;meros
	bajos, pero esto n&uacute;meros son muy sospechosos. 
	</P>
	<LI><P><B>GNU/Linux tiene el 80% de ventas de ordenadores cliente
	que MacOS de Apple en 1.999.</B> De acuerdo a la <A HREF="http://www.idc.com/itforecaster/itf20000808.stm">revisi&oacute;n
	de Junio de 2.000 de IDC</A> of 1.999 licencias (5.0% para Mac OS,
	4.1% para GNU/Linux), ya se venden tantas licencias cliente de
	GNU/Linux como de MacOS - y nadie duda de que MacOS es un sistema
	cliente. 
	</P>
	<P>Actualmente, GNU/Linux es un contendiente relativamente nuevo en
	el mercado de sistemas operativos (SO) clientes, y tiene una
	penetraci&oacute;n en el mercado relativamente peque&ntilde;a. Esto
	no deber&iacute;a ser sorprendente: contra la salud de las
	aplicaciones de servidor y de desarrollo, GNU/Linux tiene
	relativamente pocas aplicaciones cliente OSS/FS y muchas de estas
	aplicaciones a&uacute;n est&aacute;n madurando. Hay aplicaciones
	cliente comerciales (como el Word Perfect de Corel), pero no son
	OSS/FS, y est&aacute;n disponibles tambi&eacute;n en otras
	plataformas. Sin fuertes aplicaciones cliente OSS/FS,
	particularmente una suite ofim&aacute;tica, GNU/Linux no tiene una
	fuerte ventaja sobre otras plataformas clientes. Despu&eacute;s de
	todo, GNU/Linux combinado con una suite ofim&aacute;tica propietaria
	pierde la libertad y el bajo coste de simplemente un sistema OSS/FS,
	y tiene que competir con los sistemas propietarios establecidos que
	tienen m&aacute;s aplicaciones utilizables en su entorno. Microsoft
	Office es esencialmente un monopolio que controla la arena de las
	suite ofim&aacute;ticas, y no est&aacute; disponible en GNU/Linux
	(la segunda mayor de las suites ofim&aacute;ticas es Corel, y una
	vez que Corel es parcialmente propiedad de Microsoft, Corel ya no se
	puede considerar realmente un competidor para Microsoft). Varias
	aplicaciones ofim&aacute;ticas OSS/FS est&aacute;n ahora mismo
	madurando, (como StarOffice / <A HREF="http://www.openoffice.org/">OpenOffice</A>),
	y las alternativas incluyen AbiWord, Gnumeric, y la suite KOffice.
	Adem&aacute;s, el coste del cambio a todos estos escritorios adem&aacute;s
	de los problemas de compatibilidad con un monopolio atrincherado
	hace dificil utilizar nada que no sea Windows y Office en los
	clientes. 
	</P>
	<P>Sin embargo, a pesar de la debilidad de aplicaciones clientes
	OSS/FS en varias &aacute;reas clave en este momento, <A HREF="http://news.cnet.com/news/0-1003-200-1546430.html">an
	IDC study</A> determi&oacute; que GNU/Linux captur&oacute; un 4 %
	del mercado en 1.999. De forma m&auml;s general, IDC determin&oacute;
	que se vendieron 98,6 millones de sistemas operativos clientes en
	1.999, de los cuales Windows 3.x, 95 y 98 juntar&oacute;n un 66 %,
	Windows NT un 21 %, MacOS un 5% y GNU/Linux un 4%. 
	</P>
	<P>Hay algunas indicaciones interesantes de que esto puede cambiar
	en el futuro. Algunas organizaciones, como <A HREF="http://desktoplinux.com/articles/AT9664091996.html">TrustCommerce</A>
	y la <A HREF="http://www.consultingtimes.com/Largo.html">ciudad de
	Largo, Florida</A>, informan que han cambiado con &eacute;xito a
	Linux en el escritorio. Ser&aacute; interesante ver si estos n&uacute;meros
	empiezan a cambiar en 2002-2004, cuando las anteriormente
	mencionadas aplicaciones clientes OSS/FS (como <A HREF="http://www.abisource.org/">AbiWord</A>
	y OpenOffice) empezar&aacute;n a rivalizar con sus aplicaciones
	propietarios rivales tanto en usabilidad como en la funcionalidad
	que los usuarios necesitan. Hay ya algunas evidencias de que otros
	han anticipado tambi&eacute;n esto: <A HREF="http://www.silicon.com/bin/bladerunner?30REQEVENT=&amp;REQAUTH=21046&amp;14001REQSUB=REQINT1=45449">Richard
	Thwaite, director de TI de Ford Europa, indic&oacute; en 2.001 que
	su objetivo era un escritorio open source, y que estaba esperando a
	la industria para migrar eventualmente a &eacute;l</A> (el controla
	33.000 escritorios, de modo que este no ser&iacute;a un movimiento
	trivial). Se podr&iacute;a argumentar que esto es s&oacute;lo &quot;un
	farol&quot; en su negociaci&oacute;n con Microsoft - pero esos
	&quot;faroles&quot; s&oacute;lo funcionan si son creibles. 
	</P>
	<LI><B>Las empresas planean incrementar su uso de GNU/Linux</B>. Un
	estudio de Zona Research encontr&oacute; que m&aacute;s de la mitad
	de las los que respondieron en nombre de grandes empresas esperaban
	esperaban incrementar el n&uacute;mero de los usuarios de GNU/Linux
	en sus firmas hasta en un 25%, mientras que cerca de un 20%
	esperaban incrementarlos en m&aacute;s de un 50 %. En peque&ntilde;as
	compa&ntilde;ias, m&aacute;s de un terci&oacute; indic&oacute; que
	el uso de GNU/Linux deber&iacute;a expandirse un 50 %. Los factores
	m&aacute;s importantes identificados que justificaban estas
	decisiones eran la estabilidad, el bajo precio, la velocidad de las
	aplicaciones y la escalabilidad. Aqu&iacute; est&aacute;n los
	n&uacute;meros: 
	<CENTER>
		<TABLE BORDER=1 CELLPADDING=2 CELLSPACING=2>
			<TR BGCOLOR="#bac0ff">
				<TH>
					<P>Uso esperado de GNU/Linux</TH>
				<TH>
					<P>Peque&ntilde;as empresas</TH>
				<TH>
					<P>Medianas empresas</TH>
				<TH>
					<P>Grandes empresas</TH>
				<TH>
					<P>Total</TH>
			</TR>
			<TR BGCOLOR="#ccccfe">
				<TH>
					<P>Incremento del 50%</TH>
				<TD>
					<P ALIGN=CENTER>21.0%</TD>
				<TD>
					<P ALIGN=CENTER>16%</TD>
				<TD>
					<P ALIGN=CENTER>19.0%</TD>
				<TD>
					<P ALIGN=CENTER>19%</TD>
			</TR>
			<TR BGCOLOR="#ccccfe">
				<TH>
					<P>Incremento del 10-25%</TH>
				<TD>
					<P ALIGN=CENTER>30.5%</TD>
				<TD>
					<P ALIGN=CENTER>42%</TD>
				<TD>
					<P ALIGN=CENTER>56.5%</TD>
				<TD>
					<P ALIGN=CENTER>44%</TD>
			</TR>
			<TR BGCOLOR="#ccccfe">
				<TH>
					<P>Sin crecimiento</TH>
				<TD>
					<P ALIGN=CENTER>45.5%</TD>
				<TD>
					<P ALIGN=CENTER>42%</TD>
				<TD>
					<P ALIGN=CENTER>24.5%</TD>
				<TD>
					<P ALIGN=CENTER>36%</TD>
			</TR>
			<TR BGCOLOR="#ccccfe">
				<TH>
					<P>Reducci&oacute;n</TH>
				<TD>
					<P ALIGN=CENTER>3.0%</TD>
				<TD>
					<P ALIGN=CENTER>0%</TD>
				<TD>
					<P ALIGN=CENTER>0%</TD>
				<TD>
					<P ALIGN=CENTER>1%<!-- (tr)(th)Sample Size(br)(# businesses)(/th)(td)33(/td)(td)31(/td)(td)44(/td)(td)108(/td)(/tr)
 --></TD>
			</TR>
		</TABLE>
	</CENTER>
	<P>Se puede ver m&aacute;s sobre este estudio en <A HREF="http://www.zdnet.com/eweek/stories/general/0,11011,2651826,00.html">``La
	Nueva Religion: Linux y el Open Source''</A> (ZDNet) y en el
	art&iacute;culo de 5 de Febrero de 2.001 de InfoWorld ``Linux
	ilumina la empresa: Pero amenaza la estabilidad de los venedores de
	SO.''<!-- "Linux lights up enterprise: But concerns loom about OS vendor
profitability."  by Ed Scannell and Dan Neel.
InfoWorld, February 5, 2001. Page 8. Published by IDG, San Mateo, CA. -->
		</P>
	<LI><P><B>Los 1000 mayores Proveedores de Servicios de Internet
	esperan que el uso de GNU/Linux se incremente un 154%, de acuerdo
	con un estudio de Idaya's realizado entre Enero y Marzo de 2.001.<!-- Expired from http://biz.yahoo.com/prnews/010403/lntu009.html --></B>
	Un <A HREF="http://www.idaya.co.uk/news/newsdesk/press_releases.phtml?">estudio</A>
	realizado por <A HREF="http://www.idaya.co.uk/">Idaya</A> de los
	1000 mayores PSI,s encontr&oacute; que ellos esperan un crecimiento
	del usho de GNU/Linux de hasta un 154% en 2.001. Adem&aacute;s, casi
	dos tercios (64%) de los PSI,s consideran que el software open
	source lider cumple con los est&aacute;ndares requeridos para
	aplicaciones de nivel empresarial, comparable con el software
	propietario. Idaya produce software OSS/FS, lo que se debe mantener
	en mente como un sesgo potencial. 
	</P>
	<LI><P><B>IBM encontr&oacute; un incremento del 30% en el n&uacute;mero
	de aplicaciones de nivel empresarial para GNU/Linux en el primer
	semestre de 2.001.</B> Durante alg&uacute;n tiempo, era com&uacute;n
	exclamar ``No hay suficientes aplicaciones que corran en GNU/Linux''
	para un uso de nivel empresarial. Sin embargo, <A HREF="http://www.businesswire.com/cgi-bin/f_headline.cgi?bw.062701/211782585&amp;ticker=IBM">IBM
	encontr&oacute; que hay m&aacute;s de 2.300 aplicaciones GNU/Linux
	(un incremento del 30% en 6 meses)</A> disponibles en IBM y los
	vendedores independientes de software l&iacute;deres (ISVs).<!-- "IBM And Business Partners Celebrate Milestone in Growth of Linux Applications; Linux Applications Increase More Than 30 Percent", June 27, 2001,
BusinessWire.com. -->
	Un <A HREF="http://www.networkcomputing.com/1224/1224f1.html">Informe
	especial sobre Inform&aacute;tica en Redes en Linux para la Empresa</A>
	discute algunos de los punto s fuertes de GNU/Linux, y encuentra
	muchas cosas positivas que decir sobre GNU/Linux para aplicaciones
	empresariales. 
	</P>
	<LI><B>Un estudio de 2.001 mostro que el 46.6% de los profesionales
	de TI consideraban que sus organizaciones deber&iacute;an soportar
	GNU/Linux, una figura mayor que cualquier otro SO excepto Windows.</B>
	Un <A HREF="http://www.zdnet.com.au/newstech/os/story/0,2000024997,20261699,00.htm">estudio
	de TechRepublic Research titulado <I>Benchmarks, Trends, and
	Forecasts: Linux Report</I></A> encontr&oacute; que ``el soporte de
	Linux corre sorprendentemente profundo'' cuando se estudia a los
	profesionales de TI y se les pregunta confidencialmente si sus
	organizaciones deber&iacute;an soportar varios sistemas operativos.
	Dada la dominancia de Windows en el mercado del escritorio, no es
	sorprendente que la mayor&iacute;a de ellos considere que sus
	organizaciones deber&iacute;an soportar varias versiones de Windows
	(para Windows NT, la proporci&oacute;n era un 90 %, para Windows
	2000 un 81,6 %). Sin embargo, GNU/Linux aparec&iacute;a el tercero,
	con un 46,4 %; &iexcl;alrededor de la mitad de los preguntados
	respondi&oacute; que sus organizaciones estaban ya confiando en su
	capacidad de soportar GNU/Linux! Esto es especialmente sorprendente
	porque GNU/Linux sustituye a otros productos bien conocidos con
	mayores historiales, incluyendo UNIX (42,1 %), Novell Netware (39,5
	%), Sun Solares (25,7 %) y Apple (13,6 %). TechRepublic suger&iacute;a
	que hay varias razones para estos resultados sorprendentemente
	altos: 
	<UL>
		<LI>GNU/Linux se considera una tecnolog&iacute;a ascendente: muchos
		profesionales de TI est&aacute;n ya estudiandolo y aprendiendo como
		utilizarlo, asumiendo que ser&aacute; un producto asumible por el
		mercado en un futuro pr&oacute;ximo.<LI>
		Muchos profesionales de TI ya usan GNU/Linux en sus hogares, dando
		a GNU/Linux una entrada en las organizaciones profesionales.<LI><P>
		Puesto que GNU/Linux es similar a UNIX, los profesionales de TI que
		ya est&aacute;n formados en UNIX pueden f&aacute;cilmente
		actualizarse a GNU/Linux. 
		</P>
	</UL>
	<P>TechRepublic sugiere que los ejecutivos de TI deber&iacute;an
	inventariar los conocimientos de sus plantillas, porque podr&iacute;an
	descubrir que sus organizaciones ya pueden soportar GNU/Linux, si es
	que no lo est&aacute;n usando a&uacute;n. 
	</P>
	<LI><P><B>Sendmail, un programa OSS/FS, es el servidor de correo
	l&iacute;der.</B> Un <A HREF="http://cr.yp.to/surveys/smtpsoftware6.txt">estudio
	realizado entre el 2001-09-27 y 2001-10-03 por D.J. Bernstein de un
	mill&oacute;n de direcci&oacute;nes IP aleatorias</A> se conect&oacute;
	con &eacute;xito a 958 servidores SMTP (email) -esos servidores
	tambi&eacute;n se conocen como agentes de transporte de correo, o
	MTA,s-. Bernstein encontr&oacute; que Sendmail sobre UNIX ten&iacute;a
	la mayor cuota de mercado (42% de todos los servidores de correo),
	seguido de Windows Microsoft Exchange (18%), UNIX qmail (17%),
	Windows Ipswitch IMail (6%), UNIX smap (2%), UNIX Postfix (antes
	conocido por VMailer, 2%) y Unix Exim (1%). Tengase en cuenta que
	Bernstein implementa uno de los competidores de Sendmail (qmail), de
	modo que se encuentra &quot;desincentivado&quot; para identificar la
	cuota de mercado de Sendmail. Qmail no es OSS/FS, porque los
	<A HREF="http://openacs.org/about/licensing/open-source-licensing">derivados
	de Qmail no se pueden redistribuir libremente</A>; Qmail es ``fuente
	visible'', por lo que algunas personas est&aacute;n confundidas al
	creer que Qmail es OSS/FS. Sin embargo, Sendmail, Postfix, y Exim
	<I>son</I> OSS/FS. Por ello, no s&oacute;lo es el programa lider
	(Sendmail) OSS/FS, sino que los programas OSS/FS tienen m&aacute;s
	del doble de las instalaciones que sus m&aacute;s inmediatos
	competidores.<!-- Qmail's redistribution license is given in:
       http://qmail.goof.com/top.html
 it's discussed in:
      http://openacs.org/about/licensing/open-source-licensing
 Qmail License noted:
             http://zgp.org/pipermail/linux-elitists/2000-March/000298.html
 Example of confusion:
             http://www.isp-planet.com/equipment/qmail-a.html
 --><!-- Clearly sendmail is common, but there seems to be variance on how
     common it is, and the surveys available don't give enough data to
     be confident in their results (how was the survey conducted, etc.)?
     Lots of people say sendmail is "80%" or "75%",
     but without referencing someone
     who's actually done a survey (including giving a survey date).
     I suspect some of these figures were guessed.
  The Radicati Group performed a survey and found that in 1999,
  {a href="http://www8.techmall.com/techdocs/TS991203-4.html"}
  sendmail had 64% market share of messaging software for service providers{/a}.
  {a href="http://www.activemedia-guide.com/messoft_mrkt.htm"}Another
  survey of ISPs claims that sendmail had 75% of the market in 1999{/a},
  though the source of this data isn't clear.
  Other papers report 80% market shares
  http://release1.edventure.com/Issues/1198.pdf
  and/or that 90% of all email traffic passes through sendmail
  http://www.vita.com/vso/vso200005/MITRE/opensw.pdf

  It APPEARS that many of these are quoting old surveys done by Bernstein;
  see his web pages for more.  An old survey of his showed 80% of all
  SMTP servers running Sendmail, but that's an old survey, and I agree
  with Bernstein that it's unfair to quote REALLY old surveys when more
  recent data is available.
 -->
		</P>
	<LI><P><B>Una investigaci&oacute;n durante el segundo cuarto del a&ntilde;o
	2.000 encontr&oacute; que el 95 % de los servidores de nombres de
	dominio (DNS) de revisi&oacute;n inversa utilizaban bin, un producto
	OSS/FS.</B> Internet se compone d muchos componentes de
	infraestructura mayormente invisibles. Esto incluye a los servidores
	de nombres de dominios (DNS), que toman los nombres de m&aacute;quina
	legibles por las personas (como &quot;yahoo.com&quot;), y los
	traducen en sus direcciones num&eacute;ricas. Las m&aacute;quinas
	p&uacute;blicamente accesibles generalmente tambi&eacute;n soportan
	&quot;revisi&oacute;n inversa&quot;, lo que convierte direcciones
	num&eacute;ricas en nombres; por razones hist&oacute;ricas, esto se
	implement&oacute; utilizando el dominio oculto &quot;in-addr.arpa&quot;.
	Investigando el dominio in-addr, se puede estudiar el interior de
	c&oacute;mo est&aacute; soportado Interent. <A HREF="http://www.isi.edu/~bmanning/in-addr-versions.html">Bill
	Manning ha revisado el dominio in-addr</A> y ha encontrado que el 95
	% de todos los servidores de nombres (en el segundo cuarto de 2.000)
	realizan esta importante tarea de infraestructura de internet
	utilizan alguna versi&oacute;n de &quot;bind&quot;. Bind es un
	programa OSS/FS. 
	</P>
</OL>
<H1>Estabilidad</H1>
<P>Hay un mont&oacute;n de hist&oacute;rias an&eacute;cdoticas sobre
que el OSS/FS es m&aacute;s estable, pero al finalmente tambi&eacute;n
hay datos cuantitativos que confirman que los programas OSS/FS son
m&aacute;s estables:</P>
<OL>
	<LI><P><B>Las aplicaciones equivalentes OSS/FS son m&aacute;s
	estables, de acuerdo a un estudio de 1995.</B> El documento de 1.995
	<A HREF="http://www.cs.wisc.edu/~bart/fuzz/fuzz.html">``Fuzz
	Revisited''</A> midi&oacute; la estabilidad enviando a los programas
	caracteres aleatorios y determinando cuales resist&iacute;an a las
	caidas y los bloqueos. Algunos investigadores rechazan estas
	medidas, indicando que esta aproximaci&oacute;n es incapaz de
	encontrar fallos sutiles, pero los autores del estudio hacen notar
	que su aproximaci&oacute;n a&uacute;n se maneja para encontrar
	muchos errores en software en producci&oacute;n, y es una
	herramienta utilizable para encontrar fallos en el software. 
	</P>
	<P>OSS/FS tiene mayor estabilidad seg&uacute;n estas medidas. Se
	indica en la secci&oacute;n 2.3.1 que: 
	</P>
	<BLOCKQUOTE><P>Es tambi&eacute;n interesante comparar los resultados
	de probar los sistemas comerciales con los resultados de probar
	&quot;software libre&quot; GNU y Linux. Los siete sistemas
	comerciales en el estudio de 1.995 tuvieron un promedio de fallos
	del 23 %, mientras que Linux tuvo un promedio de fallos del 9 %, y
	las utilidades GNU tuvieron un promedio de fallos de s&oacute;lo el
	6 %. Es razonable preguntar porqu&eacute; un grupo de programadores
	globalmente dispersos, sin soporte de pruebas formales o estandares
	de ingenier&iacute;a del software puede producir c&oacute;digo que
	es m&aacute;s estable (al menos, seg&uacute;n nuestras medidas) que
	el c&oacute;digo producido comercialmente. Incluso si se consideran
	s&oacute;lo las utilizadas que estaban utilizables en GNU o Linux,
	el promedio de fallos para estos dos sistemas era mejor que en otros
	sistemas. 
	</P></BLOCKQUOTE>
	<LI><P>Hay evidendia de que las aplicaciones Windows NT tienen
	similar establidad a las del software propietario UNIX (es decir,
	menos estable que el software OSS/FS). Un documento posterior, <A HREF="http://www.cs.wisc.edu/~bart/fuzz/fuzz.html">``Un
	Estudio Emp&iacute;rico de la Robustez de las Aplicaciones de
	Windows NT Utilizando Pruebas Aleatorias''</A>, encontr&oacute; que
	con aplicaciones gr&aacute;ficas Windows NT, abortaban el 21 % de
	las aplicaciones que probaban, fallaban un 24 % adicional de las
	aplicaciones, y abortaban o fallaban <I>todas </I>las aplicaciones
	que probaban cuando las somet&iacute;an a mensajes Win32 aleatorios.
	Con ello, no hay evidencias de que el software Windows sea m&aacute;s
	estable que el OSS/FS seg&uacute;n esta medida. 
	</P>
	<P>Aunque este experimento se realiz&oacute; en 1.995, nada indica
	que el software propietario se haya vuelto mucho mejor que los
	programas OSS/FS desde entonces. En su lugar, puesto que desde 1.995
	se ha incrementado el inter&eacute;s y la participaci&oacute;n en
	OSS/FS, resulta que cada vez m&aacute;s &quot;ojos avizores&quot;
	est&aacute;n examinando e incrementando la estabilidad de los
	programas OSS/FS. 
	</P>
	<P>Y ahora seamos cuidadosos: OSS/FS no es una varita m&aacute;gina:
	&iexcl;el software beta de cualquier tipo siempre contendr&aacute;
	errores! Sin embargo, el experimento de 1.995 midi&oacute; programas
	OSS/FS maduros con programas propietarios maduros, y el software
	OSS/FS era m&aacute;s estable bajo estas medidas. 
	</P>
	<LI><P><B>GNU/Linux es m&aacute;s estable que Windows NT, seg&uacute;n
	un experimento de 10 meses de ZDnet .</B> <A HREF="http://www.zdnet.com/sp/stories/issue/0,4537,2387282,00.html">ZDnet
	corri&oacute; una prueba de 10 meses de estabilidad</A> comparando
	Caldera Systems OpenLinux, Red Hat Linux, y Microsoft's Windows NT
	Server 4.0 con Service Pack 3. Los tres utilizaron hardware identico
	(de una CPU), y se enviaron en paralelo a cada servidor
	requerimientos de red solicitando servicios de Internet estandar, de
	ficheros y de impresi&oacute;n. El resultado: NT abortaba un
	promedio de una vez cada seis semanas, llevandose alrededor de 30
	minutos para corregirlo; eso no es malo, pero mientras tanto, <I>ning&uacute;n
	servidor GNU/Linux cayo. </I>Este art&iacute;culo de Zdnet tambi&eacute;n
	hace un buen trabajo identificando las debilidades de GNU/Linux (es
	decir, las aplicaciones de escritorio y el multiprocesamiento
	sim&eacute;trico paralelo -SMP- masivo). 
	</P>
	<LI><P><B>GNU/Linux es m&aacute;s estable que Windows NT, de acuerdo
	a un experimento de un a&ntilde;o de Bloor Research.</B> <A HREF="http://gnet.dhs.org/stories/bloor.php3">Bloor
	Research</A> tuvo ambos sistemas operativos corriendo en m&aacute;quinas
	Pentim relativamente ant&iacute;guas. En el espacio de un a&ntilde;o,
	GNU/Linux abort&oacute; una vez a causa de un fallo de hardware
	(problemas con el disco), que proboc&oacute; 4 horas de reparaci&oacute;n,
	dando una disponibilidad medida del 99,95 %. Windows NT abort&oacute;
	68 veces, causadas por problemas de hardware (discos), memoria (26
	veces), mantenimiento de ficheros (8 veces), y una cantidad de
	problemas aislados (33 veces). Todo ello necesito 65 horas para
	corregirse, dando una disponibilidad del 99,26 %. Es intrigante que
	el &uacute;nico problema GNU/Linux y una cantidad de los problemas
	de Windows NT estaban relacionados con el hardware; ser podria
	arg&uuml;ir que el hardware de que dispon&iacute;a Windows era peor,
	o se podr&iacute;a arg&uuml;ir que GNU/Linux hizo un mejor trabajo
	evitando o conteniendo los fallos de hardware. En cualquier caso ,
	los fallos del mantenimiento de ficheros se pueden asignar a
	Windows, y los &quot;problemas aislados&quot; parecen ser causados
	tambi&eacute;n por Windows, indicando que GNU/Linux es m&aacute;s
	estable que Windows. Gnet resumi&oacute; esto diciendo &quot;el
	ganador era cl&aacute;ramente Linux&quot;. 
	</P>
	<LI><B>Las direcciones de Internet que utilizan Microsoft IIS como
	servidor web tienen m&aacute;s del doble de tiempo fuera de servicio
	(en promedio), que las direcciones que utilizan el software Apache,
	seg&uacute;n una evaluaci&oacute;n suiza de tres meses.</B> Esos son
	los resultados de un <A HREF="http://www.syscontrol.ch/e/news/Serversoftware.html">an&aacute;lisis
	de Syscontrol AG analisis sobre tiempo de funcionamiento de sitios
	web (anunciado el 7 de Febrero de 2.000)</A> Ellos midieron m&aacute;s
	de 100 direcciones suizas populares durante un periodo de tres
	meses, comprobando desde 4 direcciones diferentes cada 5 minutos
	(&iexcl;hubiera sido interesante saber qu&eacute; hubiese ocurrido
	con una muestra mayor!) Se puede <A HREF="http://www.syscontrol.ch/e/SWePIX/SWePIXe.html">ver
	su informe (en alem&aacute;n)</A>, o una <A HREF="http://babelfish.altavista.com/translate.dyn?doit=done&amp;lp=de_en&amp;bbltype=urltext&amp;url=http://www.syscontrol.ch/e/SWePIX/SWePIXe.html">traducci&oacute;n
	de Babelfish (autom&aacute;tica) del informe al ingl&eacute;s</A>.<!-- Now, reliability depends on an entire system, not just the web server
program, but it's worth noting that Microsoft IIS only works on Windows
(so you know what you have!).
In contrast, while Apache can run on Windows,
until recently this was experimental and thus Apache is far more likely to
be running on a Unix-like box.
Besides, if you buy the necessary expensive licenses from Microsoft to
run a commercial web site, IIS is ``free''; this suggests that
an Apache site is extremely likely to be a Unix-like site.
 --><!-- the German is ``Durchschnittliche Ausfalldauer in Std. pro Servertyp'' --><!-- I downloaded this 15-Sep-2000; they may have new numbers now -->
	Aqu&iacute; est&aacute; su juego completo de datos publicados sobre
	&quot;tiempo de caida promedio por hora y por tipo de servidor&quot;,
	m&aacute;s un promedio de 3 meses que yo he medido por mis propios
	medios:<!-- Andere means "Other" in German --> 
	<TABLE WIDTH=392 BORDER=1 CELLPADDING=2 CELLSPACING=3>
		<COL WIDTH=96>
		<COL WIDTH=60>
		<COL WIDTH=73>
		<COL WIDTH=73>
		<COL WIDTH=50>
		<TR BGCOLOR="#bac0ff">
			<TD WIDTH=96>
				<P><B>Tiempo de Caida</B></TD>
			<TD WIDTH=60>
				<P ALIGN=RIGHT><B>Apache</B></TD>
			<TD WIDTH=73>
				<P ALIGN=RIGHT><B>Microsoft</B></TD>
			<TD WIDTH=73>
				<P ALIGN=RIGHT><B>Netscape</B></TD>
			<TD WIDTH=50>
				<P ALIGN=RIGHT><B>Otros</B></TD>
		</TR>
		<TR BGCOLOR="#ccccfe">
			<TD WIDTH=96>
				<P><B>Septiembre</B></TD>
			<TD WIDTH=60>
				<P ALIGN=RIGHT>5.21</TD>
			<TD WIDTH=73>
				<P ALIGN=RIGHT>10.41</TD>
			<TD WIDTH=73>
				<P ALIGN=RIGHT>3.85</TD>
			<TD WIDTH=50>
				<P ALIGN=RIGHT>8.72</TD>
		</TR>
		<TR BGCOLOR="#ccccfe">
			<TD WIDTH=96>
				<P><B>Octubre</B></TD>
			<TD WIDTH=60>
				<P ALIGN=RIGHT>2.66</TD>
			<TD WIDTH=73>
				<P ALIGN=RIGHT>8.39</TD>
			<TD WIDTH=73>
				<P ALIGN=RIGHT>2.80</TD>
			<TD WIDTH=50>
				<P ALIGN=RIGHT>12.05</TD>
		</TR>
		<TR BGCOLOR="#ccccfe">
			<TD WIDTH=96>
				<P><B>Noviembre</B></TD>
			<TD WIDTH=60>
				<P ALIGN=RIGHT>1.83</TD>
			<TD WIDTH=73>
				<P ALIGN=RIGHT>14.28</TD>
			<TD WIDTH=73>
				<P ALIGN=RIGHT>3.39</TD>
			<TD WIDTH=50>
				<P ALIGN=RIGHT>6.85</TD>
		</TR>
		<TR BGCOLOR="#ccccfe">
			<TD WIDTH=96>
				<P><B>Promedio</B></TD>
			<TD WIDTH=60>
				<P ALIGN=RIGHT>3.23</TD>
			<TD WIDTH=73>
				<P ALIGN=RIGHT>11.03</TD>
			<TD WIDTH=73>
				<P ALIGN=RIGHT>3.35</TD>
			<TD WIDTH=50>
				<P ALIGN=RIGHT>9.21</TD>
		</TR>
	</TABLE>
	<P>No es dificil notar que Apache (el servidor web OSS) tiene los
	mejores resultados en el promedio de los tres meses (y con mejores
	resultados en el tiempo, tambi&eacute;n). Especialmente, el peor m&eacute;s
	de Apache es mejor que el mejor mes de Microsoft. Creo que la
	diferencia entre Apache y Netscape es estad&iacute;sticamente
	insignificante, pero tambi&eacute;n muestra que la soluci&oacute;n
	OSS/FS l&iacute;bremente disponible (Apache) muestra una estabilidad
	al menos tan buena como la m&aacute;s estable de las soluciones
	propietarias. El informe tambi&eacute;n hace notar que esto no debe
	ser s&oacute;lo consecuencia de la estabilidad del software, puesto
	que varias direcciones Microsoft IIS muestran peque&ntilde;as
	interrupciones en el mismo perios del d&iacute;a (sugiriendo
	rearranques regulares). Sin embargo, esto a&uacute;n mantiene la
	cuesti&oacute;n:: &iquest;proqu&eacute; las direcciones con IIS
	requieren muchos m&aacute;s rearranques regulares que las
	direcciones con Apache? Cada parada, incluso si es planeada, resulta
	en una p&eacute;rdida del servicio (y para direcciones dedicadas al
	comercion electr&oacute;nico, una potencial p&eacute;rdida de
	ventas).. 
	</P>
	<LI><P><B>De acuerdo con un estudio separado de &uacute;tima hora de
	Netcraft, al OSS/FS le va muy bien: seg&uacute;n mostraba el 3 de
	Agosto de 2.001, de las 50 direcciones con mayor tiempo de
	funcionamiento continuado, el 92 % utilizan Apache, y el 50 %
	utilizan un sistema operativo OSS/FS.</B> Netcraft mantiene un
	ranking de las 50 direcciones m&aacute;s requeridad con los mayores
	peridos de funcionamiento continuado en <A HREF="http://uptime.netcraft.com/">http://uptime.netcraft.com</A>.
	Estudiando el informe de <A HREF="http://www.dwheeler.com/frozen/top.avg.2001aug3.html">3
	de Agosto de 2.001</A>, observo que el 92 % (46/50) de estas
	direcciones utilizan Apache, uno de los servidores web era
	desconocido, y los otros tres no eran Apache. De estos tres, s&oacute;lo
	uno informaba ser Microsoft IIS, y a&uacute;n este era sospechoso,
	ya que indicaba que sus sistema operativo era BSD/OS (esta aparente
	inconsistencia puede explicarse de varias maneras, por ejemplo con
	la existencia de un front-end BSD/OS que &quot;enmascara&quot; al
	servidor web IIS, o bien porque el servidor web est&aacute;
	ocultando su verdadera identidad para confundir a los atacantes). En
	esta muestra, el 50 % (25/50), corr&iacute;an en un sistema
	operativo de fuente abierta (open source), y s&oacute;lo sistemas
	operativos de tipo UNIX ten&iacute;as estas periodos de
	funcionamiento continuado mayores (ning&uacute;n sistema Windows
	aparece en esta clasificaci&oacute;n) (N.d.T. Se pueden observar
	resultados muy parecidos, en el momento de traducir este mismo
	documento, si vemos <A HREF="http://uptime.netcraft.com/up/today/top.avg.html">la
	situaci&oacute;n a fecha de hoy</A>).</P>
	<P>Como ocurre con todos los estudios, este tiene una debilidad,
	como se muestra en <A HREF="http://uptime.netcraft.com/up/accuracy.html">Netcraft's
	Uptime FAQ</A>. Sus t&eacute;cnicas para identificar servidores web
	y sistemas operativos puede ser burlada. S&oacute;lo se incluyen en
	el estudio los sistemas para los que Netcraft haya enviado muchos
	requerimientos (y esos no sos &quot;todos los sitios del mundo&quot;).
	Cada direcci&oacute;n a la que se lanza el formulario de consulta
	&quot;qu&eacute; est&aacute; corriendo&quot;, se a&ntilde;ade al
	conjunto de direcciones que se muestrean rutinariamente, y Netcraft
	no monitoriza rutinariamente los 22 millones de direcciones que se
	conocen, por razones de rendimiento. Muchos sistemas operativos no
	proporciones informaci&oacute;n actualizada y por ello no se pueden
	incluir, y esto incluye a AIX, AS/400, Compaq Tru64, DG/UX, MacOS,
	NetWare, NT3/Windows 95, NT4/Windows 98, OS/2, OS/390, SCO UNIX,
	Sony NEWS-OS, SunOS 4, y VM. Por ello, este contador de
	funcionamiento continuado s&oacute;lo puede incluir sistemas que
	corren BSD/OS, FreeBSD (pero no la configuraci&oacute;n de defecto
	en versiones 3 y posteriores), versiones reicentes de HP-UX, IRIX,
	GNU/Linux kernel 2.1 posterior (excepto en sistemas basados en
	procesador Alpha), MacOS X, versiones recientes de NetBSD/OpenBSD,
	Solaris 2.6 y posteriore y Windows 2000. Observese que los sistemas
	Windows NT no se pueden incluir en este estudio (porque no indican
	su periodo de funcionamiento), pero s&iacute; se incluyen los
	sistemas Windows 2000. De nuevo, ning&uacute;n sistema Windows forma
	parte de los 50 mayores periodos de funcionamiento continuado en
	esta muestra. Observerse que HP-UX, (muchas versiones de )
	GNU/Linux, Solaris y las versiones recientes de FreeBSD vuelven a
	cero tras 497 d&iacute;as, exactamente como si la m&aacute;quina se
	hubiese rearrancado en ese preciso momento. Por ello no se puede ver
	un sistema HP-UX, (la mayor&iacute;a de los) GNU/Linux, o Solaris
	con medidas de funcionamiento continuado superiores a 497 d&iacute;as,
	y de hecho sus periodos de funcionamiento pueden estar equivocados
	(pueden estar levantados durante un largo periodo de tiempo, pero no
	decirlo). A&uacute;n asi, este sistema compara Windows 2000,
	GNU/Linux (habitualmente hasta los 497 d&iacute;as), FreeBSD y
	varios sistemas operativos m&aacute;s, y una gran cantidad de
	servidores web, y el OSS/FS sale bastante bien librado. 
	</P>
</OL>
<P>Por supuesto, hay muchas anecdotas sobre la estabilidad de Windows
contra la de UNIX. Por ejemplo, el <A HREF="http://www.info-sec.com/OSsec/OSsec_080498g_j.shtml">programa
``Smart Ship'' de la Marina de los USA, caus&oacute; un fallo
completo todo el USS Yorktown en Septiembre de 1997</A>. Anthony
DiGiorgio (un whistle-blower -literalmente &quot;soplador de
silbato&quot;, equivalente al cornet&iacute;n de &oacute;rdenes
espa&ntilde;ol-) indic&oacute; que Windows era ``la fuente de los
problemas de computadoras del Yorktown''. Ron Redman, diputado
director t&eacute;cnico de la Divisi&oacute;n de Introducci&oacute;n
de la Flota de la Oficina Ejecutiva del Programa Aegis, dijo que &quot;ha
habido numerosos fallos de software asociados con [Windows] NT a
bordo del Yorktown&quot;. Redman tambi&eacute;n dijo que &quot;a
causa de la pol&iacute;tica, nos han forzado a hacer cosas que sin
pol&iacute;tica no habr&iacute;amos hecho, como Windows NT... De
haber sido por mi, prob&aacute;blemente no habr&iacute;a utilizado
Windows NT en esta aplicaci&oacute;n particular. De haber utilizado
UNIX, tendr&iacute;amos un sistema con menos tendencia a caer&quot;.</P>
<P>Un problema con las medidas de estabilidad es que se llevan un
largo periodo de tiempo de recogida de datos en circunstancias de
estabilidad de la vida real. Sin embargo, la evidencia disponible
sugiere que OSS/FS tiene un significativo &eacute;xito en materia de
estabilidad. 
</P>
<H1>Rendimiento</H1>
<P>La comparaci&oacute;n entre el rendimiento de GNU/Linux y
Microsoft Windows en hardware equivalente tiene una nutrida historia
de llamadas cont&iacute;nuas y resultados diferentes basados en
diferentes asunciones. Pienso que OSS/FS ha demostrado que es cuando
menos suficientemente competitivo, y en muchas circunstancias incluso
gana la competici&oacute;n.</P>
<P>Las comparaciones de rendimiento son muy sensibles a las
asunciones previas y al ambiente, de modo que la mejor comparaci&oacute;n
es la que se realice usted mismo para su ambiente deseado. En su
ausencia, deber&iacute;a usted utilizar medidas no sesgadas, porque
es demasado facil crear medidas sesgadas.</P>
<P>Primero, hay unos pocos estudios recientes que sugieren que
algunos sistemas OSS/FS baten a sus competidores propietarios en al
menos algunas circunstancias:</P>
<OL>
	<LI><P><B>PC Magazine de Noviembre de 2.001 comprob&oacute; el
	rendimiento de servidores de ficheros, y encontr&oacute; que Linux
	con Samba superaba significativamente a Windows 2.000.</B> El
	art&iacute;culo de PC Magazine <A HREF="http://www.pcmag.com/article/0,2997,s%253D25068%2526a%253D16554,00.asp">Pruebas
	de Rendimiento: Volumen Servido y Tiempo de Respuesta de un Servidor
	de Ficheros<!-- Nov. 13, 2001 --></A> encontr&oacute; que Linux con
	Samba superaba significativamente a Windows 2000 Server cuando se
	utiliza como servidor de ficheros para los protocolos de ficheros en
	red propietarios de Microsoft. Esto era cierto sin mirar el n&uacute;mero
	de clientes simult&aacute;neos (ellos probaron hasta 30 clientes), y
	era cierto en el rango completo de m&aacute;quinas que comprobaron
	(Pentium II/233MHz con 128MiB RAM, Pentium III/550MHz con 256MiB
	RAM, y Pentium III/1GHz con 512MiB RAM, donde <A HREF="http://physics.nist.gov/cuu/Units/binary.html">MiB
	is 2^20 bytes</A>). Adem&aacute;s, conforme la m&aacute;quina era
	m&aacute;s capaz, la diferencia se volv&iacute;a m&aacute;s
	pronunciada. En el hardware m&aacute;s r&aacute;pido, mientras se
	manipulaba el mayor n&uacute;mero de clientes, el volumen de salida
	de GNU/Linux era alrededor de 130 MB/sec, contra los 78 MB/sec de
	Microsoft (GNU/Linux era un 78 % m&aacute;s r&aacute;pido). 
	</P>
	<LI><P><B>En pruebas de rendimiento de la revista Sys Admin,
	GNU/Linux bati&oacute; a Solaris (en Intel), Windows 2000, y
	FreeBSD.</B> El art&iacute;culo <A HREF="http://www.sysadminmag.com/articles/2001/0107/0107a/0107a.htm">``&iquest;Qu&eacute;
	SO es m&aacute;s R&aacute;pido para Aplicaciones de Red de Alto
	Rendimiento?''</A> en la edici&oacute;n de Julio de 2.001 de la
	revista <A HREF="http://www.sysadminmag.com/"><I>Sys Admin</I></A>
	examin&oacute; arquitecturas d alto rendimiento, y encontr&oacute;
	que GNU/Linux venc&iacute;a esta competici&oacute;n cuando se le
	comparaba con Solaris (en Intel), FreeBSD (un sistema OSS/FS), y
	Windows 2000. Intencionadamente corr&iacute;an los sistemas
	&quot;conforme salen de la caja&quot; (sin ajustar), excepto para el
	incremento de conexiones TCP/IP simult&aacute;neas (cosa necesaria
	para probar las aplicaciones as&iacute;ncronas y multi-hebras).
	Utilizaron la &uacute;ltima versi&oacute;n de cada sistema operativo
	en exactamente la misma m&aacute;quina. Realizaron un informe (por
	sistema operativo) de los resultados de dos pruebas de rendimeinto
	diferentes.</P>
	<LI><P>Los desarrolladores de FreeBSD criticaron eston resultados,
	notando que FreeBSD por defecto pone emfasis en la estabilidad (no
	en la velocidad), y que ellos esperaban que cualquiera con una
	necesidad de rendimiento significativa, primero habr&iacute;a
	realizado un ajuste. Por ello, <A HREF="http://www.sysadminmag.com/articles/2001/0108/0108q/0108q.htm">Sys
	Admin rehizo las pruebas de FreeBSD tras ajustar FreeBSD</A>. Un
	cambio que hicieron fue cambiar a montaje &quot;asincrono&quot;, lo
	cual hace m&aacute;s r&aacute;pido el sistema, (aunque incrementa el
	riesgo de perdida de datos en caso de fallo de potencia) - este es
	el defecto en GNU/Linux y es muy facil de implementar en FreeBSD, de
	modo que era una modificaci&oacute;n muy peque&ntilde;a y razonable.
	Sin embargo, tambi&eacute;n realizaron muchos otros cambios, por
	ejemplo encontraron y compilaron 17 parches de FreeBSD y utilizaron
	varios comando de ajuste. Los otros sistemas operativos no sufrieron
	un cambio a &quot;ajustados&quot; como este, de modo que comparar
	sistemas operativos sin ajustar con un FreeBSD ajustado no es
	realmente correcto. 
	</P>
	<P>En cualquier caso, aqu&iacute; est&aacute;n las dos pruebas de
	rendimiento: 
	<OL>
		<LI>Midieron su &quot;mundo real&quot; comprobando cu&aacute;n
		r&aacute;pidamente pod&iacute;an enviar correos electr&oacute;nicos
		utilizanso sus servidores de env&iacute;o de correo (MailEngine).
		Hasta 100 env&iacute;os simult&aacute;neos, no hab&iacute;a
		diferencias, pero conforme se incrementaba el n&uacute;mero, los
		sistemas empezaron a mostrar diferencias significativas en su
		velocidad de env&iacute;o de correos horarios. Hacia los 500 env&iacute;os
		simult&aacute;neos, GNU/Linux era claramente superior a todos
		excepto el sistema FreeBSD ajustado, y GNU/Linux se manten&iacute;a
		en la cumbre. El FreeBSD ajustado ten&iacute;a rendimientos
		similares a GNU/Linux cuando se corr&iacute;an 1000 o menos env&iacute;os
		simult&aacute;neos, pero FreeBSD lleg&oacute; a un pico alrededor
		de las 1000-1500 conexiones simult&aacute;neas, con un suave
		decline no sufrido por GNU/Linux, y el FreeBSD ajustad tuvo
		problemas m&aacute;s all&aacute; de los 3.000 conexiones
		simult&aacute;neas. Hacia las 1.500 conexiones simult&aacute;neas,
		GNU/Linux estaba enviando 1,3 millones de correos a la hora,
		mientras Solaris manejaba aproximadamente 1 mill&oacute;n, y
		Windows 2000 y el FreeBSD ajustado estaban sobre los 0,9 millones. 
		<LI><P>En sus &quot;pruebas de I/O a disco&quot;, crearon,
		escribieron y leyeron 10.000 ficheros de tama&ntilde;o id&eacute;ntico
		en un &uacute;nico directorio, variando el tama&ntilde;o de las
		instacias de los ficheros. Aqu&iacute; Solaris era el m&aacute;s
		lento, con FreeBSD ajustado el segundo m&aacute;s lento. FreeBSD
		ajustado, Windows 2000 y GNU/Linux ten&iacute;an velocidades
		similares en los tama&ntilde;os de ficheros m&aacute;s peque&ntilde;os
		(en algunos casos FreeBSD ajustado era m&aacute;s r&aacute;pido,
		como en los tama&ntilde;os de 8 k y 16 k), pero cuando los tama&ntilde;os
		de los ficheros ser fueron a 64 k o 128 k, los sistemas operativos
		empezaron a mostrar diferencias de rendimiento significativas:
		GNU/Linux era el m&aacute;s r&aacute;pido, despu&eacute;s Windows
		2000, y luego FreeBSD. En 128 k, FreBSD era un 16 % peor que
		Windows 2000 y un 39 % peor que GNU/Linux: todos eran m&aacute;s
		r&aacute;pidos que FreeBSD sin ajustar y Solaris. Cuando se
		totalizaron esos tiempos a lo largo de todos los ficheros, los
		resultados eran GNU/Linux: 542 segundos, Windows 2000: 613
		segundos, FreeBSD ajustado, 630 segundos, FreeBSD sin ajustar 2398
		segudos, y Solaris 3990 segundos. 
		</P>
	</OL>
	<LI><B>GNU/Linux con TUX ha producido mejores valores de SPEC que
	Windows/IIS en varios casos, incluso con configuraciones de disco
	inferiores. </B>Una organizaci&oacute;n que intenta desarrollar
	comparativas no sesgadas es el <A HREF="http://www.spec.org/">SPEC
	Consortium</A>, de desarrolla y mantiene una serie completa de
	comparativas. La idea es comparar Microsoft Windows contra
	GNU/Linux, comparando los resultados de SPECweb99 (que mide el
	rendimiento de servidores web) en un hardware identico si ambos han
	de realizar la misma cantidad de esfuerzo de optimizaci&oacute;n del
	rendimento. Sin embargo, las cosas no suelen ser tan simples:
	raramente disponen de las mismas plataformas hardware b&aacute;sicas
	para probar ambos sistemas operativos, e incluso cuando eso ocurre,
	como el 13 de Julio de 2.001, no se ha probado exactamente
	configuraciones id&eacute;nticas (difieren en cosas como utilizar un
	n&uacute;mero diferente de discos, o incluso algunos discos duros
	m&aacute;s r&aacute;pidos). Utilizando los resultados disponibles el
	13 de Julio de 2.001, hab&iacute;a tres configuraciones, todas de
	Dell, que corr&iacute;an con GNU/Linux (utilizando el
	servidor/acelerador web Tux) y Windows (utilizando ISS), exactamente
	en el mismo hardware subyacente. Aqu&iacute; est&aacute;n los
	resultados del SPECweb99 de 13 de Julio de 2.001 (mayor es mejor),
	anotando las diferencias de configuraci&oacute;n: 
	<TABLE WIDTH=729 BORDER=1 CELLPADDING=2 CELLSPACING=3>
		<COL WIDTH=207>
		<COL WIDTH=274>
		<COL WIDTH=222>
		<TR BGCOLOR="#bac0ff">
			<TH WIDTH=207>
				<P>System</TH>
			<TH WIDTH=274>
				<P>Windows SPEC Result</TH>
			<TH WIDTH=222>
				<P>Linux SPEC Result</TH>
		</TR>
		<TR BGCOLOR="#ccccfe">
			<TD WIDTH=207>
				<P>Dell PowerEdge 4400/800, 2 Pentium III Xeon a 800MHz 
			</TD>
			<TD WIDTH=274>
				<P>1060 (IIS 5.0, 1 controlador de red)</TD>
			<TD WIDTH=222>
				<P>2200 (TUX 1.0, 2 controladores de red)</TD>
		</TR>
		<TR BGCOLOR="#ccccfe">
			<TD WIDTH=207>
				<P>Dell PowerEdge 6400/700, 4 Pentium III Xeon a 700MHz 
			</TD>
			<TD WIDTH=274>
				<P>1598 (IIS 5.0, 7 discos de 9GB a 10KRPM)</TD>
			<TD WIDTH=222>
				<P>4200 (TUX 1.0, 5 discos de 9GB a 10KRPM)</TD>
		</TR>
		<TR BGCOLOR="#ccccfe">
			<TD WIDTH=207>
				<P>Dell PowerEdge 8450/700, 8 Pentium III Xeon a 700MHz 
			</TD>
			<TD WIDTH=274>
				<P>7300/NC (IIS 5.0, 1 disco de 9Gb a 10KRPM and 8 discos de 16Gb
				a 15KRPM) <BR>luego 8001 (IIS 5.0, 7 discos de 9Gb a 10KRPM y 1
				disco de 18Gb a 15KRPM)</TD>
			<TD WIDTH=222>
				<P>7500 (TUX 2.0, 5 discos de 9Gb a 10KRPM)</TD>
		</TR>
	</TABLE>
	<P><!-- on the 8450/700, TUX 1.0 had 6387; only the most recent figures
 (TUX 2.0) are shown, since there's no point in comparing obsolete systems
 when a newer system is available. --><!-- Dell PowerEdge 2400/667 are available, and the numbers for Linux/TUX
     are higher, but the processors used aren't identical;
     667MHz Pentium IIIEB and 667MHz Pentium III for IIS. Since they aren't
     identical processors, it's would not be fair to mention them.
     There are many other SPECweb results, but very few compare
     apples to apples. Even as of July 13, these are the only ones. -->La
	primera fila (el PowerEdge 4400/800) realmente no prueba nada. El
	sistema IIS tiene menos rendimiento, pero s&oacute;lo tiene un
	controlador de red y el sistema TUX tiene dos, de modo que mientras
	el sistema TUX tiene mejor rendimiento, podr&iacute;a ser
	simplemente porque puede utilizar dos conexiones de red.</P>
	<P>La segunda entrada (el PowerEdge 6400/700) ciertamente sugiere
	que GNU/Linux m&aacute;s TUX realmente es mucho mejor - el sistema
	IIS tiene dos discos m&aacute;s disponibles, (lo cual deber&iacute;a
	incrementar el rendimiento), pero el sistema TUX tiene m&aacute;s
	del doble del rendimiento del sistema IIS.</P>
	<P>La &uacute;ltima entrada para el PowerEdge 8450/700 es incluso
	m&aacute;s compleja. Primero, los discos son diferentes - el sistema
	IIS tiene al menos un disco que gira m&aacute;s r&aacute;pido que
	los que dispone el sistema TUX (lo que deber&iacute;a dar al sistema
	ISS una ventaja de rendimieno, dada la velocidad de transferencia
	ciertamente mayor). Adem&aacute;s, tambi&eacute;n tiene m&aacute;s
	discos, (dando de nuevo otra ventaja de rendimiento al sistema IIS).
	Cuando originalmente coloqu&eacute; esta tabla junta, mostrando
	todos los datos p&uacute;blicamente disponibles en Abril de 2.001
	(cubriendo desde el tercer cuarto de 1.999 hasta el primer cuarto de
	2.001), IIS 5.0 (en un Dell PowerEdge 8450/700 con 8 procesadores)
	ten&iacute;a un valor de SPECweb99 de 7300. Desde ese momento,
	Microsoft cambi&oacute; la disponibilidad de Microsoft SWC 3.0, y
	seg&uacute;n las reglas de SPECweb99, estos datos hacen que los
	resultados de la prueba sean &quot;no cumplidores&quot; (NC). Esto
	es sutil: no es que la prueba misma fuera inv&aacute;lida, es que
	Microsoft cambi&oacute; lo que se pod&iacute;a utilizar, y utiliz&oacute;
	las propias reglas del SPEC Consortium para invalidar la prueba
	(probablemente porque los resultados de la prueba no le eran
	deseables). Se realiz&oacute; entonces una nueva prueba, con a&uacute;n
	otra configuraci&oacute;n de discos, en la cual IIS produjo un valor
	de 8.001. Sin embargo, estas dos pruebas se realizaron en
	circunstancias de mejor hardware - y en una circunstancia de mejor
	hardware no fue mejor.</P>
	<P>De tal forma que en estas configuraciones, el sistema GNU/Linux
	m&aacute;s TUX a&uacute;n en un inferior hardware gan&oacute; en
	rendimiento. Puesto que se pueden invocar otros factores, es duro
	juzgar - hay situaciones patol&oacute;gicas en las que un &quot;mejor
	hardware&quot; puede producir un peor rendimiento, o puede haber
	otro factor no localizado que tenga un efecto significativo. Es
	deseable que en el futuro haya otras pruebas cara a cara en una
	variedad de configuraciones id&eacute;nticas. 
	</P>
	<P>Observese que TUX est&aacute; indicado para utilizarse como un
	&quot;acelerador web&quot; para muchas circunstancias, donde
	manipula r&aacute;pidamente requerimientos sencillos y pasa
	consultas m&aacute;s complejas a otro servidor (habitualmente
	Apache). He seleccionado las l&iacute;neas de TUX porque suponen las
	medidas de rendimiento m&aacute;s recientes que tengo disponibles.
	Desde ese momento, no tengo medidas SPECweb99 u otras medidas de
	rendimiento recientes para Apache en GNU/Linux o para Apache y TUX
	juntos. Tampoco tengo medidas de estabilidad de TUX. Espero que
	tales medidas aparecer&aacute;n en el futuro. 
	</P>
	<LI><P><B>Comparativas de bajo nivel de IBM encontraron que
	GNU/Linux ten&iacute;a mejor rendimiento de pipes que Windows.</B>
	Ed Bradford (director del Microsoft Premier Support en IBM Software
	group) public&oacute; en Octubre de 2.001 el estudio <A HREF="http://www-106.ibm.com/developerworks/linux/library/l-rt4/?open&amp;t=grl,l=252,p=pipes"><I>Pipes
	en Linux, Windows 2000, y Windows XP</I></A>. En este estudio,
	examin&oacute; el rendimiento de los pipes, un mecanismo de bajo
	nivel habitual para la comunicaci&oacute;n entre procesos de
	programas. Encontr&oacute; que los pipes en Red Hat 7.1 (con kernel
	de Linux 2.4.2) ten&iacute;a un rango de pico de I/O de alrededor de
	700MB/segundo, conun estado estable de alrededor de 100 MB/segundo
	para tama&ntilde;os de bloque muy grandes. En contraste, Windows
	2000 ten&iacute;a un pico de 500 MB/segundo, con un estado estable
	para bloques grandes de 80 MB/segundo. Windows XP (versi&oacute;n de
	evaluaci&oacute;n) estaba especialmente desafortunado: su rango de
	pico era de s&oacute;lo 120 MB/segundo, con un estado estable de 80
	MB/segudno, todos en la misma plataforma y todos corriendo un
	Interfaz Gr&aacute;fico de Usuario.<!-- Ed Bradford also published a study of block memory motion, but he
     left a number of loose ends.  In that study, he found that generally
     Linux was faster, with the exception of
     (1) using a 4-byte pointer and transferring less than 200 KB, or
     (2) using partially unwound "double *" method the transfer is less
         than 10 KB.
     However, he concludes by saying that
     "It seems this time that I have created more questions than answers."
     In particular, little explanation for these differences is given.
     In the end, I've decided not to reference his work because there
     were just too many loose ends. The effect seems to be real, so others
     might want to reference it. --><!-- This looks interesting, but I'd like more information from them about it:
<li
<bFastcenter ran Oracle performance tests
and found that show Microsoft Windows 2000 Server was
capable of only 85% of throughput compared to SuSE Linux Enterprise 7
on the same hardware.</b
<a href="http://www.fastcenter.com/"Fastcenter</a
ran a benchmark of database performance tests using Oracle on exactly the
same hardware
(twin 1 GHz processors, 2 Gibibytes of ram, and two 10k rpm 160mb/sec disks).
They compared
Microsoft Windows 2000 Server (Version 5.0.2195, build 2195, no patches)
with SuSE Enterprise Linux Server 7 (standard installation).
Both operating systems were installed essentially as "stock" installations;
<a href="http://www.fastcenter.com"see FastCenter's benchmarks
for more information</a.
The Windows 2000 server instance build only achieved
70% of the performance of the Linux
(on Windows 2000 server this action took 5 minutes and 56 seconds, while
on SuSE Linux the same action took 4 minutes and 12 seconds).
Once installed, Microsoft's
Windows 2000 server averaged 85% of the throughput of SuSE Linux
(it varied depending on the load, but
in all cases SuSE Linux had better performance).
 -->
	
	</P>
	<LI><P><B>InfoWorld encontr&oacute; que Windows XP es
	significativamente m&aacute;s lento que Windows 2000</B>. El n&uacute;mero
	de 29 de Octubre de 2.001de InfoWorld incluye el art&iacute;culo
	&quot;Esperando a Windows XP&quot; (pp. 53-57), en el que compararon
	Windows XP (final release code) con Windows 2000 (con Service Pack
	2), utilizando CSA Research's Benchmark Studio Professional en
	diferentes escenarios (v&eacute;ase su art&iacute;culo para obtener
	m&aacute;s detalles y las medidas cuantitativas). Ellos encontraron
	que XP era siempre el de peor rendimiento, y que los resultados eran
	peores conforme se incrementaba la carga. Por ejemplo, el n&uacute;mero
	de segundos requeridos para Windows 2000 contra Windows XP en un
	Pentium 4 a 1.5 Ghz para diferentes escenarios utilizando el
	Interface de Usuario de defecto era como sigue: 29,13 s contra
	39,43, para la l&iacute;nea base, 35,05 contra 43,30 para el
	escenario 1, 42,12 contra 56,76 para el escenario 2, y 53,60 contra
	81,70 para el escenario 3. Totalizando cada situaci&oacute;n (lo que
	se hace a veces para realizar cada comparativa, uno detr&aacute;s de
	otro) la situaci&oacute;n es de 159,9 contra 220,52. Es decir,
	Windows XP es<!-- (220.52-159.9)/159.9 --> un 38% <I>m&aacute;s
	lento</I> que Windows 2000. En resumen, InfoWorld indic&oacute; que
	``los resultados de nuestra comparativa muestran que Windows XP es
	significativamente m&aacute;s lento que Windows 2000, especialmente
	en situaciones de carga importante. A menos que la inversi&oacute;n
	en nuevo hardware para atender la demanda de los usuarios sea una
	opci&oacute;n, las compa&ntilde;&iacute;as deber&iacute;an
	mantenerse con Windows 2000&quot;. Resumiendo, Windows XP ya ha
	salido, pero no ha reducido el liderazgo de Linux en rendimiento, al
	menos en una buena parte de las circunstancias.<!-- This ends the main list of performance measures: -->
	
	</P>
</OL>
<P>Todos los sistemas operativos en situaci&oacute;n de desarrollo
activo est&aacute;n en una constante batalla para conseguir
incrementos de rendimiento sobre sus rivales. La historia de las
comparaciones entre Windows y GNU/Linux nos ayuda a colocar esta
rivalidad en perspectiva. 
</P>
<OL>
	<LI><P><B>Ziff-Davis encontr&oacute; que GNU/Linux con Apache venc&iacute;a
	a Windows NT 4.0 con IIS por un 16% a un 50% dependiendo de la
	distribuci&oacute;n de GNU/Linux.</B> <A HREF="http://www.zdnet.com/sp/stories/issue/0,4537,2196115,00.html">Ziff-Davis
	compar&oacute; el rendimiento de Linux y Windows NT sirviendo web</A>.
	Encontraron que ``Linux con Apache vence a NT 4.0 con IIS, sin mover
	las manos. SuSE, el Linux menos efectivo, es un 16% m&aacute;s
	r&aacute;pido que IIS, y Caldera, el l&iacute;der, es un 50% m&aacute;s
	r&aacute;pido.'' 
	</P>
	<LI><P><B><A HREF="http://www.mindcraft.com/whitepapers/nts4rhlinux.html">Mindcraft
	public&oacute; un informe en Abril de 1.999</A> que afirmaba que
	Microsoft Windows NT Server 4.0 es 2,5 veces m&aacute;s r&aacute;pido
	que Linux(kernel 2.2) como servidor de ficheros, y 3,7 veces m&aacute;s
	r&aacute;pido como Servidor Web cuando se corre en un sistema SMP de
	4 CPU,s</B>. Varias personas y organizaciones, como <A HREF="http://lwn.net/1999/features/MindCraft1.0.phtml">Linux
	Weekly News (LWN)</A> y <A HREF="http://www.kegel.com/mindcraft_redux.html">Dan
	Kegel</A>, identificaron serios problemas en este estudio. Un punto
	obvio era que NT hab&iacute;a sido especialmente ajustado por
	expertos en NT de Microsoft, mientras que GNU/Linux no fu&eacute;
	ajustado en absoluto. Otro aspecto que es no se consider&oacute; la
	relaci&oacute;n precio/prestaciones (ni se mantuvo constante el
	gasto total: para una misma cantidad de dinero, el sistema GNU/Linux
	deber&iacute;a tener mejor hardware). Mindcraft clamaba que
	preguntaron pidiendo ayuda, pero no utilizaron los m&eacute;todos
	documentados para obtenerla, ni realizaron un contrato de soporte.
	Mucha gente se mostr&oacute; especialmente ofendida con el hecho de
	que aunque este estudio fue pagado por Microsoft, uno de los
	contendientes, y orientado a su beneficio, ni el anuncio inicial de
	Mindcraft ni su documento hicieron ninguna menci&oacute;n a este
	conflicto de intereses, y se podr&iacute;a facilmente alegar que sus
	configuraciones se dise&ntilde;aron especialmente para poner a
	GNU/Linux en desventaja. Sus configuraciones eran de alguna forma
	extra&ntilde;as: asum&iacute;an que todas las p&aacute;ginas web
	eran est&aacute;ticas, cuando t&iacute;picamente los grandes sitios
	web tienen a utilizar muchas p&aacute;ginas web generadas
	din&aacute;micamente, y que hab&iacute;a 100 o m&aacute;s clientes
	conectados a trav&eacute;s de l&iacute;neas 100baseT (en 1.999, una
	situaci&oacute;n m&aacute;s t&iacute;pica deber&iacute;a ser que la
	mayor&iacute;a de los clientes utilizaban modems m&aacute;s lentos,
	de 28,8 &oacute; 56 K,s). 
	</P>
	<P>Sin embargo, un examen cuidadoso de la comparativa encontr&oacute;
	algunos problemas leg&iacute;timos en el kernel. Estos problemas
	inclu&iacute;an un error de TCP, la ausencia de sem&aacute;ntica
	&quot;wake one&quot;, y cuellos de botella en SMP (vea <A HREF="http://www.kegel.com/mindcraft_redux.html">las
	p&aacute;ginas de Dan Kegel</A> para conseguir m&aacute;s
	informaci&oacute;n). Los desarrolladores del kernel de Linux
	empezaron a trabajar en las debilidades identificadas en la
	coparativa. 
	</P>
	<LI><P><B>PC Week confirm&oacute; que Windows mostraba ser mejor en
	esta configuraci&oacute;n menos probable. </B>El 30 de Junio de
	1.999, Mindcraft public&oacute; su <A HREF="http://www.mindcraft.com/whitepapers/openbench1.html">Open
	Benchmark</A> junto con PC Week. Mientras que no excusaron las
	desviaciones de Mindcraft, hicieron un caso de convinci&oacute;n que
	hab&iacute;a problemas leg&iacute;timos en el kernel de Linux y en
	Apache que hac&iacute;an a GNU/Linux un producto de peor rendimiento
	en esta improbable configuraci&oacute;n (sirviendo p&aacute;ginas
	web est&aacute;ticas a clientes con conexiones de alta velocidad).
	N&oacute;tese que esta configuraci&oacute;n era considerablemente
	diferente de la de Ziff-Davis, de modo que las comparaciones no son
	necesariamente contrapuestas: se trata s&iacute;mplemente de que
	asunciones diferentes pueden producir resultados diferentes (como
	hemos indicado antes). 
	</P>
	<LI><P><B>Network Computing encontr&oacute; que GNU/Linux con Samba
	corr&iacute;a esencialemente a la misma velocidad que Windows para
	servir ficheros. </B>En su art&iacute;culo <A HREF="http://www.networkcomputing.com/1011/1011f1.html">``Es
	la Hora de Linux''</A>,<!-- May 31, 1999 --> Network Computing
	compar&oacute; Red Hat Linux v5.2 corriendo Samba 2.0.3 contra
	Microsoft Windows NT Server Enterprise Edition en un HP NetServer
	LPr basado en Pentium II, cargando la m&aacute;quina con m&uacute;ltiples
	lecturas y escrituras de ficheros peque&ntilde;os, medianos y
	grandes a lo largo de varias horas. 
	</P>
	<P>Para el servicio de ficheros, descubrieron s&oacute;lo
	&quot;diferencias de rendimiento despreciables entre los dos para
	cargas de trabajo promedio... [y] dependiento del grado de ajuste
	realizado en cada instalaci&oacute;n, cualquiera de los dos sistemas
	pod&iacute;a sobrepasar al otro ligeramente en t&eacute;rminos de
	rendimiento en la compartici&oacute;n de ficheros&quot;. Red Hat
	Linux sobrepas&oacute; ligeramente a NT en escrituras de ficheros,
	mientras que NT super&oacute; a Red Hat Linux en lecturas masivas.
	Observese que esta configuraci&oacute;n estaba inicialmente limitada
	por la capacidad de la red: &quot;en ning&uacute;n momento fuimos
	capaces de superar el 50 % de utilizaci&oacute;n de la CPU: el
	entorno de &uacute;nico interfaz de red, full duplex 100 baseT no
	nos lo permiti&oacute;&quot;.</P>
	<P>Tambi&eacute;n anotaron que &quot;el examen de la diferencia de
	costo entre las licencias de los dos sistemas arroja luz enteramente
	nueva a esta prueba... el potencial de ahorro solo en licencias
	deber&iacute;a abrirnos los ojos. Por ejemplo, basandosos en el
	precio promedio de mercado para una licencia cliente de Windows NT
	de 30 $, 100 licencias deber&iacute;an costar alrededor de 3.000 $,
	m&aacute;s el coste de una licencia de NT server (aproximadamente
	600 $). Compare esto con el precio de un CD de Red Hat Linux, o
	quiz&aacute; incluso a una descarga gratuita, y el ahorro empieza a
	aproximarse al coste de un servidor de trabajo en grupo de bajo
	nivel. Suba a unos pocos cientos miles de clientes y empezar&aacute;
	a ver ahorros astron&oacute;micos&quot;. Vea esta secci&oacute;n del
	documeto en <A HREF="#tco">coste total cost de propiedad</A>. 
	</P>
	<LI><P><B>La revista alemana c't encontr&oacute; que los sitios web
	con NT eran mejores con conexiones de red dobles y contenido
	est&aacute;tico, mientras que GNU/Linux era mejor para sitios con
	contenido din&aacute;mico y conexiones &uacute;nicas. </B>Su
	art&iacute;culo <A HREF="http://www.heise.de/ct/english/99/13/186-1"><I>Doble
	Mezcla: Linux y NT como Servidor Web en el Mejor Entorno</I></A>
	examin&oacute; Windows NT con IIS contra GNU/Linux (kernel 2.2.9)
	con Apache en una m&aacute;quina con cuatro CPU,s Pentium II Xeon.
	Encontraron que el mejor rendimiento depend&iacute;a de la
	situaci&oacute;n, lo que por ahora no es una sorpresa. Si el
	servidor web serv&iacute;a fundamentalmente p&aacute;ginas est&aacute;ticas
	a trav&eacute;s de dos tarjetas de red de alto rendimiento, el
	rendimiento de NT era superior. Por contra, tambi&eacute;n notaron
	que en sitios web sofisticados esto no es aplicable, porque estos
	sitios tienen a tener contenidos fundamentalmente din&aacute;micos,
	y que pocos sitios tienes este tipo de conexiones duales (cuando
	s&oacute;lo se tiene utilizable una tarjeta de red, GNU/Linux
	generalmente tiene ventaja). Vea sus documentos para obtener m&aacute;s
	informaci&oacute;n. 
	</P>
	<LI><P><B>Los variados esfuerzos de los desarrolladores de Linux
	parecen haber dado resultado.</B> En junio de 2.000, Dell midi&oacute;
	los valores de SPECweb99 indicados antes. 
	</P>
</OL>
<P>Hay otras comparaciones disponibles, pero las hemos reunido en
varios grupos: 
</P>
<OL>
	<LI><P>Un conjunto m&aacute;s reciente de art&iacute;culos de eWeek
	de Junio de 2.001, muestran algunos n&uacute;meros de rendimientos
	que saltan a la vista, para GNU/Linux con TUX. Sin embargo, lo
	comparan con Microsoft IIS, y no incluyen el SWC de Microsoft
	(Scaleable Web Cache, cache web escalable), la respuesta de
	Microsoft a TUX, y en mi opini&oacute;n, omitirlo hace la
	comparativa inadecuada. Puede leer m&aacute;s en <A HREF="http://www.zdnet.com/enterprise/stories/main/0,10228,2776383,00.html">``TUX:
	Construido para la Velocidad''</A>, <A HREF="http://www.zdnet.com/enterprise/stories/main/0,10228,2776519,00.html">``Smart
	Coding pays off Big''</A>, y <A HREF="http://www.kegel.com/nt-linux-benchmarks.html">Puntualizaciones
	detalladas de Kegel</A>. 
	</P>
	<LI><P>El art&iacute;culo de ZDNet <A HREF="http://www.zdnet.com/zdnn/stories/news/0,4586,2760874,00.html"><I>&iexcl;Toma
	ya! Linux bate a MS en pruebas de rendimiento</I></A>, clam&oacute;
	a toque de trompetas que GNU/Linux era el l&iacute;der de
	rendimientos en Mayo de 2.001 en la prueba de oprte de decisi&oacute;n
	TCP-H (base de datos, categor&iacute;a ``100Gb''). Sin embargo,
	estos resultados no se deben tomar seriamente: el hardware de Linux
	era m&aacute;s poderoso que el de su competidor (Windows 2000).
	Francamente, lo m&aacute;s sorprendente de esta puntuaci&oacute;n
	m&aacute;xima (que puede explicarse f&aacute;cilmente por la
	diferencia de hardware) es su simple medici&oacute;n:
	tradicionalmente s&oacute;lo se informaban en esta categor&iacute;a
	los n&uacute;meros de Microsoft. Para m&aacute;s informaci&oacute;n,
	vea <A HREF="http://www.tpc.org/tpch/results/h-ttperf.idc">los
	resultados de TPC.</A> 
	</P>
</OL>
<P>Kegel proporciona m&aacute;s informaci&oacute;n sobre varias
pruebas en <A HREF="http://www.kegel.com/nt-linux-benchmarks.html">NT
vs. Linux Server Benchmark Comparisons</A>, <A HREF="http://www.spec.org/">SPEC</A>,
y <A HREF="http://dmoz.org/Computers/Performance_and_Capacity/Benchmarking/">dmoz
entry on benchmarking</A>. 
</P>
<P>Recuerde, en las pruebas comparativas, todo depende de la
configuraci&oacute;n de las asunciones que se realizan. Muchos
sistemas est&aacute;n limitados por el ancho de banda de la red: en
estas condiciones, montar un ordenador m&aacute;s r&aacute;pido no
nos ayudar&aacute; en absoluto. Incluso cuando el ancho de banda no
es la limitaci&oacute;n, ni Windows ni GNU/Linux trabajan bien en
configuraciones de multiprocesamiento sim&eacute;trico a gran escala
(SMP): si usted quiere CPU,s de 64 vias con memoria compartida,
ninguno de ellos es apropiado (Sun Solaris, que no es OSS/FS, trabaja
mucho mejor en esta configuraci&oacute;n). Por otro lado, si se desea
memoria distribu&iacute;da masiva (no compartida), GNU/Linux lo hace
bastante bien, con lo que se pueden comprar m&aacute;s CPU,s para una
cantidad de dinero dada. Si la distribuci&oacute;n masiva no le puede
ayudar y necesita usted muy alto rendimiento, Windows ni siquiera
est&aacute; en la carrera: hoy Windows 2000 s&oacute;lo corre en
procesadores compatibles con x86 de Intel, meintras que GNU/Linux
corre en procesadores de mucho mayor rendimiento, adem&aacute;s de
los x86. 
</P>
<H1>Escalabilidad</H1>
<P>Lo que nos lleva al asunto de la escalabilidad, un t&eacute;rmino
sencillo con m&uacute;ltiples aspectos: 
</P>
<OL>
	<LI><P><B>GNU/Linux y NetBSD (ambos OSS/FS) soportan un campo de
	plataformas de hardware y de rendimientos mayor que cualquier otro
	sistema operativo.</B> Mucha gente entiende por &quot;escalabilidad&quot;
	la respuesta a la pregunta: &quot;&iquest;puedes utilizar el mismo
	sistema de software tanto para peque&ntilde;os sistemas como para
	grandes proyectos?&quot;. Lo cual implica que le gustar&iacute;a
	arrancar con un sistema modesto, pero tener la posibilidad de hacer
	crecer el sistema conforme crece la demanda sin costosas
	modificaciones. Aqu&iacute; , OSS/FS es envencible: ya que muchas
	personas pueden identificar los problemas de escalabilidad, y ya que
	el c&oacute;digo fuente se puede optimizar para su plataforma, la
	escalabilidad de muchos productos OSS/FS es asombrosa. Observemos
	espec&iacute;ficamente GNU/Linux. GNU/Linux funciona en <A HREF="http://www.linuxdevices.com/articles/AT8728350077.html">PDAs</A>
	(incluyendo la <A HREF="http://www.agendacomputing.com/products/agenda_linux.html">Agenda
	VR3</A>), <A HREF="http://www.timesofindia.com/300301/30intw1.htm">hardware
	obsoleto (de forma que ya no se necesita desechar el hardware)</A>,
	hardware de PC normal moderno, sobre una docena de chipsets
	diferentes (no s&oacute;lo en Intel x86s), <A HREF="http://linas.org/linux/i370.html">mainframes</A>,
	<A HREF="http://gb.lwn.net/2000/features/FSLCluster">clusters
	masivos</A>, y un cierto n&uacute;mero de <A HREF="http://www.idg.net/crd_linux_473938_102.html">supercomputadores</A>.
	GNU/Linux se puede utilizar para procesamiento paralelo masivo: una
	aproximaci&oacute;n a esta forma de trabajar es la <A HREF="http://www.linuxdoc.org/HOWTO/Beowulf-HOWTO.html">arquitectura
	Beowulf architecture</A>. <A HREF="http://www.cs.sandia.gov/cplant">Sandia's
	``CPlant''</A> corre en un conjunto de sistemas que funcionan con
	GNU/Linux, y era el cuadrag&eacute;simo segundo ordenador m&aacute;s
	poderoso del mundo en Junio de 2.001 (n&uacute;mero 42 en la lista
	<A HREF="http://www.top500.org/list/2001/06/">TOP 500 Supercomputer
	list, June 2001</A>). Hay incluso un prototipo de implementaci&oacute;n
	de GNU/linux en un <A HREF="http://www.freeos.com/articles/3800">wrist
	watch</A>, y GNU/Linux corre en un gran n&uacute;mero de chips de
	CPU diferentes, incluyendo los <A HREF="http://www.linux.org/projects/ports.html">x86,
	Intel Itanium, ARM, Alpha, IBM AS/400 (gama media), SPARC, MIPS,
	68k, y Power PC</A>. Otro sistema operativo que ampliamente escala a
	muchas otras plataformas es <A HREF="http://www.netbsd.org/">NetBSD</A>.
	
	</P>
	<P>De esta forma, se puede comprar un sistema GNU/Linux o NetBSD, y
	hacerlo crecer tanto como se necesite; adem&aacute;s se puede
	reemplazar hardware peque&ntilde;o con procesadores masivamente
	paralelos o de velocidad extremadamente alta, o arquitecturas de CPU
	muy diferentes sin cambiar el sistema operativo. Windows CE/ME/NT
	escala en peque&ntilde;as plataformas, pero no a las grandes, y s&oacute;lo
	trabaja en sistemas x86. Muchos sistemas UNIX (como Solaris),
	escalan bien en grandes plataformas espec&iacute;ficas, pero no en
	plataformas peque&ntilde;as o distribu&iacute;das. Esos sistemas
	OSS/FS son algunos de los programas m&aacute;s escalables del
	mundo.<!-- Scaleability: Watch, 486s, --><!-- Top 500 supercomputers: http://www.top500.org --><!-- http://lwn.net/2001/0322/a/top500.php3 -->
	
	</P>
	<LI><P><B>Los procesos de desarrollo OSS/FS pueden escalar al
	desarrollo de grandes sistemas de software. </B>Hubo un tiempo en el
	que era com&uacute;n preguntarse si el proceso OSS/FS en s&iacute;
	mismo era &quot;escalable&quot;, es decir, si los procesos OSS/FS
	prodr&iacute;an realmente desarrollar sistemas a gran escala. En
	1.976, Bill Gates, en su &quot;Carta Abierta a los Aficionados&quot;,
	preguntaba ret&oacute;ricamente &quot;&iquest;Qui&eacute;n puede
	realizar un esfuerzo profesional para nada? &iquest;Qu&eacute;
	aficionado puede dedicar tres a&ntilde;os-hombre a programar,
	encontrar errores, documentar su producto, y distribuirlo gratis?&quot;.
	&Eacute;l supon&iacute;a que estas eran preguntas irresolubles, pero
	se equivocaba. Vease mi <A HREF="http://www.dwheeler.com/sloc">informe
	sobre estimaciones del tama&ntilde;o de GNU/Linux</A>. Para Red Hat
	Linux 6.2, encontr&eacute; que le tama&ntilde;o rondaba los 17
	millones de l&iacute;neas de c&oacute;digo fuente(SLOC). Una
	implementaci&oacute;n tradicional de esta carga de trabajo, habr&iacute;a
	tomado 4.500 a&ntilde;os-hombre y alrededor de 600 millones de
	d&oacute;lares. Para Red Hat Linux 7.1, encontr&eacute; que ten&iacute;a
	sobre los 30 millones de SLOC, lo que represetan 8.000 a&ntilde;os-hombre
	de trabajo &oacute; mill millones de d&oacute;lares (un &quot;Gogabuck&quot;.
	N. del T. $1 billion en el original, espero haberlo traducido bien).
	La mayor&iacute;a de los desarrolladores se adscriben al principio
	de dise&ntilde;o de que los componentes deber&iacute;an dividirse en
	componentes m&aacute;s peque&ntilde;os donde sea pr&aacute;ctico -
	una pr&aacute;tica que se aplica tambi&eacute;n a GNU/Linux - pero
	algunos de los componentes no eras f&aacute;cilmente divisibles, y
	por ello algunos de los componentes eran muy grandes en s&iacute;
	mismos (por ejemplo, sobre los 2 millones de l&iacute;neas de c&oacute;digo
	para el kernell, mayormente en los manejadores de dispositivos). De
	forma que ya no es razonable arg&uuml;ir que OSS/FS no puede escalar
	a sistemas grandes: cl&aacute;ramente puede hacerlo. 
	</P>
</OL>
<H1><A NAME="security"></A>Seguridad</H1>
<P>La medida cuantitativa de la seguridad es muy dificil. Sin
embargo, hay unos pocos intentos de hacerlo, y sugieren que OSS/FS es
incluso superior a los sitemas propietarios. Nos concentraremos en
particular en comparar OSS/FS con los sistemas Windows.</P>
<OL>
	<LI><P><B>El &quot;seguro contra-hackers&quot; de J.S. Wurzler
	Underwriting Managers cuesta entre un 5 y un 15% m&aacute;s si se
	utiliza Windows en lugar de Unix o GNU/Linux para operar con
	Internet.</B> Al menos una compa&ntilde;&iacute;a de seguros ha
	indicado que Windows NT es menos seguro que los sistemas UNIX o
	GNU/Linux, lo que da como resultado que las tarifas para sistemas
	basados en Windows son m&aacute;s caras. Frecuentemente es dificil
	averguar cuando una compa&ntilde;&iacute;a ha sido atacada con
	&eacute;xito: frecuentemente, las compa&ntilde;ias no quieren
	divulgar tal informaci&oacute;n al p&uacute;blico por una serie de
	razones. Entre otras cosas, si los consumidores o los socios
	comerciales pierden la confianza en una compa&ntilde;&iacute;a, las
	p&eacute;rdidas resultantes podr&iacute;an ser mucho mayores que el
	ataque original. Sin embargo, las compa&ntilde;&iacute;as de seguros
	que aseguran contra ataques, pueden requerir disponer de esa
	informaci&oacute;n (como una condici&oacute;n para la cobertura), y
	pueden calcular futuras primas en funci&oacute;n de ese
	conocimiento. De acuerdo con la informaci&oacute;n de CNET, J.S.
	Wurzler Underwriting Managers , con base en Okemos, Mich, una de las
	primeras compa&ntilde;&iacute;as en ofrecer &quot;seguros contra
	hackers&quot; (y por ello de las que m&aacute;s facilmente poseen
	datos hist&oacute;ricos para calcular estas primas) ha empezado a
	<A HREF="http://news.cnet.com/news/0-1003-200-6077282.html">cargar a
	sus clientes entre un 5 y un 15 % m&aacute;s si utilizan software de
	Microsoft Windows NT en lugar de UNIX o GNU/Linux para sus
	operaciones en Internet.</A> Walter Kopf, vice presidente senior de
	seguros, dijo que &quot;hemos comprobado que la posibilidad de
	p&eacute;rdidas es mayor utilizando el sistema NT&quot;. Tambi&eacute;n
	dijo que la decisi&oacute;n se basa en el estudio de cientos de
	partes de seguros que la empresa ha tenido que atender para peque&ntilde;as
	y medianas empresas clientes suyas en los &uacute;ltimos a&ntilde;os.
	
	</P>
	<LI><P><B>Los sitios web m&aacute;s desfigurados est&aacute;n
	situados en ordenadores Windows, y los sitios con Windows
	desproporcionadamente m&aacute;s desfigurados que lo que implicar&iacute;a
	su cuota de mercado.</B> Otra forma de mirar la seguridad es mirar
	el sistema operativo utilizado en los sitios web desfigurados, y
	compararlo con su cuota de mercado. Un sitio web &quot;desfigurado&quot;
	es el sito que ha sido atacado y su contenido cambiado
	(habitualmente de una forma bastante obvia, puesto que las
	modificaciones no se suelen notificar al responsable). La ventaja de
	esta medida es que, contra otras mediciones de roturas de seguridad
	(que usualmente son &quot;encubiertas&quot;), normalmente hace muy
	dificil a las v&iacute;ctimas ocultar el hecho de que han sido
	atacadas con &eacute;xito. Hist&oacute;ricamente, manten&iacute;a
	esta informaci&oacute;n Attrition.org. Se puede encontrar un resumen
	en el <A HREF="http://www.vnunet.com/News/1116081">art&iacute;culo
	de James Middleton</A>, y se pueden encontrar los datos actuales en
	<A HREF="http://attrition.org/mirror/attrition/os-graphs.html">el
	sitio web de Attrition.org</A>. Los datos de Attrition.org mostraron
	que el 59% de los sistemas desfigurados corr&iacute;an Windows, el
	21% Linux, el 8% Solaris, un 6% BSD, y un 6% todo el resto de
	sistemas en el periodo de Agosto de 1.999 a Diciembre de 2.000. De
	modo que los sistemas Windows tienen casi 3 veces m&aacute;s
	&quot;desfiguraciones&quot; que los sistemas GNU/Linux. Esto podr&iacute;a
	tener sentido si hubiera 3 veces m&aacute;s sistemas Windows que
	GNU/Linux, lo que no cuadra con los datos que disponemos,
	s&iacute;mplemente no es cierto. 
	</P>
	<P>Por supuesto, no todos los sitios web se han atacado a trav&eacute;s
	de su servidor web y su SO. Muchos han sido desfigurados a trav&eacute;s
	de passwords expuestos, mala programaci&oacute;n de aplicaciones
	web, y cosas parecidas. Pero, si esto es as&iacute;, &iquest;porqu&eacute;
	hay tal diferencia en el n&uacute;mero de desfiguraciones basadas en
	el sistema operativo? Sin duda alguna, se deber&iacute;an encontrar
	aqu&iacute; otras razones (estos datos s&oacute;lo muestran
	correlaciones, no causas), pero esto sugiere ciertamente que OSS/FS
	puede tener una seguridad mejor. 
	</P>
	<P><A HREF="http://news.cnet.com/news/0-1003-200-5994475.html?tag=rltdnws">Attrition.org
	ha decidido abandonar la recogida de esta informaci&oacute;n debido
	a la dificultad de conservar el enorme volumen de sitios rotos</A>,
	y parec&iacute;a que obtener esta informaci&oacute;n ya no ser&iacute;a
	posible. Sin embargo, <A HREF="http://defaced.alldas.de/">defaced.alldas.de</A>
	ha decidido realizar este valioso servicio. Sus informes recientes
	muestran que esta tendencia a continuado: el 12 de Julio de 2.001,
	ellos informaban de que el 66,09 % de los sitios desfigurados
	corr&iacute;an Windows, comparado con el 17,01% para GNU/Linux,
	sobre 20.260 sitios web desfigurados.<!-- Unknown 9.84%, Solaris 3.17%, IRIS 1.43%, FreeBSD 0.93%,
     BSDI 0.77%, SCO 0.38%, NetBSD 0.11%, AIX 0.07%, HP-US 0.04%,
     Tru64 Unix 0.04%, Digital Unix 0.03%, MaxOS 0.03%, OpenBSD 0.02%,
     out of 20,260 defaced websites. -->
	
	</P>
	<LI><B>La base de datos de vulnerabilidades Bugtraq sugiere que el
	sistema operativo menos vulnerable es OSS/FS, y que todos los
	sistemas operativos OSS/FS en el estudio eran menos vulnerables que
	Windows en 1999-2000. </B>Una aproximaci&oacute;n para examinar la
	seguridad es utilizar una base de datos de vulnerabilidades; un
	an&aacute;lisis de una base de datos es la p&aacute;gina<!-- was http://www.securityfocus.com/vdb/stats.html -->
	<A HREF="http://www.securityfocus.com/cgi-gin/vulns.pl">Bugtraq
	Vulnerability Database Statistics</A>. Con datos de 17 de Septiembre
	de 2.000, aqu&iacute; tenemos el n&uacute;mero total de
	vulnerabilidades de algunos sistemas operativos l&iacute;deres:<CENTER>
		<TABLE BORDER=1 CELLPADDING=2 CELLSPACING=2>
			<TR BGCOLOR="#bac0ff">
				<TD>
					<P>Sistema Operativo</TD>
				<TD>
					<P>1997</TD>
				<TD>
					<P>1998</TD>
				<TD>
					<P>1999</TD>
				<TD>
					<P>2000</TD>
			</TR>
			<TR BGCOLOR="#ccccfe">
				<TD>
					<P>Debian GNU/Linux</TD>
				<TD>
					<P>2</TD>
				<TD>
					<P>2</TD>
				<TD>
					<P>30</TD>
				<TD>
					<P>20</TD>
			</TR>
			<TR BGCOLOR="#ccccfe">
				<TD>
					<P>OpenBSD</TD>
				<TD>
					<P>1</TD>
				<TD>
					<P>2</TD>
				<TD>
					<P>4</TD>
				<TD>
					<P>7</TD>
			</TR>
			<TR BGCOLOR="#ccccfe">
				<TD>
					<P>Red Hat Linux</TD>
				<TD>
					<P>5</TD>
				<TD>
					<P>10</TD>
				<TD>
					<P>41</TD>
				<TD>
					<P>40</TD>
			</TR>
			<TR BGCOLOR="#ccccfe">
				<TD>
					<P>Solaris</TD>
				<TD>
					<P>24</TD>
				<TD>
					<P>31</TD>
				<TD>
					<P>34</TD>
				<TD>
					<P>9</TD>
			</TR>
			<TR BGCOLOR="#ccccfe">
				<TD>
					<P>Windows NT/2000</TD>
				<TD>
					<P>4</TD>
				<TD>
					<P>7</TD>
				<TD>
					<P>99</TD>
				<TD>
					<P>85</TD>
			</TR>
		</TABLE>
	</CENTER>
	<P>No se deber&iacute;an tomar estos n&uacute;meros con mucha
	seriedad. Algunas vulnerabilidades son m&aacute;s importantes que
	otras (algunas pueden proporcionar muy poco si se explotan, o
	producir vulnerabilidad s&oacute;lo bajo ciertas condiciones
	indeseables), y otras est&aacute;n siendo activamente explotadas
	(mientras que otras incluso se han corregido ya antes de la
	explotaci&oacute;n). Los sistemas operativos de Fuente Abierta
	tienden a incluir muchas aplicaciones que habitualmente se venden
	por separado en los sistemas propietarios (incluyendo Windows y
	Solaris). Por ejemplo, Red Hat 7.1 incluye dos sistemas de base de
	datos relacionales, dos procesadores de texto, dos programas de hoja
	de c&aacute;culo, dos servidores web, y un gran n&uacute;mero de
	editores de texto. Adem&aacute;s, en el mundo de la fuente abierta,
	las vulnerabilidades se discuten p&uacute;blicamente, de forma que
	las vulnerabilidades se pueden identificar en software todav&iacute;a
	en desarrollo (es decir, en software &quot;beta&quot;). Aquellos con
	peque&ntilde;as cuotas de mercado l&oacute;gicamente son menos
	analizados. La &quot;peque&ntilde;a cuota de mercado&quot; no va con
	GNU/Linux, por supuesto, una vez que ya hemos establecido que
	GNU/Linux es el 1&ordm; o 2&ordm; sistema operativo de servidores
	web (dependiendo de c&oacute;mo los contemos). A&uacute;n m&aacute;s,
	se muestra cl&aacute;ramente que los tres sistemas OSS/FS listados
	(Debian GNU/Linux, OpenBSD y RedHat Linux) salen mucho mejor parados
	de estas medidas que Windows en 1.999, y m&aacute;s a&uacute;n en
	2.000. Incluso si se desarrollase una distribuci&oacute;n de
	GNU/Linux expl&iacute;citamente para duplicar todas las
	vulnerabilidades presentes en las distribuciones mayores de
	GNU/Linux, esta distribuci&oacute;n intencionadamente mala a&uacute;n
	saldr&iacute;a mejor que Windows (tendr&iacute;a 88 vulnerabilidades
	en 1.999, contra 99 de Windows). Los mejores resultados los produce
	OpenBSD, un sistema operativo OSS/FS que durante a&ntilde;os se ha
	enfocado espec&iacute;ficamente a la seguridad. Se podr&iacute;a
	arg&uuml;ir que su menor n&uacute;mero de vulnerabilidades se debe a
	su menor implantaci&oacute;n, pero la explicaci&oacute;n m&aacute;s
	simple es que OpenBSD se ha enfocado espec&iacute;ficamente a la
	seguridad, y lo ha conseguido m&aacute;s que el resto. 
	</P>
	<P>Estos datos son particularmente interesantes porque <A HREF="http://abcnews.go.com/sections/tech/FredMoody/moody000802.html">un
	periodista distorsion&oacute; completamente estos n&uacute;meros en
	un intento de mostar que GNU/Linux era peor</A>.<!-- Many question Fred Moody's objectivity;
    see http://www.pjprimer.com/moody.html -->
	Tom&oacute; esos n&uacute;meros, y le a&ntilde;adi&oacute; los de
	GNU/Linux, de fomra que cada vulnerabilidad de Linux aparec&iacute;a
	contada al menos dos veces (una para cada distribuci&oacute;n a las
	que se lo aplic&oacute;, y una m&aacute;s). Utilizando estas medidas
	incorrectas, declar&oacute; que GNU/Linux era peor que cualquier
	otro. Si lee usted su articulo, necesitar&aacute; leer tambi&eacute;n
	<A HREF="http://www.securityfocus.com/templates/forum_message.html?forum=2&amp;head=2782&amp;id=2782">la
	refutaci&oacute;n por el gerente del &Aacute;rea de Atenci&oacute;n
	a Microsoft (Microsoft Focus Area) en SecurityFocus</A> para conocer
	porqu&eacute; el art&iacute;culo del periodista estaba equivocado. 
	</P>
	<P>En lugar de esto, como anota <A HREF="http://www.counterpane.com/crypto-gram-0009.html">el
	Criptograma de 15 de Septiembre de 2.000</A> de Bruce Schneier, las
	vulnerabilidades est&aacute;n afectadas tambi&eacute;n por otras
	cosas como cu&aacute;ntos atacantes explotan la vulnerabilidad, la
	velocidad en la que el proveedor proporciona una correcc&iacute;&oacute;n,
	y la velocidad a la que las aplican los admnistradores. Ning&uacute;n
	sistema es invencible. 
	</P>
	<P>Un an&aacute;lisis m&aacute;s reciente de <A HREF="http://www.techrepublic.com/article/jhtml?id=r00220010917mco01.htm&amp;fromtm=e102-3">John
	McCormick en Tech Republic</A> compar&oacute; las vulnerabilidades
	de Windows y Linux utilizando n&uacute;meros durante Septiembre de
	2.001.<!-- "By the Numbers: Comparing Windows security to Linux", John McCormick,
      Sep. 24, 2001. -->
	Es un an&aacute;lisis interesante que muestra que Windows NT lider&oacute;
	el n&uacute;mero de vulnerabilidades en 2.000, utilizando los
	n&uacute;meros de 2.001 hasta Septiembre de 2.001, Windows 2000 se
	coloc&oacute; en el &quot;centro del paquete&quot; (con algunas
	distribuciones de Linux que tienen m&aacute;s y otras que tienen
	menos). Sin embargo, parece que en estos n&uacute;meros, los errores
	en las aplicaciones de Linux se han contado como errores de Linux,
	mientras que los errores de las aplicaciones de Windows no se han
	contado como errores de Windows, es decir, no se trata realmente de
	una comparaci&oacute;n adecuada. Como se hizo notar anteriormente,
	las distribuciones de Linux incluyen muchas aplicaciones que
	Microsoft vende por separado.</P>
	<LI><P><B>Red Hat (un vendedor de OSS/FS) respondi&oacute; m&aacute;s
	r&aacute;pido que Microsoft o Sun a las advertencias; Sun ten&iacute;a
	menos advertencias a las que responder, y a&uacute;n as&iacute; le
	llev&oacute; el tiempo responderlas.</B> Otro punto de vista
	importante es que SecurityPortal ha reunido una lista del <A HREF="http://securityportal.com/cover/coverstory20000117.html">tiempo
	que se toman los vendedores para responder a las vulnerabilidades</A>.
	Y concluyeron que : 
	</P>
	<BLOCKQUOTE><P>&iquest;C&oacute;mo de r&aacute;pido contestan? Red
	Hat obtuvo el mejor resultado, con 348 d&iacute;as para resolver 31
	advertencias, con un promedio de 11,23 d&iacute;as por error para
	corregirlos. Microsoft tuvo 982 d&iacute;as de retraso para corregir
	los 61 avisos, con un promedio de 16,10 d&iacute;as por error. Sun
	demostr&oacute; por s&iacute; mismo ser el m&aacute;s lento, y
	aunque tuvo s&oacute;lo 8 avisos acumulados, tard&oacute; 716 d&iacute;as
	en resolverlos, pr&aacute;cticamente tres meses para corregir cada
	uno.</P></BLOCKQUOTE>
	<P>Sus tablas de datos para 1.999 son como se muestran:<CENTER>
		<TABLE WIDTH=568 BORDER=1 CELLPADDING=2 CELLSPACING=0 RULES=NONE BGCOLOR="#444444">
			<COL WIDTH=80>
			<COL WIDTH=179>
			<COL WIDTH=105>
			<COL WIDTH=185>
			<TR BGCOLOR="#444444">
				<TD COLSPAN=4 WIDTH=562 BGCOLOR="#a6d2ff">
					<P ALIGN=CENTER><FONT FACE="Helvetica"><FONT SIZE=4><B>An&aacute;lisis
					de Avisos 1999</B></FONT></FONT></TD>
			</TR>
			<TR BGCOLOR="#444444">
				<TD WIDTH=80 BGCOLOR="#dddddd">
					<P><FONT FACE="Helvetica"><FONT SIZE=2><B>Vendedor</B></FONT></FONT></TD>
				<TD WIDTH=179 BGCOLOR="#dddddd">
					<P><FONT FACE="Helvetica"><FONT SIZE=2><B>D&iacute;as Totales
					para liberar correcciones</B></FONT></FONT></TD>
				<TD WIDTH=105 BGCOLOR="#dddddd">
					<P><FONT FACE="Helvetica"><FONT SIZE=2><B>Avisos Totales </B></FONT></FONT>
				</TD>
				<TD WIDTH=185 BGCOLOR="#dddddd">
					<P><FONT FACE="Helvetica"><FONT SIZE=2><B>D&iacute;as de Retraso
					por Aviso</B></FONT></FONT></TD>
			</TR>
			<TR BGCOLOR="#444444">
				<TD WIDTH=80 BGCOLOR="#eeeeee">
					<P ALIGN=LEFT><FONT SIZE=4>Red Hat</FONT></TD>
				<TD WIDTH=179 BGCOLOR="#eeeeee">
					<P ALIGN=CENTER><FONT SIZE=2>348</FONT></TD>
				<TD WIDTH=105 BGCOLOR="#eeeeee">
					<P ALIGN=CENTER><FONT SIZE=2>31</FONT></TD>
				<TD WIDTH=185 BGCOLOR="#eeeeee">
					<P ALIGN=RIGHT><FONT SIZE=2>11.23</FONT></TD>
			</TR>
			<TR BGCOLOR="#444444">
				<TD WIDTH=80 BGCOLOR="#eeeeee">
					<P ALIGN=LEFT><FONT SIZE=4>Microsoft</FONT></TD>
				<TD WIDTH=179 BGCOLOR="#eeeeee">
					<P ALIGN=CENTER><FONT SIZE=2>982</FONT></TD>
				<TD WIDTH=105 BGCOLOR="#eeeeee">
					<P ALIGN=CENTER><FONT SIZE=2>61</FONT></TD>
				<TD WIDTH=185 BGCOLOR="#eeeeee">
					<P ALIGN=RIGHT><FONT SIZE=2>16.10</FONT></TD>
			</TR>
			<TR BGCOLOR="#444444">
				<TD WIDTH=80 BGCOLOR="#eeeeee">
					<P ALIGN=LEFT><FONT SIZE=4>Sun</FONT></TD>
				<TD WIDTH=179 BGCOLOR="#eeeeee">
					<P ALIGN=CENTER><FONT SIZE=2>716</FONT></TD>
				<TD WIDTH=105 BGCOLOR="#eeeeee">
					<P ALIGN=CENTER><FONT SIZE=2>8</FONT></TD>
				<TD WIDTH=185 BGCOLOR="#eeeeee">
					<P ALIGN=RIGHT><FONT SIZE=2>89.50<!-- <tr<td bgcolor="#A6D2FF" colspan="5" align="right"<font size="-1" face="Helvetica"
 &nbsp; </td</tr --></FONT></TD>
			</TR>
			<TR>
				<TD COLSPAN=4 WIDTH=562></TD>
			</TR>
		</TABLE>
	</CENTER>
	<P>Est&aacute; claro que esta tabla utiliza un m&eacute;todo
	diferente para contar los problemas de seguridad que la anterior. De
	los tres sistemas anotados aqu&iacute;, Solaris de Sun era el que
	ten&iacute;a el menor n&uacute;mero de vulnerabilidades, pero fu&eacute;
	de lejos el que m&aacute;s tiempo se tom&oacute; para resolverlos.
	RedHat fu&eacute; el m&aacute;s r&aacute;pido corrigiendo problemas
	de seguridad, y se situaba en posici&oacute;n intermedia en el
	n&uacute;mero de ellas. Es adecuado hacer notar que OpenBSD (que
	tambi&eacute;n es un sistema OSS/FS) tuvo menos vulnerabilidades
	reportadas que cualquiera de estos tres. Evidentemente, tener un
	sistema operativo propietario no le garantiza un sistema m&aacute;s
	seguro: Microsoft tuvo el m&aacute;yor n&uacute;mero de avisos de
	seguridad, de lejos, utilizando este m&eacute;todo de conteo.</P>
	<LI><P><B>Apache tuvo un mejor registro de seguridad que Microsoft
	IIS, si medimos informes de vulnerabilidades serias. </B>El art&iacute;culo
	de 20 de Julio de 2.001 de la revista eWeek <A HREF="http://www.zdnet.com/eweek/stories/general/0,11011,2792860,00.html">``Apache
	impide la mayor&iacute;a de los riesgos de seguridad''</A> examin&oacute;
	los avisos de seguridad realizados en el pasado a Apache 1.0.
	Encontraron que el &uacute;ltimo aviso de seguridad serio para
	Apache (uno en el que atacantes remotos podr&iacute;an correr c&oacute;digo
	arbitrario en el servidor) se anunci&oacute; en Enero de 1.997. Un
	grupo de problemas de menor seriedad (incluyendo una sobrecarga de
	buffer en la utilidad logresolve del servidor) se anunci&oacute; y
	corrigi&oacute; en Enero de 1.998 con Apache 1.2.5. En los tres a&ntilde;os
	y medio siguientes, los &uacute;nicos problemas de seguridad remota
	han sido posibilidades de denegaci&oacute;n de servicio, y lagunas
	de seguridad de informaci&oacute;n (donde los atacantes pod&iacute;an
	ver ficheros o listados de directorios que no deber&iacute;an ver).<!-- They don't mention in their article, for example, that
     Apache 1.3.20 fixed a vulnerability in the Win32 and OS/2 ports,
     where a client could cause a fault in the child process that had to
     be manually cleared.  There were no identified means of using this
     as an exploit to compromise server data, so this was purely a DoS.
     See http://httpd.apache.org/dist/httpd/CHANGES_1.3.
     Thus, it appears the article really is correct. -->
	
	</P>
	<P>Por contra, en el art&iacute;culo <A HREF="http://www.zdnet.com/eweek/stories/general/0,11011,2792859,00.html">``IT
	bugs out over IIS security</A>,'' (N. del T. Una traducci&oacute;n
	algo libre del t&iacute;tulo podr&iacute;a ser &ldquo;Las polillas
	de las TI planean sobre la seguridad de ISS&rdquo;), eWeek determin&oacute;
	que Microsoft recibi&oacute; <A HREF="http://www.microsoft.com/technet/treeview/default.asp?url=/technet/itsolutions/security/current.asp?productid=17&amp;servicepackid=0">21
	boletines de seguridad para IIS desde Enero de 2.000 a Junio de
	2.001</A>. Determinando que este n&uacute;mero parec&iacute;a un
	poco dificil, y que el art&iacute;culo no hac&iacute;a referencia a
	sus complejidades, examin&eacute; yo mismo los boletines de
	Microsoft para encontrar su significado aut&eacute;ntico. No todo
	los boletines tienen el mismo significado, por lo que simplemente
	decir &ldquo;21 boletines&rdquo; no da un cuadro completo. Sin
	embargo, est&aacute; claro que varios de estos boletines discuten
	vulnerabilidades peligrosas que permiten a un usuario externo tomar
	control sobre el sistema. Yo cont&eacute; 5 boletines con tales
	vulnerabilidades altamente peligrosas para IIS 5.0 (en el periodo
	desde Enero 2.000 a Junio de 2.001), y previamente a este momento,
	cont&eacute; tres boletines m&aacute;s referidos a IIS 4.0 (en el
	periodo de Junio de 1.998 a Diciembre de 1.999). Puede esaminar
	estos boletines usted mismo: son los n&uacute;meros MS01-033,
	MS01-026, MS01-025, MS01-023, MS00-086, MS99-025, MS99-019, y
	MS99-003.<!-- For IIS 5.0,
    I count one in June 2001, three in May 2001, and one in November 2000.

    MS01-033: Unchecked Buffer in Index Server ISAPI Extension Could Enable...
    MS01-026: Superfluous Decoding Operation Could Allow Command Execution...
    MS01-025: Index Server Search Function Contains Unchecked Buffer
    MS01-023: Unchecked Buffer in ISAPI Extension could Enable Compromise...
    MS00-086: Web Server File Request Parsing

    Before January 2000 only previous IIS versions are listed;
     for IIS 4.0, I count July 1999, June 1999, and February 1999.

    July 1999: MS99-025: Unauthorized Access to IIS Servers through ODBC...
    June 1999: MS99-019: Malformed HTR Request
    Feb  1999: MS99-003: IIS Malformed FTP List Request

 -->
	El gusano <A HREF="http://www.cert.org/advisories/CA-2001-19.html">Code
	Red</A> , por ejemplo, atac&oacute; un gran n&uacute;mero de sitios
	con IIS a trav&eacute;s de vulnerabilidades identificadas en el
	bolet&iacute;n de seguridad MS01-033 de Junio de 2.001.</P>
	<P>En resumen, totalizando el n&uacute;mero de informes de
	vulnerabilidades peligrosas (que permiten a los atacantes ejecutar
	c&oacute;dido arbitrario), encontr&eacute; un total de 8 boletines
	para IIS desde Junio de 1.998 a Junio de 2.000, mientras que Apache
	no tuvo ninguna vulnerabilidad de este tipo en el mismo periodo. El
	&uacute;ltimo informe de Apache fu&eacute; en Junio de 1.998, y
	afectaba al analizador de logs, no al servidor web en s&iacute;
	mismo. Como se anot&oacute; anteriormente, la &uacute;ltima
	vulnerabilidad de tal peligro en Apache mismo se anunci&oacute; en
	Enero de 1.997.</P>
	<P>Incluso esto no muestra el panorama completo, sin embargo: una
	vulnerabilidad en IIS es m&aacute;s peligrosa que la una
	vulnerabilidad equivalente en Apache, porque Apache sigue
	escrupulosamente la buena pr&aacute;ctica de seguridad del &ldquo;menor
	privilegio&rdquo;. IIS est&aacute; dise&ntilde;ado de tal forma que
	cualquiera que toma el control sobre IIS lo hace sobre el <I>sistema
	completo</I>, pudiendo realizar acciones como leer, modificar o
	borrar cualquier fichero del sistema. Por contraste, Apache se
	instala con muy pocos privilegios por defecto, de forma que tomar el
	control de Apache da a los atacantes relativamente pocos
	privilegios. Por ejemplo, atacar Apache no otorga a los atacantes el
	derecho a modificar o borrar la mayor&iacute;a de los ficheros. Por
	supuesto, esto no es perfecto, y un atacante puede ser capaz de
	encontrar otra vulnerabilidad para darle acceso completo, pero un
	sistema Apache presenta m&aacute;s dificultades que uno IIS.</P>
	<P>El art&iacute;culo afirma que hay cuatro razones por las que la
	seguridad de Apache es m&aacute;s fuerte, y tres de estas razones
	son simplemtente buenas pr&aacute;cticas de seguridad. Apache
	instala muy pocas extensiones del servidor por defecto (una
	aproximaci&oacute;n &ldquo;minimalista&rdquo;), todos los
	componentes del servidor corren como un usuario sin privilegios
	(suportando &ldquo;bajos privilegios&rdquo;, como anotamos antes), y
	todos los ajustes de configuraci&oacute;n son centralizados
	(haciendo facil para los administadores saber lo que est&aacute;
	pasando). Sin embargo, el art&iacute;culo tambi&eacute;n indica que
	una de las principales razones por las que Apache es m&aacute;s
	seguro que IIS es porque el &ldquo;c&oacute;digo fuente de los
	ficheros del n&uacute;cleo del servidor est&aacute;n bien
	escrutados&rdquo;, una tarea que es mucho m&aacute;s facil siendo
	OSS/FS, y que podr&iacute;a utilizarse para defender que el OSS/FS
	incrementa las otras buenas pr&aacute;cticas de seguridad.</P>
	<P>Por supuesto, un simple conteo de las vulnerabilidades no es
	necesariamente una buena medida. Un vendedor liberar&iacute;a
	intencionadamente menos boletines, pero una vez que el c&oacute;digo
	de Apache se discute p&uacute;blicamente, parecer&iacute;a raro que
	Apache estuviese liberando menos noticias. Se podr&iacute;an dar
	menos noticias de vulnerabilidades si el pruducto no estuviese bien
	revisado, o si se utilizase r&aacute;ramente, pero esto s&iacute;mplemente
	no es cierto con Apache. Incluso la l&iacute;nea de la tendencia no
	es alentadora: utilizando los meses de los biletines, (2/99, 6/99,
	7/99, 11/00 tres en 5/01 y 6/01), encuentro que el preriodo en meses
	entre los anuncios de nuevas vulnerabilidades importantes encuentro
	4, 1, 18, 6, 0, 0, 1 y 3 hasta Septiembre de 2.001. Esto se compara
	con los 12 y 44 hasta Septiembre de 2.001 de Apache. Dadas estas
	tendencias, parece que la seguridad de IIS se est&aacute;
	incrementando muy lentamente, y hace dificil que llegue a alcanzar a
	la seguridad de Apache en un pr&oacute;ximo futuro. En lugar de
	ello, estas formas de contar las vulnerabilidades se corroboran con
	otras medidas como el rango de alteraci&oacute;n de sitios web.</P>
	<P>La conclusi&oacute;n m&aacute;s importante a extraer aqu&iacute;
	es que ning&uacute;n programa particular es invencible (&iexcl;en
	ning&uacute;n sentido!), pero evidentementemente es m&aacute;s
	probable resistir ataques futuros bas&aacute;ndonos en rendimientos
	del pasado. Est&aacute; claro que Apache tiene unos registros de
	seguridad mucho mejores que los de IIS, de forma que el Gartner
	Group ha decidio hacer una recomendaci&oacute;n inusual, que
	comentamos a continuaci&oacute;n.</P>
	<LI><P><B>El Gartner Group est&aacute; recomendando que las empresas
	migren de Microsoft IIS a Apache o iPlanet debido a los pobres
	registros de seguridad de IIS, notando que las empresas han gastado
	1,2 millardos (N. del T: 1.200 millones, 1,2 billones en
	norteam&eacute;rica) de $ US s&iacute;mplemente corrigiendo las
	vulnerabilidades de Code Red (relacionadas con IIS) en Julio de
	2.001. </B>Microsoft IIS tiene tan mal registro de seguridad que en
	Septiembre de 2.001, <A HREF="http://news.cnet.com/news/0-1003-201-7239473-0.html?tag=nbs">Gartner
	Group anunci&oacute; una recomendaci&oacute;n</A> indicando que &quot;las
	empresas acatadas por Code Red y Nimda deber&iacute;an investigas
	inmediatamente alternativas a IIS, incluyendo migrar sus
	aplicaciones Web a software servidor Web de otros proveedores, como
	iPlanet o Apache. Aunque estos servidores han necesitado algunos
	parches de seguridad, tienen mucho mejores registros de seguridad
	que IIS,y no est&aacute;n bajo el ataque activo de un gran n&uacute;mero
	de escritores de gusanos y de virus&quot;. Microsoft es a veces
	cliente del Gartner Group, por lo que este anuncio es
	particularmente sorprendente. 
	</P>
	<P><!-- "Lack of Security Processes Keeps Sending Enterprises to 'Code Red',
     1 August 2001, John Pescatore, Note Number FT-14-2441. -->En
	un <A HREF="http://www.gartner.com/DisplayDocument?id=336339">documento
	de respaldo del Gartner</A>, discuten m&aacute;s a fondo los
	impactos de Code Red. En Julio de 2.001, Computer Economics (una
	firma de investigaci&oacute;n) estim&oacute; que las empresas de
	todo el mundo hab&iacute;an gastado 1,2 millardos de d&oacute;lares
	corrigiendo vulnerabilidades en sus sistemas de TI que Code Red
	podr&iacute;a explotar (recuerde que Code Red est&aacute; dise&ntilde;ado
	para atacar &uacute;nicamente a sistemas IIS, mientras que los
	sistemas Apache son inmunes). Para ser justos, Gartner anot&oacute;
	correctamente que el problema no es s&oacute;lo que IIS tenga
	vulnerabilidades, sino que parte del problema es que las empresas
	que utilizan IIS no est&aacute;n manteniendo la seguridad de sus TI
	actualizadas, y Gartner pregunto abiertamente porqu&eacute; se daba
	esta situaci&oacute;n. M&aacute;s a&uacute;n, Gartner tambi&eacute;n
	realiz&oacute; otra pregunta, &quot;&iquest;porqu&eacute; los
	productos de software de Microsoft contin&uacute;an proporcionando
	aperturas facilmente explotadas por los atacantes?&quot;. Esto fu&eacute;
	una premonici&oacute;n, una vez que poco despu&eacute;s sobrevino el
	ataque de &quot;Nimba&quot; contra IIS, Microsoft Outlook y otros
	productos de Microsoft.</P>
	<P><!-- http://seattlep-i.nwsource.com/business/aptech_story.asp?category=1700&slug=Microsoft%20Gartner -->Aqu&iacute;
	procede un breve apartado. El portavoz de Microsoft Jim Desler
	intent&oacute; contrarrstar la recomendaci&oacute;n de Gartner,
	intentando etiquetarla como &quot;extrema&quot;, y diciendo que
	&quot;vulnerabilidades serias se han encontrado en todos los
	productos y plataformas para servidores web. Esto es un reto a toda
	la industria&quot;. Aunque esto es cierto, no es una verdad
	completa. Como apunt&oacute; Gartner, &quot;IIS tiene un mont&oacute;n
	de vulnerabilidades de seguridad m&aacute;s que otros productos y
	requiere m&aacute;s cuidado y atenci&oacute;n&quot;. Tiene sentido
	seleccinar el producto con un mejor registro de seguridad, aunque
	ning&uacute;n producto tenga un registro perfecto.</P>
	<LI><P><B>La mayor&iacute;a de los problemas de seguridad m&aacute;s
	serios s&oacute;lo afectan a productos de Microsoft, y no a
	productos OSS/FS, como sugirieron el CERT/CC en &quot;tipos de
	incidentes y vulnerabilidades de seguridad de m&aacute;s impacto y
	m&aacute;s frecuentes&quot; y la base de datos del ICAT. </B>Hay
	vulnerabilidades que son m&aacute;s importantes que otras por varias
	razones. Por ello, algunos an&aacute;lisis se centran en intentar
	determinar lo que es &quot;m&aacute;s mportante&quot;, y sus
	resultados sugieren que OSS/FS no tienen tantas vulnerabilidades.</P>
	<P>El Centro de Coordinaci&oacute;n del CERT (CERT/CC) se fund&oacute;
	federalmente para estudiar vulnerabilidades de seguridad y realizar
	actividades relacionadas tales como publicar alertas de seguridad.
	He muestreado su lista de <A HREF="frozen/cert_current_activity.html">``actividad
	actual'' de los incidentes de seguridad y vulnerabilidades m&aacute;s
	frecuentes y de alto impacto el 24 de Septiembre de 2.001</A>, y he
	encontrado a&uacute;n m&aacute;s evidencias de que los productos de
	Microsoft tienen peor seguridad comparados con otros (incluyendo
	OSS/FS). Cuatro de las seis vulnerabilidades m&aacute;s importantes
	fueron espec&iacute;ficas de Microsoft: W32/Nimda, W32/Sircam,
	corrupci&oacute;n de la cach&eacute; en servidores de DNS de
	Microsoft, y actividades relacionadas con &quot;Code Red&quot;. S&oacute;lo
	uno de los seis puntos afectaba inicialmente a productos
	no-Microsoft (una sobrecarga de buffer de telnetd); aunque esta
	vulnerabilidad particular es importante, no es equivocado notar que
	muchos sistemas de fuente abierta (como Red Hat 7.1) normalmente no
	habilitan este servicio (telnet) en primer lugar, y por ello est&aacute;n
	m&aacute;s alejados de ser vulnerables. El sexto de los ejemplos
	(&quot;barridos y pruebas&quot;) es un aviso general de que hay un
	gran n&uacute;mero de barridos y pruebas en Internet, lo que puede
	dar lugar a muchas vulnerabilidades potentiales en todos los
	sistemas. En resumen, 4 de 6 ejemplos de vulnerabilidades de alto
	impacto son espec&iacute;ficos de Microsoft, 1 de 6 son
	vulnerabilidades que afectan inicalmente a sistemas de tipo UNIX
	(incluyendo sistemas operativos OSS/FS), y 1 de 6 es una nota
	general sobre barridos. De nuevo, no es que los productos OSS/FS
	nunca tengan vulnerabilidades de seguridad, sino que demuestran que
	tienen menos.</P>
	<P>Es sistema <A HREF="http://icat.nist.gov/">ICAT</A> proporciona
	un &iacute;ndice y una ordenaci&oacute;n navegable de las
	vulnerabilidades haciendo referencias cruzadas por CVE. He
	muestreado sus 10 primeros el 19 de Diciembre de 2.001; esta lista
	de los 10 primeros se define por el n&uacute;mero de requerimientos
	realizados para una vulnerabilidad particular en el ICAT (e
	incluyendo &uacute;nicamente vulnerabilidades del &uacute;ltimo
	a&ntilde;o). En este caso, 8 de estas 10 vulnerabilidades afectan
	s&oacute;lo a sistemas propietarios (en todos los casos, Windows).
	S&oacute;lo 2 de los 10 afectan a sistemas OSS/FS (la 6&ordf;,
	CAN-2001-0001, una debilidad en PHP-Nuke 4.4, y la 8&ordf;,
	CVE-2001-0013, una nueva vulnerabilidad encontrada en una versi&oacute;n
	vieja de BIND, BIND 4). Obviamente, esto no prueba por s&iacute;
	mismo que las vulnerabilidades en sistemas OSS/FS son menos serias,
	pero lo sugieren.<!-- Here's the detailed "ICAT Top Ten List" from 12/19/01.
ICAT contained the CVE database last updated 12/06/01, 3311 vulnerabilities.

"the top ten most popular vulnerabilities as defined by the number of requests made for a particular vulnerability in ICAT. Only vulnerabilities published within the last year are included in order to keep the list focused on relevant problems."

1  CVE-2001-0333
Directory traversal vulnerability in IIS 5.0 and earlier allows remote attackers to execute arbitrary commands by encoding .. (dot dot) and "\" characters twice.
2 CAN-2001-0500
Buffer overflow in ISAPI extension (idq.dll) in Index Server 2.0 and Indexing Service 2000 in IIS 6.0 beta and earlier allows remote attackers to execute arbitrary commands via a long argument to Internet Data Administration (.ida) and Internet Data Query (.idq) files.
3 CVE-2001-0241
Buffer overflow in Internet Printing ISAPI extension in Windows 2000 allows remote attackers to gain root privileges via a long print request that is passed to the extension through IIS 5.0.
4 CVE-2001-0002
Internet Explorer 5.5 and earlier allows remote attackers to obtain the physical location of cached content and open the content in the Local Computer Zone, then use compiled HTML help (.chm) files to execute arbitrary programs.
5 CAN-2000-1200
Windows NT allows remote attackers to list all users in a domain by obtaining the domain SID with the LsaQueryInformationPolicy policy function via a null session and using the SID to list the users.
6 CAN-2001-0001
cookiedecode function in PHP-Nuke 4.4 allows users to bypass authentication and gain access to other user accounts by extracting the authentication information from a cookie.
7 CVE-2001-0004
IIS 5.0 and 4.0 allows remote attackers to read the source code for executable web server programs by appending "%3F+.htr" to the requested URL, which causes the files to be parsed by the .HTR ISAPI extension, aka a variant of the "File Fragment Reading via .HTR" vulnerability.
8 CVE-2001-0013
Format string vulnerability in nslookupComplain function in BIND 4 allows remote attackers to gain root privileges.
9 CVE-2001-0335
FTP service in IIS 5.0 and earlier allows remote attackers to enumerate Guest accounts in trusted domains by preceding the username with a special sequence of characters.
10 CVE-2001-0003
Web Extender Client (WEC) in Microsoft Office 2000, Windows 2000, and Windows Me does not properly process Internet Explorer security settings for NTLM authentication, which allows attackers to obtain NTLM credentials and possibly obtain the password, aka the "Web Client NTLM Authentication" vulnerability.
 -->
	
	</P>
	<P><B>Los virus de ordenador prevalecen arrolladoramente m&aacute;s
	en Windows que en cualquier otro sistema. </B>La infecci&oacute;n
	por virus han supuesto un coste fundamental para los usuarios de
	Microsoft Windows. El virus LoveLetter por s&iacute; mismo ha
	supuesto un coste estimado de 960 millones de d&oacute;lares en
	costes directos, y 7,7 billones (&iquest;americanos, 7.700 millones
	entonces? N. del T.) en p&eacute;rdidas de productividad, y la
	industria de software antivirus vende en total aproximadamente 1
	bill&oacute;n (&iquest;1.000 millones? N. del T.) en total. El
	<A HREF="http://www.govtalk.gov.uk/interoperability/egif_document.asp?docnum=430"><I>An&aacute;lisis
	del impacto del Software de Fuente Abierta</I></A> de los doctores
	Nic Peeling y Julian Satchell incluye un an&aacute;lisis de las
	variadas fuentes de datos sobre recuentos de virus. Aqu&iacute;
	tenemos lo que han dicho:<!-- section 2.13 discusses virus counts -->
	
	</P>
	<BLOCKQUOTE><P>Los n&uacute;meros difieren en los detalles, pero
	todas las fuentes indican que los virus de ordenador prevalecen
	arrolladoramente en Windows sobre los presentes en cualquier otro
	sistema. Hay aproximadamente 60.000 virus conocidos en Windows, m&aacute;s
	o menos 40 para Macintosh, alrededor de 5 para Unix comerciales, y
	unos 40 para Linux. La mayor&iacute;a de los virus sobre Windows no
	son importantes, pero varios cientos han causado extensos da&ntilde;os.
	Dos o tres de los virus de Macintosh fueron lo bastantes extensos
	para ser de importancia, y ninguno de los virus en Unix o Linux se
	extendieron (la mayor&iacute;a quedaron confinados al laboratorio).</P></BLOCKQUOTE>
	<BLOCKQUOTE><P>&iquest;Porqu&eacute; es Windows tan
	desproporcionadamente vulnerable? Hay tres razones, una social y dos
	t&eacute;cnicas. Windows es el objetivo m&aacute;s atractivo para
	los que escriben virus, simplemente por su extensa implantaci&oacute;n.
	Para que un virus haga su &quot;trabajo&quot;, tiene que
	transmitirse &eacute;l mismo a otro ordenador susceptible; en
	promedio, cada infecci&oacute;n debe causar una m&aacute;s. La
	ubicuidad de las m&aacute;quinas Windows hace m&aacute;s f&aacute;cil
	que esto se produzca. Finalmente, Windows ha tenido una porci&oacute;n
	de elecciones de dise&ntilde;o durante los a&ntilde;os (por ejemplo,
	ejecuci&oacute;n de macros en el arranque de Word, ejecuci&oacute;n
	de ficheros enlazados en Outlook, ausencia de protecci&oacute;n de
	escritura en los directorios del sistema en Windows 3.1/95/98) que
	han permitido la ejecuci&oacute;n de c&oacute;digo indeseado,
	convirtiendolo en un objetivo muy sencillo.</P></BLOCKQUOTE>
	<P>Aunque es posible escribir virus para sistemas OSS/FS, su dise&ntilde;o
	hace m&aacute;s dificil que se extiendan. Parece que los
	desarrolladores de OSS/FS tiendan a seleccionar elecciones de dise&ntilde;o
	que limitan el da&ntilde;o de los virus quiz&aacute;s en parte
	porque su c&oacute;digo est&aacute; sujeto a la inspecci&oacute;n y
	el comentario p&uacute;blico. Por ejemplo, los programas OSS/FS no
	suelen soportar la ejecuci&oacute;n de macros a arranque, y los
	sistemas operativos OSS/FS (tales como GNU/Linux y los *BSD,s)
	siempre han tenido protecci&oacute;n de escritura en los directorios
	del sistema.</P>
	<LI><P><B>De acuerdo a una evaluaci&oacute;n de Network Security, el
	mejor scanner de vulnerabilidad (el m&aacute;s efectivo) es un
	producto OSS/FS (Nessus). </B>El 8 de Enero de 2.001, el art&iacute;culo
	de Network Computing <A HREF="http://www.networkcomputing.com/1201/1201f1b1.html"><I>Vulnerability
	Assessment Scanners</I></A>. Inform&oacute; sobre una evaluaci&oacute;n
	de nueve herramientas de barridos de red, la mayor&iacute;a de ellos
	propietarios. En su evaluaci&oacute;n, Network Computing prepararon
	sistemas de demostraci&oacute;n con 17 de las vulnerabilidades m&aacute;s
	comunes y cr&iacute;ticas; a continuaci&oacute;n comprobaron las
	variadas herramientas de barrido de red para comprobar con cuanta
	efectividad detectaban estas vulnerabilidades. Lamentablemente,
	ninguno de los productos detect&oacute; todas las vulnerabilidades.
	El mejor de los scanners fue el programa OSS/FS Nessus Security
	Scanner, que encontr&oacute; 15 de los 17 (y que tambi&eacute;n
	recibi&oacute; el resultado total m&aacute;s alto); el siguiente
	mejor era un scanner propietario que encontr&oacute; 13,5 de 17.</P>
	<P>En sus palabras, 
	</P>
	<BLOCKQUOTE><P>Algunos de nosotros eramos algo esc&eacute;pticos
	sobre el proyecto de fuente abierta Nessus, hasta que &eacute;l
	mismo describri&oacute; el mayor n&uacute;mero de vulnerabilidades.
	Este es un duro argumento para presentar, y ahora estamos
	comiendonos nuestras palabras... [Nessus] obtuvo la mejor
	calificaci&oacute;n simplemente porque hizo correctamente m&aacute;s
	cosas que los otros productos. 
	</P></BLOCKQUOTE>
	<P>Estoy de acuerdo con los autores en que el scanner de
	vulnerabilidades de red ideal deber&iacute;a encontrar todas las
	vulnerabilidades bien conocidad, y que &quot;incluso un agujero es
	demasiado&quot;. Sin embargo, la perfecci&oacute;n es rara en el
	mundo real. A&uacute;n m&aacute;s importante, un scanner de
	vulnerabilidades deber&iacute;a ser s&oacute;lo una parte del
	proceso de seguridad de una organizaci&oacute;n, no deber&iacute;a
	ser la &uacute;nica actividad. A&uacute;n en este caso, esta
	evaluaci&oacute;n sugirere que una organizaci&oacute;n ser&aacute;
	<I>m&aacute;s</I> segura, no menos segura, utilizando un programa
	OSS/FS. Se prodr&iacute;a arg&uuml;ir que esti s&iacute;mplemente
	muestra que este programa OSS/FS particular es m&aacute;s funcional,
	no m&aacute;s seguro, pero en este caso, la simple funcionalidad del
	producto es ya un incremente de la seguridad.</P>
</OL>
<P>Un problema serio es que hay fuertes desincentivaciones econ&oacute;micas
para que los vendedores de software propietario hagan su software
seguro. Por ejemplo, si los vendedores hacen su software m&aacute;s
seguro, no conseguir&iacute;an ser los &quot;primeros&quot; en un
mecado dado; y esto har&iacute;a que pierdan ese mercado. Puesto que
para los clientes es muy dificil distinguir el software propietario
con alta seguridad del que tiene una seguridad pobre, los productos
pobres tienen a expulsar del mercado a los buenos (a fin de cuentas,
son m&aacute;s baratos de producir, y por lo tanto menos costosos).
Los gobiernos tienen otros factores de desincentivaci&oacute;n. Sobre
una discusi&oacute;n de algunas desincentivaciones econ&oacute;micas
para el software seguro, vea <A HREF="http://www.acsac.org/2001/abstracts/thu-1530-b-anderson.html"><I>Why
Information Security is Hard - an Economic Perspective</I> by Ross
Anderson</A> (Proceedings of the Annual Computer Security
Applications Conference (ACSAC), December 2001, pp. 358-365). No est&aacute;
claro que el OSS/FS siempre evite estas desincentivaciones, pero
parece que al menos en algunos casos lo hace. Por ejemplo, el c&oacute;digo
fuente de OSS/FS es p&uacute;blico, de modo que la diferenci en la
seguridad es m&aacute;s visible que en productos propietarios.</P>
<P>Uno de los problemas de seguridad m&aacute;s peligrosos con el
software propietario es que si incluye software intencionadamente
malicioso, tal c&oacute;digo es extremadamente dificil de encontrar.
Pocos vendedores de software propietario tienen otros desarrolladores
examinando <I>todo</I> el c&oacute;digo en gran detalle: sus procesos
de pruebas est&aacute;n dise&ntilde;ados para detectar errores (no
malicia), y por ello no revisan el c&oacute;digo completo..<!-- If you doubt, consider all the ``Easter eggs'' in proprietary software,
such as flight simulators in spreadsheet programs - rarely are these
Easter eggs approved by management (see
<a href="http://www.eggscentral.com"Eggs Central</a and
<a href="http://www.eeggs.com"EEggs</a, which actually collect lists
of them).
The problem isn't Easter eggs themselves - the problem is that,
since they easy slip through without management approval, it's clear that
malicious code could slip into proprietary software in many
organizations too.
 -->
Por contraste, cualquiera puede encontrar c&oacute;digo malicioso
cuando el c&oacute;digo fuente es p&uacute;blicamente disponible, y
con OSS/FS hay incentivos para que personas arbitrarias puedad
revisarlo (como a&ntilde;adir nuevas funcionalidades o realizar una
revisi&oacute;n de seguridad). Por ello, alguien que inserte c&oacute;digo
malicioso en un proyecto OSS/FS corre un riesgo mucho mayor de ser
descubierto. Hay dos ejemplos, uno confirmado, y el otro no: 
</P>
<OL>
	<LI>En alg&uacute;n momento entre 1.992 y 1.994, Borland insert&oacute;
	intencionadamente una &quot;puerta trasera&quot; en su servidor de
	base de datos &quot;InterBase&quot;, como un usuario secreto con
	password fijo. Esta puerta trasera permit&iacute;a a cualqueir
	usuario local o remoto manipular cualquier objeto de base de datos,
	e instalar programas arbitrarios, y en algunos casos podr&iacute;a
	adquirir el control de la m&aacute;quina como &quot;root&quot;. Esta
	vulnerabilidad permaneci&oacute; en el producto al menos durante 6
	a&ntilde;os, ya que nadie m&aacute;s podr&iacute;a revisar el
	c&oacute;digo, y Borland no ten&iacute;a motivos para retirarla.
	Cuando Borland liber&oacute; el codigo fuente en Julio de 2.000 como
	un proyecto OSS/FS, el proyecto &quot;Firebird&quot; empez&oacute; a
	trabajar con el c&oacute;digo fuente, y describri&oacute; este serio
	problema de seguridad de InterBasej en Diciembre de 2.000 (s&oacute;lo
	5 meses tras la liberaci&oacute;n). En Enero de 2.001, el CERT
	anunci&oacute; la existencia de esta puerta trasera como aviso CERT
	CA-2001-01. Es descorazonador que esta puerta trasera era f&aacute;cilmente
	visible por un simple dump ASCII del c&oacute;digo (un truco com&uacute;n
	de cracker), de modo que es muy posible que esta vulnerabilidad se
	haya explotado m&uacute;chas veces en los a&ntilde;os anteriores.
	Una vez la revisi&oacute;n por los desarrolladores de fuente abierta
	encontraron este problema, se corrigi&oacute; muy r&aacute;pidamente.<LI><P>
	Mohammad Afroze Abdul Razzak, arrestado por la polic&iacute;a de
	Mumbai (Bombay) el 2 de Octubre de 2.001, indic&oacute; que <A HREF="http://www.newsbytes.com/news/01/173039.html">La
	red Al Qaeda de Osama bin Laden era capaz de conseguir empleo en
	Microsoft, y que planeaba insertar &quot;trojanos, puertas traseras
	y errores en Windows XP.&quot;</A> Esto se le inform&oacute; a Ravi
	Visvesvaraya Prasad, un consultor de telecomunicaciones y sistemas
	de informaci&oacute;n de Nueva Delhi, y luego lo inform&oacute; la
	divisi&oacute;n Newsbytes del <A HREF="http://www.newsbytes.com/about/index.html">Washington
	Post</A>.<!-- (``Suspect Claims Al Qaeda Hacked Microsoft - Expert''
by Brian McWilliams, Newsbytes, Redmond, Washington, USA,
17 Dec 2001, 2:08 PM CST).
 -->
	Este aviso no fu&eacute; confirmado: en su lugar, yo soy algo
	exceptico. El problema, sin embargo, es que es imposible de
	descartar. Incluso si este caso particular no es cierto, observese
	que es un asunto desafortunadamente cre&iacute;ble en el software
	propietario, proque muy pocos de sus usuarios pueden revisar el
	c&oacute;digo. Esto es mucho menos peligroso en software OSS/FS,
	porque es posible una revisi&oacute;n por todo el mundo (incluyendo
	la capacidad de ver los cambios realizados en cada versi&oacute;n).</P>
</OL>
<P>Ya deber&iacute;a ser obvio a partir de estos ejemplo que los
sistemas OSS/FS no son m&aacute;gicamente invencibles por los
problemas de seguridad. En su lugar, hemos mostrado que hacer el
c&oacute;digo disponible da a los atacantes una ventaja (porque
tienen m&aacute;s informaci&oacute;n para realizar un ataque).
Mientras que OSS/FS da a los atacantes m&aacute;s informaci&oacute;n,
muestra tambi&eacute;n fuerzas opuestas: teniendo el c&oacute;digo
fuente disponible tambi&eacute;n da a los defensores m&aacute;s
informaci&oacute;n (porque tambi&eacute;n pueden examinar el c&oacute;digo
fuente original), y adem&aacute;s, los defensores pueden potenciar el
c&oacute;digo. Para una discusi&oacute;n m&aacute;s larga de estas
ideas, vean mi <A HREF="http://www.dwheeler.com/secure-programs/Secure-Programs-HOWTO/open-source-security.html">discussion
on open source and security</A> (parte de mi libro sobre <A HREF="http://www.dwheeler.com/secure-programs">writing
secure software</A>). Como vemos, a partir de estas im&aacute;genes,
parece que los sistemas OSS/FS sin mejores, y no s&oacute;lo iguales,
en su resistencia a los ataques.</P>
<H1><A NAME="tco"></A>Coste Total de Propiedad (TCO)</H1>
<P>El Coste Total de Propiedad (CTP, o TCO m&aacute;s habitualmente,
en ingl&eacute;s) es una medida importante; no muestra si el producto
empieza siendo muy barato, sino si se mantiene bajo durante su vida.
Por ello, el TCO se muestra muy sensible a las asumciones que se
hagan.</P>
<P>Por ello, para cualquier producto que utilice o soporte, se pueden
encontrar estudios de lo bajo que puede resultar el TCO en algunas
circunstancias. No es sorprendente que tanto<!-- was http://www.microsoft.com/NTServer/nts/exec/Compares/LowerTCO.asp -->
Microsoft como <A HREF="http://www.sun.com/servers/workgroup/tco/metastudy.html">Sun</A>
proporcionen estudios mostranto que tienen el menor TCO (pero vea ms
comentarios m&aacute;s abajo sobre el estudio de Microsoft). <A HREF="http://www.vnunet.com/Analysis/85833">Xephon</A>
tiene un estudio que determina que los mainframes son los m&aacute;s
baratos por usuario (debido a su control centralizado), con 3.450
libras esterlinas por usuario y a&ntilde;o (5.546,71 euros, 922.895
pta); el coste del Unix centralizado estar&iacute;a en 7.350 libras
usuario y a&ntilde;o, y el entorno PC descentralizado en 10.850
libras usuario y a&ntilde;o. <A HREF="http://www.xephon.com/">Xephon</A>
aparece como un consultor basado en mainframe, de forma que podr&iacute;a
tener inter&eacute;s en que los resultado saltan de esta forma. Hay
sin embargo determinadas ocasiones en las que aplicar mainframes
tiene sentido... pero veremos que a&uacute;n en estos casos se puede
emplear un ambiente OSS/FS.</P>
<P>En resumen, qui&eacute;n tenga el menor TCO depende de su ambiente
y de sus necesidades. Para determinar el TCO, deben identificarse
todos los costes importantes (el &quot;modelo de costes&quot;) y
estimar su importe. No olvide los costes &quot;ocultos&quot;, como
los costes de administraci&oacute;n, de actualizaci&oacute;n, de
soporte t&eacute;cnico, de operaci&oacute;n del usuario final, etc.<!-- I once referenced the Gartner Group's TCO model, but they've reorganized
     their web site and it appears they no longer have a linkable location.
     It WAS at:
         http://www.gartner.com/public/static/consulting/tco/tcochart.html
     Their model used four categories: capital expenditure, technical support,
     administration and end-user operations, each broken down into
     items like costs of labour and training. 
     Some mention of it is at:
       http://www.zdnet.co.uk/pcmag/labs/1998/06/corp_pc/8.html
 -->
De este modo, el OSS/FS tiene una serie de ventajas de costes
importantes en varias categor&iacute;as que pueden dar lugar, en
muchos casos, a un TCO menor.</P>
<OL>
	<LI><P><B>OSS/FS es m&aacute;s barato en la adquisici&oacute;n
	inicial.</B> OSS/FS cuesta mucho menos en su adquisici&oacute;n
	inicial. OSS/FS no es realmente &quot;gratis&quot; en el sentido
	monetario del t&eacute;rmino (N. del T: a vueltas con las dos
	acepciones principales de free). El termino &quot;libre&quot; en
	&quot;software libre&quot; hace referencia a libertad, no a precio
	(habitualmente resumido como &quot;libertad de palabra, no cerveza
	gratis&quot; &quot;free speech, not free beer&quot;). Tambi&eacute;n
	se gasta dinero por la documentaci&oacute;n en papel, suporte,
	entrenamiento, administraci&oacute;n del sistema, y otros as&iacute;,
	igual que con los sistemas propietarios. En muchos casos, los
	programas recogidos en las distribuciones OSS/FS se pueden descargar
	libremente (<A HREF="http://www.linux.org/dist/index.html">linux.org
	proporciona algunos punteros a donde encontrar las distribuciones</A>).
	Sin embargo, la mayor&iacute;a de las personas (especialmente los
	principiantes y quienes no tengan conexiones de internet de alta
	velocidad) querr&aacute;n pagar una peque&ntilde;a cantidad a un
	distribuidor por un paquete agradablemente integrados con CD-ROMs,
	documentaci&oacute;n en papel, y soporte. Incluso en este caso
	OSS/FS es menos costoso de adquirir.</P>
	<P>Por ejemplo, mirando en algunas diferencias de precios cuando se
	intenta configurar un servidor (digamos un servidor de web p&uacute;blico,
	o un servidor de ficheros y correo de una intranet, en el cual se
	podr&iacute;a desear disponer de C++ y un RDBMS para algunas
	porciones). Esto es un ejemplo, por supuesto. Misiones diferentes
	involucrar&aacute;n componentes diferentes. Se han utilizado los
	precios de ``Global Computing Supplies'' (Suwanee, GA), en
	Septiembre de 2.000, y redondeado al dolar. Un resumen r&aacute;pido
	de algunos costes: 
	</P>
	<TABLE WIDTH=691 BORDER=1 CELLPADDING=2 CELLSPACING=3>
		<COL WIDTH=119>
		<COL WIDTH=146>
		<COL WIDTH=400>
		<TR BGCOLOR="#bac0ff">
			<TD WIDTH=119>
				<P>&nbsp;</TD>
			<TD WIDTH=146>
				<P>MS Windows 2000</TD>
			<TD WIDTH=400>
				<P>Red Hat Linux</TD>
		</TR>
		<TR BGCOLOR="#ccccfe">
			<TD WIDTH=119>
				<P>Sistema Operativo</TD>
			<TD WIDTH=146>
				<P>$1510 (25 clientes)</TD>
			<TD WIDTH=400>
				<P>$29 (est&aacute;ndar), $76 deluxe, $156 professional (todos
				ilimitado)</TD>
		</TR>
		<TR BGCOLOR="#ccccfe">
			<TD WIDTH=119>
				<P>Servidor de Email</TD>
			<TD WIDTH=146>
				<P>$1300 (10 clientes)</TD>
			<TD WIDTH=400>
				<P>inclu&iacute;do (ilimitado)</TD>
		</TR>
		<TR BGCOLOR="#ccccfe">
			<TD WIDTH=119>
				<P>Servidor RDBMS</TD>
			<TD WIDTH=146>
				<P>$2100 (10 CALs)</TD>
			<TD WIDTH=400>
				<P>inclu&iacute;do (ilimitado)</TD>
		</TR>
		<TR BGCOLOR="#ccccfe">
			<TD WIDTH=119>
				<P>C++ Development</TD>
			<TD WIDTH=146>
				<P>$500</TD>
			<TD WIDTH=400>
				<P>inclu&iacute;do</TD>
		</TR>
	</TABLE>
	<P>Basicalmente, Microsoft Windows 2000 (25 clientes) cuesta $1510;
	su servidor de correo Microsoft Exchange (con acceso para 10
	clientes) cuesta $1300, su servidor RDBMS SQL Server 2000 cuesta
	$2100 (con 10 CALs), y su suite de desarrollo Visual C++ 6.0 cuesta
	$500. Red Hat Linux 6.2 (una distribuci&oacute;n de GNU/Linux
	&aacute;mpliamente usada) cuesta $29 por una versi&oacute;n est&aacute;ndar
	(con soporte a la instalaci&oacute;n de 90 d&iacute;as basada en
	email), $76 por la versi&oacute;n deLuxe (adem&aacute;s 30 d&iacute;as
	de soporte telef&oacute;nico a la instalaci&oacute;n) o $156 por la
	versi&oacute;n professional (que incluye soporte SSL para tr&aacute;fico
	web encriptado), incluyendo en todos los casos todas estas
	funcionalidades (serivodr web, servidor de correo, servidor de base
	de datos, C++, y mucho m&aacute;s). Un servidor web p&uacute;blico,
	con Windows 2000 y un RDBMS costar&iacute;a $3610 ($1510+$2100),
	contra $156 de Red Hat Linux, mientras que un servidor de intranet
	con Windows 2000 y un servidor de correo constar&iacute;a $2810
	($1510+$1300) contra $76 de Red Hat Linux.</P>
	<P>Ambos paquetes tienes funcionalidades que el otro no tiene. El
	sistema GNU/Linux tambi&eacute;n incluye un n&uacute;mero ilimitado
	de licencias; el n&uacute;mero de clientes que realmente se
	adquieran dependen de los requerimientos. Sin embargo, esto
	ciertamente muestra que en cualquier caso, los productos de servidor
	de Microsoft cuestan miles de d&oacute;lares m&aacute;s por servidor
	que el sistema GNU/Linux equivalente.</P>
	<P>Para otro an&aacute;lisis en detalle comparando los costes
	iniciales de GNU/Linux con los de Windows, vea <A HREF="http://www.cyber.com.au/cyber/about/linux_vs_windows_pricing_comparison.pdf"><I>Linux
	vs. Windows: The Bottom Line</I></A> de <A HREF="http://www.cyber.com.au/">Cybersource
	Pty Ltd</A>. Aqu&iacute; tenemos un resumen de su an&aacute;lisis
	(en d&oacute;lares USA y en 2.001):</P>
	<CENTER>
		<TABLE WIDTH=698 BORDER=1 CELLPADDING=2 CELLSPACING=3>
			<COL WIDTH=152>
			<COL WIDTH=100>
			<COL WIDTH=222>
			<COL WIDTH=191>
			<TR BGCOLOR="#bac0ff">
				<TD WIDTH=152>
					<P>&nbsp;</TD>
				<TD WIDTH=100>
					<P>Soluci&oacute;n Microsoft</TD>
				<TD WIDTH=222>
					<P>Soluci&oacute;n OSS/FS <BR>(GNU/Linux)</TD>
				<TD WIDTH=191>
					<P>Ahorros usando <BR>GNU/Linux</TD>
			</TR>
			<TR BGCOLOR="#ccccfe">
				<TD WIDTH=152>
					<P>Compa&ntilde;&iacute;a A <BR>(50 usuarios)</TD>
				<TD WIDTH=100>
					<P>$69,987</TD>
				<TD WIDTH=222>
					<P>$80</TD>
				<TD WIDTH=191>
					<P>$69,907</TD>
			</TR>
			<TR BGCOLOR="#ccccfe">
				<TD WIDTH=152>
					<P>Compa&ntilde;&iacute;a B <BR>(100 usuarios)</TD>
				<TD WIDTH=100>
					<P>$136,734</TD>
				<TD WIDTH=222>
					<P>$80</TD>
				<TD WIDTH=191>
					<P>$136,654</TD>
			</TR>
			<TR BGCOLOR="#ccccfe">
				<TD WIDTH=152>
					<P>Compa&ntilde;&iacute;a C <BR>(250 usuarios)</TD>
				<TD WIDTH=100>
					<P>$282,974</TD>
				<TD WIDTH=222>
					<P>$80</TD>
				<TD WIDTH=191>
					<P>$282,894</TD>
			</TR>
		</TABLE>
	</CENTER>
	<P><A HREF="http://consultingtimes.com/Serverheist.html">Consulting
	Times</A> encontr&oacute; que cuando el n&uacute;mero de buzones de
	correo crec&iacute;a, el TCO a tres a&ntilde;os de un mainframe con
	GNU/Linux se volv&iacute;a muy competitivo. Para 50.000 cuentas de
	correo, una soluci&oacute;n Exchange/Intel cuesta 5,4 millones de
	d&oacute;lares, mientras que la soluci&oacute;n Linux/IBM(G6) cuesta
	3,3 millones de d&oacute;lares. Para 5.000 buzones, Exchange/Intel
	cuesta 1,6 millones de d&oacute;lares, mientras que Groupware en IFL
	cuesta 362.890 $. Para otro estudio m&aacute;s, vea <A HREF="http://www.jimmo.com/Linux-NT_Debate/Cost_Comparison.html">Cost
	Comparison from jimmo.com</A>. Obviamente, la diferencia de precio
	depende de las funciones exactas que necesite utilizar, pero para
	muchas situaciones comunes, GNU/Linux cuesta mucho menos de
	adquirir.</P>
	<LI><P><B>Los costes de actualizaci&oacute;n son t&iacute;picamente
	menores. </B>Los costes de actualizaci&oacute;n a largo plazo son
	mucho menores para los sistemas OSS/FS. Por ejemplo, actualizar un
	sistema Microsoft t&iacute;picamente cuesta la mitad de la compra
	original. Esto es as&iacute;, porque esencialmente se est&aacute; en
	sus manos para los precios a largo plazo, una vez que es el &uacute;nico
	proveedor (v&eacute;ase <A HREF="http://osopinion.com/perl/story/9849.html"><I>Microsoft
	Turns the Screws</I></A>). En contraste, los sistemas GNU/Linux se
	pueden descargar (gratis) o simplemente recomprar (generalmente por
	menos de 100 $), y la &uacute;nica actualizaci&oacute;n se puede
	utilizar en todos los sistemas. Esto no incluye soporte t&eacute;cnico,
	pero en el soporte t&eacute;cnico podemos encontrar competencia, lo
	que en la pr&aacute;ctica no se da con el software propietario. Si
	no le gusta su suministrador de GNU/Linux, lo puede cambiar. 
	</P>
	<LI><P><B>OSS/FS puede de paso utilizar hardware m&aacute;s antiguo,
	con m&aacute;s eficacia en los sistemas propietarios, reduciendo a&uacute;n
	m&aacute;s los costes de hardware, y en algunos casos eliminando la
	necesidad de ese nuevo hardware. </B>OSS/FS corre m&aacute;s r&aacute;pido
	en hardware m&aacute;s r&aacute;pido, por supuesto, pero muchos
	programas OSS/FS pueden utilizar hardware m&aacute;s antiguo m&aacute;s
	eficientemente que el software propietario, resultando en un coste
	del hardware menor, e incluso en algunos casos no requiriendo nuevos
	costes (porque los sistemas &quot;descartados&quot; pueden a menudo
	utilizarse de nuevo). Por ejemplo, los <A HREF="http://www.microsoft.com/windows2000/server/evaluation/sysreqs/default.asp">requerimientos
	m&iacute;nimos para Microsoft Windows 2000 Server (de acuerdo a las
	especificaciones de Microsoft)</A> son una CPU compatible con
	Pentium (133 MHz o superior), 128 MB de RAM m&iacute;nimo (con 256MB
	como ``m&iacute;nimo recomendado''), y 2 GB de disco duro, con al
	menos 1 GB libre. Seg&uacute;n Red Hat, Red Hat Linux 7.1 (una
	distribuci&oacute;n com&uacute;n de GNU/Linux) requiere al menos un
	i486 (se recomienda un Pentium), 32MB RAM (64MB recomendado), y
	650MB de espacio en disco (1,2 GB recomendados). 
	</P>
	<P>En el art&iacute;culo de Agosto de 2.001 de Scientific American
	<A HREF="http://www.sciam.com/2001/0801issue/0801hargrove.html">The
	Do-It-Yourself Supercomputer</A> se explica como los investigadores
	construyen poderosas plataformas de computaci&oacute;n con un gran
	n&uacute;mero de ordenadores obsoletos ya descartados y GNU/Linux.
	El resultado recibi&oacute; el nombre de ``Stone Soupercomputer''
	(&iquest;Supercomputador de los Picapiedra? N. del T.); en Mayo de
	2.001 conten&iacute;a 133 nodos, con un pico de rendimiento te&oacute;rico
	de 1,2 gigaflops. 
	</P>
	<LI><P><B>Conforme se incrementan el n&uacute;mero de sistemas y de
	rendimiento del hardware, esta diferencia en el coste inicial y de
	actualizaci&oacute;n se vuelve incluso m&aacute;s sustancial.
	</B>Conforme se va incrementando el n&uacute;mero de servidores, las
	soluciones propietarias se van volviendo cada vez mas costosas. En
	primer lugar, muchos sistemas propietarios, incluyendo a Microsoft,
	venden licencias por-cliente; esto hace que si su hardware puede
	soportar m&aacute;s clientes, deba usted pagar m&aacute;s para
	utilizar ese hardware que usted ha comprado. En segundo lugar, puede
	usted desear utilizar m&aacute;s ordenadores, en ese caso deber&aacute;
	usted pagar m&aacute;s licencias en sistemas propietarios. Por
	contraste, para la mayor&iacute;a de las distribuciones de
	GNU/Linux, se pueden instalar tantas copias como se deseen sin pagos
	adicionales, y no hay l&iacute;mite de rendimiento inclu&iacute;do
	en el software. Puede encontrarse un pago adicional por el soporte
	adicional, pero a&uacute;n para este soporte se pueden encontrar
	proveedores compitiendo entre ellos.</P>
	<P>De acuerdo con<!-- "Linux slips slowly into the enterprise realm" by Deni Connor, 3/19/01 -->
	<A HREF="http://www.nwfusion.com/news/2001/0319specialfocus.html">Network
	World Fusion News</A>, Linux se est&aacute; utilizando cada vez m&aacute;s
	en entornos sanitoarios, finanzas, banca y distribuci&oacute;n
	comercial, a causa de las ventajas de coste cuando se va
	incrementando el n&uacute;mero de instalaciones identicas. De
	acuerdo a sus c&aacute;lculos, para un despliegue de 2.000
	ordenadores, SCO UnixWare costar&iacute;a 9 millones de d&oacute;lares,
	Windows costar&iacute;a 8 millones de d&oacute;lares, y Red Hat
	Linux 180 d&oacute;lares.</P>
	<LI><P><B>Hay muchos otros factores, y sus efectos var&iacute;an
	dependiendo de lo que se intente hacer. </B>Hay muchos otros
	factores en el TCO, pero es dificil categorizar sus efectos en
	general, y es generalmente dificil encontrar n&uacute;meros
	justificables para esos otros efectos. Los defensores de Windows
	proclaman que los administradores de sistemas son m&aacute;s baratos
	y m&aacute;s faciles de encontrar que los administradores de
	Unix/Linux, mientras que los defensores de GNU/Linux y Unix
	argumentan que se necesita un n&uacute;mero menor de administradores
	de tales sistemas, porque la administraci&oacute;n es m&aacute;s
	f&aacute;cil de autom&aacute;tizas, y los sistemas son m&aacute;s
	sencillos de arrancarlos. Algunos defensores de GNU/Linux me dicen
	que GNU/Linux les permite instalar m&uacute;ltiples servicios en una
	&uacute;nica m&aacute;quina, mientras que las instalaciones de
	Windows necesitan varias m&aacute;quinas. La administraci&oacute;n
	del cumplimiento de las licencias puede ser costosa en entornos
	propietarios (es decir, el tiempo dedicado a comprar las CAL
	-Licencia de Acceso de Cliente, N. del T-, mantener la pista de las
	licencias, y la auditor&iacute;a subyacente), un coste que en OSS/FS
	es s&iacute;mplemente irrelevante.</P>
	<LI><P><B>Por muchas circunstancias, los ahorros en costes totales
	pueden ser sustanciales; por ejemplo, los ahorros exced&iacute;an
	los 250.000 $ <I>al a&ntilde;o</I> seg&uacute;n informaron el 32 %
	de los CTO,s entrevistados por InfoWorld en 2.001; el 60 % de estos
	CTO ahorraron m&aacute;s de $50.000 anuales. </B>InfoWorld public&oacute;
	un an&aacute;lisis el 27 de Agosto de 2.001 (p&agrave;ginas 49-50)
	sobre 40 CTO,s que formaban parte de la rede de CTO,s miembros de
	InfoWorld. En este estudio, utilizando OSS, un 32 % hab&iacute;an
	ahorrado m&aacute;s de 250.000 $ , otro 12 % entre 100.001 y
	250.000, y un 16 % entre 50.001 y 100.000 $. Adicionalmente s&oacute;lo
	un 8 % indicaron ahorros menores que 10.000 $ (de modo que el 92
	hab&iacute;an ahorrado 10.000 $ o m&aacute;s anualmente).<!-- Other numbers: $25,001 to $50,000: 16%; $10,001 to $25,000: 16% -->
	El principal beneficio de OSS, de acuerdo al 93 % de los CTO,s fue
	la reducci&oacute;n en el coste de desarrollo y adquisici&oacute;n
	de las aplicaciones, un 72 % dijeron que el principal beneficio fu&eacute;
	el tiempo de implementaci&oacute;n o desarrollo (se permit&iacute;an
	m&uacute;ltiples respuestas). Los CTO,s indicaron que utilizaban o
	planeaban utilizar OSS para servidores web (65 %), sistemas
	operativos de servidor (63 %), servidores de aplicaciones web (45
	%), pruebas de desarrollo de aplicaciones (45 %), y sistemas
	operativos de sobremesa (38 %), aparte de otros usos.<!-- 28% said they weren't using or planning to use OSS.  Of course,
     many of these CTOs may not know they're using OSS; OSS often
     ``sneaks'' into organizations without their permission, just like
     PC's did in the early 1980's. -->
	InfoWorld lo resumi&oacute; de esta forma: &quot;a principio del
	2.000, parec&iacute;a que nadie estaba usando software de fuente
	abierta para tareas empresariales cr&iacute;ticas... una gran
	mayor&iacute;a de los ejecutivos de IT de las corporaciones de hoy
	est&aacute;n utilizando o planeas utilizar sistemas operativos o
	servidores web OSS para sus aplicaciones empresariales&quot;.</P>
	<LI><B>Muchas organizaciones han informado de ahorros importantes
	utilizando OSS/FS. </B>Aqu&iacute; tenemos algunos ejemplos de
	organizaciones espec&iacute;ficas que han ahorrado utilizando
	OSS/FS: 
	<UL>
		<LI><P>El documento <A HREF="http://www.robval.com/linux/desktop/index.asp"><I>Linux
		as a Replacement for Windows 2000</I></A> es un ejemplo de un
		an&aacute;lisis comparando RedHat Linux 7.1 y Windows 2000, en el
		caso de este cliente, utilizando Linux en lugar de Windows 2000
		ahorr&oacute; 10.000 $. El revisor ven&iacute;a de un entorno
		Windows/DOS, y tras realizar un estudio intensivo sobre un proyecto
		Linux de varios meses, determin&oacute; que &quot;le sorprender&aacute;
		todo lo que le ofrece el software de fuente abierta&quot;.</P>
		<LI><P>El Vice Presidente de IT de Intel, Doug Busch, <A HREF="http://www.zdnet.com/zdnn/stories/news/0,4586,5098955,00.html">inform&oacute;
		de un ahorro de 200 millones de d&oacute;lares</A> reemplazando
		costosos servidores Unix por mucho m&aacute;s baratos servidores
		corriendo GNU/Linux. 
		</P>
		<LI><P><A HREF="http://news.cnet.com/news/0-1003-200-7720536.html?tag=owv">Amazon.com
		fu&eacute; capaz de recortar 17 millones de d&oacute;ares en gastos
		de tecnolog&iacute;a en un &uacute;nico trimestre</A>,
		principalmente porque cambi&oacute; a Linux. Amaz&oacute;n gast&oacute;
		en tecnolog&iacute;a 54 milloens de d&oacute;lares el el tercer
		cuarto (terminado el 30 de Septiembre), comparado con los 71
		millones de d&oacute;lares el mismo trimestre del a&ntilde;o
		anterior, y los ejecutivos esperaban que el coste de tecnolog&iacute;a
		como porci&oacute;n de las ventas netas decrecer&iacute;a un 20 %
		este a&ntilde;o.</P>
	</UL>
	<P>Hay muchos otros informes de aquellos que han cambiado a sistemas
	OSS/FS, para m&aacute;s informaci&oacute;n, vea <A HREF="#usereports">informes
	de usuarios</A> .<!-- Here is the end of the TCO list: --> 
	</P>
</OL>
<P><!-- http://www.microsoft.com/NTServer/nts/exec/Compares/LowerTCO.asp -->El
estucio del TCO de Microsoft (que mencionamos anteriormente)
probablemente no sea utilizable como punto de partida para estimas su
propio TCO. Su estudio informaba de la ventaja del TCO en sitios con
productos Microsoft, comparado con sitios que utilizaban sistemas
Sun, pero aunque los sistemas con Microsoft costaban un 37 % menos,
los sistemas Solaris manipulaban bases de datos mayores, aplicaciones
que demandaban m&aacute;s recursos se conectaban a esas bases de
datos, ten&iacute;an un 63 % m&aacute;s de conexiones concurrentes, y
un 243 % m&aacute;s de accesos al d&iacute;a. En otras palabras, los
sitemas Microsoft que trabajan menos son menos costosos. Eso no es un
punto de arranque utilizable si se est&aacute; utilizando el TCO como
ayuda para determinar el sistema a adquirir: para hacer esa
comparaci&oacute;n, se necesitar&iacute;a comparar el TCO de sistemas
que est&eacute;n realizando una carga de trabajo similar. Un an&aacute;lisis
en dos partes de Thomas Pfau, (vealos en <A HREF="http://fud-counter.nl.linux.org/tech/TCO.html">parte
1</A> y <A HREF="http://fud-counter.nl.linux.org/tech/TCO2.html">parte
2</A>) identifica esta y muchas otras debilidades en el estudio.</P>
<P>Otra vez, es el TCO total el qeu se debe considerar, y no s&oacute;lo
ciertas categor&iacute;as. Aun m&aacute;s, dadas estas grandes
diferencias, en muchas situaciones el TCO de OSS/FS es menor que el
TCO de sistemas propietarios. Hubo un tiempo en el que de proclamaba
que la instalaci&oacute;n de OSS/FS llevaba m&aacute;s tiempo, pero
hoy d&iacute;a, los sistemas OSS/FS se pueden comprar preinstalados,
y los instaladores autom&aacute;ticos suponen un esfuerzo de
instalaci&oacute;n equivalente. Algunos proclaman el mayor corste de
administraci&oacute;n de los sistemas, pero estudios como el de Sun
sugieren que en muchos casos el coste de administraci&oacute;n es
menor, y no mayor, para los sistemas de tipo Unix, al menos para Sun.
Por ejemplo, en sistemas de tipo Unix suele ser m&aacute;s f&aacute;cil
automatizar tareas, proque se puede, pero no se necesita, utilizar
entornos gr&aacute;ficos, reduciendo de este modo las tareas
manuales, y reduciendo por ello el TCO. La retenci&oacute;n de costes
puede ser significativa, pero ahora que GNU/Linux tienen entornos
graficos modernos, hay evidencias anecd&oacute;ticas de que este
coste es actualmente muy peque&ntilde;o (incluso he visto estudios
muy serios evaluando cuantitativamente este cap&iacute;tulo). En
resumen, es muy dificil demostrar que una soluci&oacute;n propietaria
proporciona ventajas que realmente le ayuden contra su
demostrablemente mayor coste en otras categor&iacute;as, cuando tiene
que competir con productos OSS/FS maduros para una funci&oacute;n
dada.</P>
<P>&iquest;Nos lleva esto a que OSS/FS siemrpe tiene el menor TCO?
&iexcl;No! Como ya hemos anotado repetidamente, esto depende del uso.
Pero la noci&oacute;n de que los OSS/FS <I>siempre</I> tiene un mayor
TCO es simplemente equivocada.</P>
<H1><A NAME="non_quantitative"></A>Acpectos No Cuantitativos</H1>
<P>En justicia, debemos hacer notar que no todos los aspectos se
pueden medir cuantitativamente, y muchos de los m&aacute;s
importantes no lo s&oacute;n. Los aspectos m&aacute;s importantes
incluyen la libertad, la protecci&oacute;n contra los litigios por
licencias, y la fexibilidad. Otro aspecto importante dificil de medir
es la innovaci&oacute;n.</P>
<OL>
	<LI><P><B>El OSS/FS protege a los usuarios de los riesgos y
	desventajas y las soluciones de proveedor &uacute;nico.</B> Aunque
	los defensores de &quot;software libre&quot; usan el t&eacute;rmino
	&quot;libertad&quot;, y algunas empresas ponen el acento en terminos
	diferentes como &quot;diferentes or&iacute;genes&quot;, el concepto
	es el mismo: los usuarios no quieren quedar prisioneros de un &uacute;nico
	vendedor. Las empresas en general prefieren comprar productos para
	los que tengan un gran n&uacute;mero de proveedores, porque esto
	reduce los riesgos: siempre pueden cambiar de proveedor cuando no
	est&aacute;n satisfechos o cuando el poveedor original abandona el
	negocio. Esto se traduce en efectos sobre los productos mismos: si
	los clientes pueden elegir f&aacute;cilmente y cambiar entre
	productos competidores, los precios bajan y la calidad se
	incrementa. Inversamente, cuando se da una situaci&oacute;n pr&oacute;xima
	al monopolio sobre un producto, con el tiempo el proveedor eleva el
	precio y limita sus usos a aquellos que benefician su monopolio.</P>
	<P>Hist&oacute;ricamente, los vendedores propietarios eventualmente
	pierden frente a los que proporcionan productos con m&uacute;ltiples
	fuentes, incluso cuando la t&eacute;cnolog&iacute;a propietaria se
	inicialmente mejor. El formato Betamax de Sony perdi&oacute; frente
	al VHS en el mercado de videocasettes, la arquitectrura de
	microcanal de IBM perdi&oacute; frente a la IS en el mercado de las
	arquitecturas de PC, y NeWS de Sun perdi&oacute; frente a X-window
	en el mercado de los gr&aacute;ficos en red, todos porque los
	clientes prefer&iacute;an reducir los riesgos (y eventualmente
	reducir los costes) con los productos no propietarios. Esto en
	algunos casos se llama &quot;comodificaci&oacute;n&quot;, un t&eacute;rmino
	rechazado por los vendedores propietarios y deseado por los
	usuarios. Una vez que se gastan el dinero, los usuarios quieren
	encontrar alguien que haga lo que ellos quieren.</P>
	<P>Con OSS/FS, los usuarios pueden elegir entre diferentes
	distribuciones, y si un proveedor abandona, pueden cambiar a otro
	vendedor. Como resultado, los proveedores se ven forzados a
	proporcionar productos y servicios de buena calidad por precios
	relativamente bajos, porque los usuarios pueden cambiar si no lo
	hacen. Los usuarios pueden incluso reunirse y mantener el producto
	por ellos mismos (as&iacute; fu&eacute; como naci&oacute; el
	proyecto Apache), haciendo posible que grupos de usuarios se
	protejan ellos mismo del abandono.</P>
	<LI><P><B>El OSS/FS protege a los usuarios de los litigios y la
	gesti&oacute;n de licencias.</B> Los vendedores propietarios ganan
	dinero de la venta de licencias, y est&aacute;n imponiendo
	mecanismos cada vez m&aacute;s complicados para los consumidores
	para manejar estas licencias. Por ejemplo, Microsoft Windows XP
	requiere <A HREF="http://www.licenturion.com/xp/fully-licensed-wpa.txt">product
	activation</A>, un esquema que hace que una acumulaci&oacute;n de
	cambios de hardware requiera un nuevo c&oacute;digo de activaci&oacute;n.
	Los proveedores propietarios tambi&eacute;n litigan contra aquellos
	que no cumplen con sus complicados requerimientos de gesti&oacute;n
	de licencias, incrementando los riesgos legales para los usuarios.
	Por contraste, los usuarios de OSS/FS no tienen miedo de litigios
	por el uso y copia de OSS/S. Los aspectos de licenciamiento vienen
	cuando se modifica y redistribuye el software OSS/FS, pero para ser
	justos, el software propietario esencialmente prohibe esta acci&oacute;n,
	de forma que se convierte en un nuevo derecho. Incluso en estas
	circunstancias, redistribuir software OSS/FS modificado
	generalemente requiere seguir unas pocas reglas sencillas
	(dependiendo de la licencia), tales como mantener los cr&eacute;ditos
	a los desarrolladores originales y liberar las modificaciones bajo
	el mismo esquema de licencia original.</P>
	<LI><P><B>OSS/FS tiene mayor flexibilidad. </B>Los usuarios de
	OSS/FS pueden ajustar el producto tanto como sea necesario para
	conseguir cubrir sus necesidades en formas que no son posibles sin
	el c&oacute;digo fuente. Los usuarios pueden ajustar los productos
	ellos mismo, o encontrar quien pueda resolver el problema
	(incluyendo el desarrollador original del producto). Algunos han
	proclamando que esto crea un &quot;peligro de disgregaci&oacute;n&quot;,
	es decir, m&uacute;ltiples versiones incompatibles de un mismo
	producto. Esto s&oacute;lo es un riesgo para los que creen que la
	competencia es demon&iacute;aca: tambi&eacute;n tenemos m&uacute;ltiples
	versiones de coches. Y en la pr&aacute;ctica, el alto coste de
	mantener el software por uno mismo hace que los cambios de devuelvan
	a la comunidad. Si no se devuelven (por ejemplo, resuelve un
	problema particular que necesitaba resolverse para una situaci&oacute;n
	particular), supone tambi&eacute;n una ganancia para el usuario,
	porque le ha resuelto un problema que de otra forma no se hubiese
	podido resolver.</P>
	<LI><P><B>Hay buenas razones para creer que el OSS/FS potencia, que
	no limita, la innovaci&oacute;n. </B>Microsoft proclama p&uacute;blicamente
	que el OSS/FS, y particularmente su licencia m&aacute;s com&uacute;n,
	la GPL, eliminar&aacute; la innovaci&oacute;n, pero los hechos no
	justifican estas proclamas. La mayor&iacute;a de los gestores de IT
	no las creen. En un estudio de Forrester Research en 2.000, 2.500
	gestores de IT entrevistados indicaron en un 84 % que ellos
	predec&iacute;an que el software de fuente abierta ser&iacute;a
	importante para conseguir innovaciones importantes en la industria.<!-- Source: "Open Source Security: A Look at the Security Benefits of
     Source Code Access" by TruSecure, August 2001, page 4. -->
	Por supuesto, cuando examinamos las <A HREF="http://www.dwheeler.com/innovation">m&aacute;s
	importantes innovaciones en el software</A>, se descubre r&aacute;pidamente
	que Microsoft no ha realizado innovaciones clave, ni ha sido su
	primer implementador. Por contraste, una porci&oacute;n de esas
	innovaciones clave er&aacute;n proyectos OSS/FS. Por ejemplo, <A HREF="http://news.cnet.com/news/0-1014-201-8155733-0.html">Tim
	Berners-Lee, inventor de la World Wide Web, estableci&oacute; en
	Diciembre de 2.001</A> que &quot;un factor muy significativo [en la
	amplia extensi&oacute;n del uso de la Web en la investigaci&oacute;n
	cient&iacute;fica] era que el todo el software era (lo que ahora
	llamar&iacute;amos) de fuente abierta. Se extendi&oacute; r&aacute;pido,
	y se potenci&oacute; r&aacute;pido, y pudo instalarse en
	instalaciones gubernamentales y de la gran industria sin tener que
	atravesar grandes procesos de adquisici&oacute;n&quot;. N&oacute;tese
	que esto no termin&oacute; una vez que las ideas originales se
	desarrollaron: el primer servidor web del a&ntilde;o 2.001 (Apache)
	es de fuente abierta, y el segundo navegador web en 2.001 (Netscape
	Navigator) es casi enteramente de fuente abierta, diez a&ntilde;os
	despues del desarrollo original de la web. Adicionalmente, los casos
	judiciales recientes han mostrado fuertes evidencias de que la &uacute;nica
	raz&oacute;n por la que el propietario Internet Explorer es el
	primer navegador web est&aacute; en los a&ntilde;os de uso ilegal
	del poder monopol&iacute;stico de Microsoft.</P>
	<P>Esta historia de la innovaci&oacute;n no deber&iacute;a ser
	sorprendente: el OSS/FS se aproxima al m&eacute;todo cient&iacute;fico,
	permitiendo a cualquiera hacer aportaciones o a&ntilde;adir t&eacute;cnicas
	innovadoras, y ponerlas inmediatamente a disposici&oacute;n del
	p&uacute;blico. <A HREF="http://linuxtoday.com/stories/8242.html">Eric
	Raymond ha mostrado porqu&eacute; la innovaci&oacute;n est&aacute;
	m&aacute;s pr&oacute;xima, que no menos, a los proyectos OSS/FS</A>.
	El sitio web <A HREF="http://sweetcode.org/">Sweetcode</A> informa
	de software libre innovador. Aqu&iacute; tenemos lo que Sweetcode
	dice de su sitio: &quot;La innovaci&oacute;n que muestra el software
	que aqu&iacute; informamos no es s&oacute;lo un clon de algo, ni un
	a&ntilde;adido menos a algo, ni una traslaci&oacute;n de algo, ni
	incluso una nueva implementaci&oacute;n de conceptos ya ampliamente
	conocidos... el software recogido en sweetcode deber&iacute;a
	sorprenderle de alguna forma interesante&quot;.</P>
	<P>Si la aproximaci&oacute;n propietaria de Microsoft fuera mejor
	para los investigadores, deber&iacute;amos esperar que estuviese
	documentado en la comunidad investigadora. Sin embarlo, lo cierto es
	lo contrario: el documento <A HREF="http://www.dyncorp-is.com/darpa/meetings/win98aug/wars.html">``NT
	Religious Wars: Why Are DARPA Researchers Afraid of Windows NT?''</A>
	muestra que, a pesar de la fuerte presi&oacute;n de los clientes de
	pago, los investigadores de ciencia de la computaci&oacute;n se
	resistieron d&uacute;ramente a basar su investigaci&oacute;n en
	Microsoft. Las razones dadas eran: los desarrolladores creen que
	Windows es terrible, Windows realmente es terrible, las altamente
	restrictivas disposiciones de no publicaci&oacute;n de Microsoft que
	bloquean las agendas de los investigadores, y no est&aacute; clara
	la forma en que se producir&iacute;a la transici&oacute;n de la
	tecnolog&iacute;apara los sistemas operativos y los productos de
	investigaci&oacute;n de redes construidos en Microsoft (una vez que
	s&oacute;lo Microsoft puede distribuir cambios en sus productos). La
	propia investigaci&oacute;n secreta de Microsoft (m&aacute;s tarde
	llamada <A HREF="http://www.opensource.org/halloween/halloween1.html">``Halloween
	I''</A>) encontraba que &quot;los proyectos de
	investigaci&oacute;n/aprendizaje sobre Linux se 'diseminan' m&aacute;s
	f&aacute;cilmente debido a la amplia disponibilidad del c&oacute;digo
	fuente de Linux. En particular, esto incluso permite que las nuevas
	ideas de investigaci&oacute;n se implementen primero y est&eacute;n
	disponibles &aacute;ntes en Linux de lo que lo est&aacute;n / se
	incorporan a otras plataformas''.<!-- Microsoft research also believed that
OSS had weaknesses for innovation:
(1) ``future innovations which require changes to the
core architecture / integration model are going
to be incredibly hard for the OSS team to aborb
because it simultaneously devalues their precedents and skillsets''
http://www.opensource.org/halloween/halloween1.html#comment15

(2) They also claim that OSS is structured more from 20:20 hindsight
than strong, visionary leadership
http://www.opensource.org/halloween/halloween1.html#comment6

Both these claims are nonsense; see Raymond's counter to such claims.
There are many OSS/FS projects that approach problems in truly new ways, and
OSS/FS also has its visionaries (who are hailed as such).
 -->
	El profesor de la Stanford Law School Lawrence Lessig (el &quot;experto
	especial&quot; en el juicio antitrust contra Microsoft) anot&oacute;
	que <A HREF="http://news.cnet.com/news/0-1014-201-7921483-0.html">``Microsoft
	estaba utilizando su poder para protegerse a s&iacute; misma de las
	nuevas innovaciones''</A> y que Microsoft generalmente practica un
	freno a la innovaci&oacute;n, no la promueve.</P>
	<P>Dado un sitio entero dedicado a enlazar proyectos OSS/FS
	innovadores, la historia demostrada de OSS/FS en innovaciones clave,
	los informes de los gestores de IT dando soporte al OSS/FS, los
	informes de la insatisfacci&oacute;n de los investigadores y de
	otros sobre las aprosimaciones propietarias de Microsoft, y la
	propia invenstigaci&oacute;n interna de Microsoft mostrando que las
	nuevas ideas de investigaci&oacute;n son habitualmente implementadas
	y est&aacute;n disponibles primero en Linux antes que en otras
	plataformas, las proclamas de que OSS/FS bloquea la innovaci&oacute;n
	es demostrablemente falsa.</P>
</OL>
<P>Aunque no se pueden medir cuantitativamente estos aspectos, los
mismos (particularmente los tres primeros) son actualmente los
aspectos m&aacute;s importantes para muchos.</P>
<H1><A NAME="fears"></A>Miedos Innecesarios</H1>
<P>Algunos rechazan el OSS/FS, no a causa de los aspectos anotados
anteriormente, sino a causa de miedos innecesarios al OSS/FS.
Realicemos un recuento de algunos de ellos:</P>
<OL>
	<LI><P><B>&iquest;Tiene fundamentalmente mejor soporte el software
	propietario que el software OSS/FS? No. </B>Actualmente hay dos
	mecanismos de sorporte del OSS/FS: el tradicional soporte a cabmio
	de un pago, y el soporte de la comunidad informal. Hay muchas
	organizaciones que proporcionan soporte tradicional por un pago.
	Puesta es estas pueden competir, una opci&oacute;n que no est&aacute;
	disponible para el software propietario, se puede obtener un
	excelente precio por ese soporte. Por ejemplo, muchas distribuciones
	de GNU/Linux incluyen soporte a la instalaci&oacute;n cuando se
	compra su distribuci&oacute;n, y a cambio de un pago adicional
	proporcionan niveles adicionales de soporte. Como alternativa, se
	puede conseguir soporte gratuito de la comunidad general de usuarios
	y desarrolladores, a trav&eacute;s de grupos de noticias, listas de
	correo, sitios web y otros foros electr&oacute;nicos. Aunque este
	tipo de soporte no es tradicional, son muchos los que han estado
	satisfechos con &eacute;l. Por ejemplo, en el premio al &quot;Mejor
	Soporte T&eacute;cnico&quot; de 1.997 de InfoWorld, el premiado fu&eacute;
	la &quot;Comunidad de Usuarios de Linux&quot;, batiendo a todos los
	soportes t&eacute;cnicos de todos los vendedores de software
	propietario. Muchos creen que esto es un efecto lateral de la
	penetraci&oacute;n de Internet: cada vez m&aacute;s usuarios y
	desarrolladores est&aacute;n comunicados directamente entre ellos,
	mostrandose que esta aproximaci&oacute;n es m&aacute;s efectiva que
	las alternativas (para saber m&aacute;s sobre esta filosof&iacute;a
	de negocio, lea <A HREF="http://www.cluetrain.com/">The Cluetrain
	Manifesto</A>). Utilizar esta aproximaci&oacute;n no tradicional,
	efectivamente para el soporte requiere seguir ciertas reglas. Para
	saber m&aacute;s sobre estas reglas, consulte <A HREF="http://www.tuxedo.org/~esr/faqs/smart-questions.html">``Como
	realizar preguntas acertadas''</A>. Pero tengase en cuenta que hay
	una alternativa: utilizar OSS/FS no requiere utilizar el soporte no
	tradicional (y seguir sus reglas), de modo que quienes quieran
	soporte tradicional garantizado pueden pagar por &eacute;l justo
	como har&iacute;an por software propietario.</P>
	<LI><P><B>&iquest;Le da el software propietario ma derechos legales
	que el software propietario? No. </B>Algunos han comentado que &quot;con
	el OSS/FS se cede el derecho a demandar si las cosas van mal&quot;.
	La respuesta obvia es qeu esencialmente todas las licencias de
	software propietario <I>tambi&eacute;n</I> prohiben las
	reclamaciones legales, luego no hay diferencia entre ellos.
	Cualquiera que piense que puede demandar a Microsoft o a otros
	vendedores de software propietario cuando las cosas van mal est&aacute;
	simplemente enga&ntilde;andose a s&iacute; mismo. En cualquier caso,
	la mayor&iacute;a de los usuarios no est&aacute;n interesados en
	demandar a los vendedores, lo que quieren es sistemas que trabajen.
	Vea <A HREF="http://www.linuxjournal.com/article.php?sid=5073">``A
	Abogado Senior de Microsoft Mira en las Licencias de Fuente
	Abierta''</A>, donde Bryan Pfaffenberger arguye que &quot;con el
	software de fuente abierta... se est&aacute;, en principio,
	caminando en el l&iacute;mete con los ojos bien abiertos. Conoce lo
	que est&aacute; tomando y lo que no, y puede encontrar alguien que
	lo haga. Las licencias de fuente abierta capacitan a la comunidad de
	usuarios a inspeccionar el c&oacute;digo buscando debilidades y
	tomar conocimiento de tales debilidades, algo que seguramente hacen.
	Tales licencias permiten a los usuarios crear versiones derivadas
	del c&oacute;digo que potencialmente reparen problemas aleatorios
	que no vi&oacute; el autor. Permite a los usuarios determinar cuadno
	el programa contiene salvaguardas adeucadas pra la seguridad y sus
	riesgos. Por contraste, las poderosas firmas de software que forman
	la UCITA nos piden que compremos c&oacute;digo de fuente cerrada que
	puede contener errores o incluso fallos aleatorios atribu&iacute;bles
	a negligencia de la corporaci&oacute;n, pero no quieren permitirnos
	ver el c&oacute;digo, ni mucho menos modificarlo. No sabemos con
	ellos lo que estamos adquiriendo&quot;. Finalmente, si el software
	funciona de modo equivocado y es muy importante, lo puede corregir
	usted mismo o pagar a alguien que lo haga. Esta opci&oacute;n reduce
	enormemente el riesgo, y esta opci&oacute;n no existe con el
	software propietario.</P>
	<LI><P><B>Le expone el OSS/FS a un gran riesgo de abandono? No.</B>
	Las empresas abandonan los negocios, y los individuos pierden el
	interes en los productos, tanto en el software propietario como en
	el mundo OSS/FS. La mayor diferencia, sin embargo, es que todos los
	programas OSS/FS entran autom&aacute;ticamente en relevos: esto es,
	si su desarrollador original deja de soportar el producto, cualquier
	persona o grupo de personas puede seguir adelante y soportarlo en su
	lugar. Esto se ha demostrado repetidamente en el OSS/FS. Por
	ejemplo, el <A HREF="http://www.gimp.org/~sjburges/gimp-history.html">GIMP
	es un editor gr&aacute;fico que fu&eacute; abandonado por sus
	desarrolladores originales</A> (esto es falso: ellos abandonaron
	antes de su liberaci&oacute;n inicial, y fallaron al buscar alguien
	que les sucediera). Incluso en este caso extremo, tras un periodo de
	tiempo otros usuarios pueden volver de nuevo y continuar su
	desarollo. Como en otro ejemplo, <A HREF="http://apache.rcbowen.com/ApacheServer.html#Introduction_What_is_Apache">NCSA
	abandon&oacute; su servidor web &quot;httpd&quot;, de modo que
	algunos de sus usuarios se juntaron para mantenerlo, y el resultado
	devino en Apache, el m&aacute;s popular de los servidores web.</A></P>
	<LI><P><B>&iquest;El OSS/FS es econ&oacute;micamente viable? Si. </B>Hay
	compa&ntilde;&iacute;as que est&aacute;n haciendo dinero con el
	OSS/FS, y adem&aacute;s, mirando s&oacute;lo a s&iacute; mismos,
	miran s&oacute;lo en el lado del suministro, no en el lado de la
	demanda. Los consumidores ahorran enormes cantidades de dinero y
	obtienen muchos m&aacute;s beneficios de usar OSS/FS, de modo que
	hay una fuerte base econ&oacute;mica para el &eacute;xito. Nadie que
	est&eacute; ahorrando dinero querr&aacute; dejar de ahorrarlo, y de
	esta forma es m&aacute;s barato para los clientes trabajar juntos
	para pagar peque&ntilde;as potenciaciones de un producto OSS/FS que
	continuar pagando y repagando un producto propietario. Para muchos,
	el dinero sigue estando involucrado, pero es dinero ahorrado, no
	directamente adquirido como beneficio. Algunos vendedores de OSS/FS
	han ido mal econ&oacute;micamente, pero muchos vendedores de
	software propietario tambi&eacute;n. Afortunadamente para los
	clientes, los productos OSS/FS no dependen de la situaci&oacute;n
	financiera de un vendedor particular como le ocurre a muchos
	productos propietarios.</P>
	<P>Fundamentalmente, el software es econ&oacute;micamente diferente
	de los bienes f&iacute;sicos: es infin&iacute;tamente replicable,
	esencialmente no cuesta nada reproducirlo, y puede ser desarrollado
	por miles de programadores trabajando juntos con una peque&ntilde;a
	inversi&oacute;n (llevando los costes de desarrollo por persona a
	cantidades muy peque&ntilde;as). De esta forma, el coste marginal de
	desplegar una copia de un paquete de software se aproxima a cero.
	Esto explica como Microsoft se ha hecho tan rico tan r&aacute;pidamente,
	y porque muchos desarrolladores de OSS/FS pueden continuar
	proporcionando software todav&iacute;a. Vea<!-- Was at: http://www.freeos.com/articles/4087 -->
	<A HREF="http://www.mech.kuleuven.ac.be/~bruyninc/linux/economy-oss.html">``Open
	Source-onomics: Examinando algunos argumentos pseudo-econ&oacute;micos
	sobre el C&oacute;digo de Fuente Abierta''</A> de Ganesh Prasad, que
	cuenta &quot;varios mitos alrededor de la econom&iacute;a del C&oacute;digo
	de Fuente Abierta''.</P>
	<LI><P><B>&iquest;Quiere el OSS/FS destruir a la industria o a los
	desarrolladores de software? No.</B> ciertamente es posible que
	muchos productos OSS/FS eliminen a sus competidores propietarios,
	pero esa es la naturaleza de la competencia. Nadie lamenta la
	perdida de estupendos fabricantes de carretas, que fueron expulsados
	del mercado por una mejor aproximaci&oacute;n al transporte: los
	coches. Si a aproximaci&oacute;n del OSS/FS supone un reto a las
	aproximaciones del software  propietario, los vendedores de software
	propietario deber&aacute;n elegir entre encontrar v&iacute;as para
	competir o unirse al movimentos de OSS/FS. Hasta donde llegan los
	desarrolladores, el OSS/FS no necesita que los desarrolladores
	trabajen gratis. Muchos productos OSS/FS est&aacute;n siendo
	desarrollados por empleados (cuyo trabajo consiste en hacerlo) y/o
	por contratos de trabajo (se contrata a alguien para hacer mejoras
	espec&iacute;ficas en productos OSS/FS). A&uacute;n m&aacute;s se ha
	producido recientemente un cambio en el OSS/FS desde el trabajo de
	programadores voluntarios hacia el desarrollo por programadores
	experimentados. De nuevo, vea el art&iacute;culo de <A HREF="http://www.freeos.com/articles/4087">Ganesh
	Prasad</A> para conseguir mas informaci&oacute;n.</P>
	<LI><P><B>&iquest;Es el OSS/FS compatible con el Capitalismo? Yes.</B>
	A&ntilde;os atr&aacute;s, alguien intent&oacute; etiquetar el OSS/FS
	de &quot;comunista&quot; o &quot;socialista&quot; (es decir,
	anticapitalista), pero esa ret&oacute;rica ha fallado. Un art&iacute;culo
	que explica proqu&eacute; el capitalismo y el OSS/FS son compatibles
	lo encontramos en  <A HREF="http://www.osopinion.com/perl/story/?id=9748"><I>How
	Does the Capitalist View Open Source?</I></A>. Este documento
	muestra que el OSS/FS es muy consistente con el capitalismo:
	incrementa la riqueza sin violar los principios de propiedad o libre
	empresa. 
	</P>
	<LI><P><B>&iquest;Y no es un &quot;destructor de la propiedad
	intelectual''? No.</B> Puede usted utilizar productos OSS/FS, como
	por ejemplo un procesador de textos, para desarrollar informaci&oacute;n
	propietaria y privada, y puede mantener esa informaci&oacute;n tan
	propietaria y privada como desee. Lo que no puede hacer es utilizar
	el material de otro de alguna forma prohibida por la ley, y esto es
	cierto para todo el software, no s&oacute;lo para el OSS/FS. Un caso
	interesante el la &quot;General Public License&quot; (GPL), la m&aacute;s
	com&uacute;n licencia OSS/FS. El software cubierto por la GPL se
	puede modificar, pero cualquier liberaci&oacute;n de ese software
	modificado debe incluir la oferta del c&oacute;digo fuente bajo la
	misma licencia GPL.</P>
	<P>Microsoft dice que la GPL no le permite tomar ese c&oacute;digo,
	realizarle modificaciones y mantener el c&oacute;digo modificado
	propietario, pero eso es p&uacute;ramente hip&oacute;crita.
	Microsoft no permite a otros hacer y distribuir cambios al software
	de Microsoft en absoluto, de forma que la GPL le permite m&aacute;s
	derechos a los clientes de los que permite Microsoft. Es cierto que
	las organizaciones que modifican software sometido a la GPL deben
	entregar cualqueir patente y copyright para aqeullas adiciones que
	liberen, pero tales organizaciones lo hacen voluntariamente (nadie
	les <I>fuerza</I> a modificar c&oacute;digo GPL) y con completo
	conocimiento (todo el software GPL viene con una licencia que
	establece esto cl&aacute;ramente). Y tales autorizaciones s&oacute;lo
	se aplican a sus modificaciones particulares; las organizaciones
	pueden conservar otros derechos que no est&eacute;n relacionados si
	as&iacute; lo desean. Una vez que las organizaciones no pueden hacer
	modificaciones al software propietario en casi ning&uacute;n caso,
	las organizaciones adquieren m&aacute;s derechos con la licencia GPL
	que con las licencias propietarias. Y aunqeu la GPL haya sido
	llamada algunas veces un &quot;virus&quot; por la forma en que
	empuja a otro usar tambi&eacute;n la licencia GPL, s&oacute;lo es
	cierto hasta notar que muchos productos propietarios (aquellos con
	&quot;efecto red&quot;) tambi&eacute;n lo hacen. Una vez que algunos
	usuarios empiezan a utilizar un producto como un sistema operativo o
	un procesador de textos propietario, se vuelve cada vez m&aacute;s
	dificil para otros usuarios utilizar un producto diferente. Con el
	tiempo, el empleo de un producto propietario particular tambi&eacute;n
	se extiende &quot;como un virus&quot;. La GPL no &quot;destruye&quot;
	la propiedad intelectual. En su lugar, crea un nuevo campo de juego,
	en el que la gente puede contribuir con mejoras al producto
	voluntariamente sin que le sean &quot;robados&quot; por otros.</P>
</OL>
<H1><A NAME="other"></A>Otra Informaci&oacute;n</H1>
<P>Aqu&iacute; tenemos otras fuentes de informaci&oacute;n
relacionadas:</P>
<OL>
	<LI>Hay muchos informes de usuarios que han cambiado a software
	OSS/FS que podemos considerar utilizables. Mandrakesoft mantiene un
	sitio que  <A HREF="http://www.mandrakebizcases.com/">registra las
	experiencias usuarios empresariales de la distribuci&oacute;n
	Mandrake</A>. <A HREF="http://www.redhat.com/solutions/migration/#tools">Red
	Hat proporciona alguna informaci&oacute;n similar</A>.
	Opensource.org incluye algunos <A HREF="http://www.opensource.org/advocacy/case_studies.html">casos
	de estudio </A>. Obviamente, las variadas transformaciones de gran
	escala que han ocurrido sugieren que OSS/FS realmente es viable para
	el despliegue en la empresa. Muchas cajas registradoras de
	distribuidores comerciales est&aacute;n cambiando a GNU/Linux, de
	acuerdo con  <A HREF="http://www.techweb.com/se/directlink.cgi?IWK20001204S0069">Information
	Week</A>; por ejemplo, Home Depot planea montar 90.000 terminales
	corriendo Linux en 2.003.<!-- December 4, 2000, Issue 815,
 "Cash Registers are Ringing up Sales with Linux" by Dan Orzech -->
	Hay muchos otros informes de usuarios, tales como el documento <A HREF="http://www.robval.com/linux/desktop/index.asp"><I>Linux
	como un Recambio para Windows 2000</I></A> y los resultados de 
	<A HREF="http://news.cnet.com/news/0-1003-200-7720536.html?tag=owv">Amazon.com.</A>
	<A HREF="http://www.newsalert.com/bin/story?StoryId=Co_Ir0c4bmdaWmtK">The
	U.S. Joint Strike Fighter (JSF) est&aacute; utilizando tambi&eacute;n
	GNU/Linux.</A> <A HREF="http://techupdate.zdnet.com/techupdate/stories/main/0,14179,2825019,00.html">Un
	proveedor de servicios de aplicaciones de viajes</A> ahorr&oacute;
	$170,000 en costes de software durante los primeros seis meses de
	uso de GNU/Linux (tanto en servidores como en ordenadores de
	sobremesa); tambi&eacute;n ahorr&oacute; en hardware, e inform&oacute;
	que la administraci&oacute;n es m&aacute;s barata tambi&eacute;n.
	<A HREF="http://www.crn.com/Sections/CoverStory/CoverStory.asp?ArticleID=31793">CRN's
	Test Center</A> encontr&oacute; que una red basada en GNU/Linux (con
	un servidor y 5 estaciones de trabajo) cuesta un 93 % menos en
	software que una red basada en Windows, y encontr&oacute; tambi&eacute;n
	que es una red muy capaz. <A HREF="http://desktoplinux.com/articles/AT9664091996.html">Adam
	Wiggins informo sobre la exitosa transici&oacute;n a escritorios
	Linux en TrustCommerce.</A> 
	<LI><P>Microsoft a estado intentando proclamar que el c&oacute;digo
	de fuente abierta es de alguna forma peligroso, y en liderar su
	cr&iacute;tica, Lee Gomes, del Wall Street Journal encontr&oacute;
	que &quot;Microsoft Utiliza Codigo de Fuente Abierta pesar del negar
	el uso de tal software&quot;. Aqu&iacute; tenemos algunos fragmentos
	interesantes del art&iacute;culo:</P>
	<BLOCKQUOTE><P>...Pero las instrucciones de Microsoft el viernes
	vienen a sugerir que la compa&ntilde;ia est&aacute; ella misma
	tomando ventaja esta tecnolog&iacute;a de la que puede desencadenar
	terribles consecuencias a los dem&aacute;s. &quot;Estoy horrorizado
	de la forma en que rechaza el c&oacute;digo de fuente abierta conuna
	mano, mientras depende de &eacute;l para su negocio con la otra&quot;,
	dijo Marshall Kirk McKusick, un lider del equipo de desarrollo de
	FreeBSD.</P></BLOCKQUOTE>
	<P>M&aacute;s recientemente, Microsoft ha centrado sus iras en la
	licencia GPL, pero &quot;no ha sugerido previamente que ahy formas
	benignas de OSS, y mientras despotrica contra Linux de forma
	particularmente cr&iacute;tica, ha tendido a criticar todo el
	movimimiento de fuente abierta con el mismo brochazo&quot;. El
	art&iacute;culo termina con esta sentencia:</P>
	<P>En su campa&ntilde;a contra el OSS, Microsoft ha sido incapaz de
	proporcioanr ejemplos de compa&ntilde;&iacute;as que est&eacute;n
	siendo da&ntilde;adas por &eacute;l. Una raz&oacute;n, dijo Eric von
	Hippel, un profesor del Massachusetts Institute of Technology que
	est&aacute; realizando un esfuerzo de investigaci&oacute;n en este
	campo, es qeu virtualmente todas las evidencias disponibles sugieren
	que el OSS es una &quot;importante ventaja&quot; para las compa&ntilde;ias.
	&quot;Son capaces de construir un estandar com&uacute;n que no es
	propiedad de nadie&quot;, dijo. &quot;Con Windows, Microsoft se lo
	apropia&quot;.</P>
	<LI>Hay varios sitios de informaci&oacute;n general sobre OSS/FS o
	Unix que pueden ser de interes, tales como la  <A HREF="http://www.fsf.org/">Free
	Software Foundation (FSF)</A>, el sitio web de la  <A HREF="http://www.opensource.org/">Open
	Source Initiative</A>, el sitio de  <A HREF="http://www.linux.org/info/advocacy.html">Linux.org</A>,
	y el sitio <A HREF="http://www.unix-vs-nt.org/">Unix versus NT</A>.
	El documento  <A HREF="http://www.yoderdev.com/oss-future.html">El
	futuro del OSS/FS: Es s&oacute;lo cuesti&oacute;n de tiempo</A>
	arguye que dentro de pocos a&ntilde;os, el sistema operativo de
	facto que casi todo el mundo utilizar&aacute;, as&iacute; como mucho
	del software de comodidad de uso generalizado, ser&aacute; OSS/FS.
	El libro  <A HREF="http://www.tuxedo.org/~esr/writings/cathedral-bazaar"><I>The
	Cathedral and the Bazaar</I></A> de Eric Raymon esamina los
	conceptos y procesos de desarrollo del OSS/FS. Una colecci&oacute;n
	utilizable de muchos escritos OSS/FS, incluyendo el ensayo <I>La
	Catedral y el Bazar</I> se puede encontrar en <A HREF="http://www.csaszar.org/interesting.htm">Open
	Source Reader (que tiene una versi&oacute;n en espa&ntilde;ol, N.del
	T.)</A><LI>
	Microsoft defendi&oacute; el OSS/FS inadvertidamente en sus
	documentos internos, llamados los documentos de <A HREF="http://www.opensource.org/halloween">&quot;Halloween&quot;</A>.
	
	<LI><A HREF="http://www.ccic.gov/ac/pitac_ltr_sep11.html"><I>Recomendaciones
	del Panel sobre Software de Fuente Abierta para Alta Computaci&oacute;n</I></A>;
	es el informe de un panel creado por el Comit&eacute; para la
	Defensa de la Tecnolog&iacute;a de la Informaci&oacute;n del
	Presidente (PITAC, USA), Recomienda que &quot;los gobiernos
	federales deber&iacute;an potenciar el desarrollo de software de
	fuente abierta como una ruta alternativa para el desarrollo de
	computaci&oacute;n de alto nivel&quot;.<LI>
	Se han escrito muchos documentos para recoger las instrucciones de
	Microsoft, tales como  &quot;<A HREF="http://www.microsoft.com/ntserver/nts/news/msnw/LinuxMyths.asp">Linux
	Myths</A>&quot;. Esto incluye la respuesta de  <A HREF="http://lwn.net/1999/features/MSResponse.phtml">LWN</A>
	y la de <A HREF="http://dolinux.dyn.dhs.org/dolinux/docs/response.html">Jamin
	Philip Gray</A>, y el sitio de <A HREF="http://fud-counter.nl.linux.org/">recuento
	de FUD</A>. La p&aacute;gina <A HREF="http://www.shared-source.com/">shared
	source</A> propone que la idea de &quot;c&oacute;digo compartido&quot;
	de Microsoft es inferior al OSS. El libro de <A HREF="http://www.gnu.org/philosophy/gpl-american-way.html">Richard
	Stallman <I>The GNU GPL and the American Way</I></A> recuenta las
	proclamas lanzadas por Microsoft indicando que la GPL es
	&quot;anti-Americana&quot;. La carta  <A HREF="http://perens.com/Articles/StandTogether.html">Free
	Software Leaders Stand Together</A> responde a algunas aseveraciones
	de Craig Mundie. Se pueden encontrar muchos sitios generales sobre
	Microsoft, incluyendo el sitio de  <A HREF="http://www.geocities.com/cloweth">Cloweth</A>.
	
	<LI><A HREF="http://www.salon.com/tech/fsp/2000/09/12/chapter_7_part_one/index.html">``Como
	Big Blue Pelea por Linux''</A> es un art&iacute;culo sobre c&oacute;mo
	una IBM modificada se est&aacute; volviendo un hacker fundamental.
	Ahora IBM planea invertir 1.000 millones de d&oacute;lares
	enGNU/Linux, y s&oacute;lo es una compa&ntilde;ia. Vea el  <A HREF="http://www.ibm.com/annualreport/2000/flat/toc/2_3_1_intro.html">IBM
	annual report</A>. 
	<LI>Para tener una vista cient&iacute;ficamente impresentable, pero
	realmente divertida de lo que dice la gente que utiliza los
	diferentes sistemas operativos, dele una mirada a <A HREF="http://srom.zgp.org/">Operating
	System Sucks-Rules-O-Meter</A>. Cuenta como muchs p&aacute;ginas web
	incluyen instrucciones como &quot;Linux rocks&quot;. Es realmente
	s&oacute;lo un conjunto de opiniones, pero si no es nada m&aacute;s,
	al menos le producir&aacute; una buena carcajada.<!-- was http://www.operatingsystems.net --><!-- <li
A general-purpose site that tries to compare all operating systems
(with a bent towards Apple's MacOS) is
<a href="http://www.osdata.com"http://www.osdata.com</a;
it has a lot of interesting information, though it tends towards testimonials
and such instead of quantitative information.

More personal surveys specifically Linux-related is
available from survey.com's
Open Source Unix (OSU) Linux Report, February 2000.
The whole report is expensive; a summary is at
http://www.survey.com/bidw/description_linux.html
 -->
	
	<LI>Varios estudios examinan a los desarrolladores (es decir, a
	quienes escriben los programas), incluyendo <A HREF="http://www.ibiblio.org/osrt/develpro.html">``Un
	Perfil Cuantitativo de una Comunidad de Desarrolladores de Fuente
	Abierta de Linux&quot;</A>, <A HREF="http://www.psychologie.uni-kiel.de/linux-study">Estudio
	de Herman, Hertel y Niedner  (basado en cuestionarios)</A>, y el
	estudio  <A HREF="http://widi.berlios.de/stats.php3">Who Is Doing It
	(WIDI)</A> (Quien lo est&aacute; haciendo). 
	<LI>Otras evaluaciones incluyen las evaluaciones del <A HREF="http://www.gartnerweb.com/public/static/hotc/hc00091281.html">Gartner
	Group</A> y de  <A HREF="http://gnet.dhs.org/stories/bloor.php3">Gnet.</A><LI><P>
	Para conseguir m&aacute;s informaci&oacute;n general sobre OSS/FS,
	vea mi <A HREF="oss_fs_refs.html">lista de referencias sobre Open
	Source Software / Free Software (OSS/FS) en
	http://www.dwheeler.com/oss_fs_refs.html</A> 
	</P>
</OL>
<H1><A NAME="conclusions"></A>Conclusiones</H1>
<P>OSS/FS tiene una significativa <A HREF="#market_share">cuota de
mercado</A>, es quiz&aacute; el <A HREF="#reliability">software m&aacute;s
fiable</A>, y en muchos casos, tiene el mejor <A HREF="#performance">rendimiento</A>.
OSS/FS <A HREF="#scaleability">escala</A>, tanto en tama&ntilde;o del
problema como en tama&ntilde;o del proyecto. El OSS/FS generalmente
tiene mejor <A HREF="#security">seguridad</A>, particularmente cuando
se le compara con Windows. <A HREF="#tco">El coste total de propiedad</A>
para el OSS/FS es normalmente menor que para el software propietario,
particularmente conforme crece el n&uacute;mero de plataformas. Estas
aseveraciones no son meramente opiniones. Estos efectos se pueden
demostrar <I>cuantitativamente</I>, utilizando una &aacute;mplia
variedad de medidas. Esto incluso no considera <A HREF="#non_quantitative">otros
aspectos dificiles de medir,</A> como la libertad frente al control
por una &uacute;nica fuente, la libertad frente a la gesti&oacute;n
de licencias (con su acompa&ntilde;ante litigaci&oacute;n) y la
creciente flexibilidad. Creo que las opciones OSS/FS deber&iacute;an
ser cuidadosamente consideradas en cualquier momento en el que se
necesite software o hardware para ordenadores.</P>
<HR>
<TABLE CELLPADDING=2 CELLSPACING=2>
	<TR>
		<TD>
			<P>&nbsp; 
		</TD>
		<TD>
			<P ALIGN=CENTER><B>Sobre el  Autor</B></P>
			<P><BR>David A. Wheeler es un experto en seguridad inform&aacute;tica
			y tiene una larga historia trabajando con sistemas de software
			grandes y de alto riesgo. Sus libros incluyen <EM><A HREF="http://www.computer.org/cspress/catalog/bp07340.htm">Software
			Inspection: An Industry Best Practice</A></EM> (publicado por IEEE
			CS Press), <I>Ada 95: The Lovelace Tutorial</I> (publicado por
			Springer-Verlag), y el  <A HREF="http://www.dwheeler.com/secure-programs"><I>Secure
			Programming for Linux and Unix HOWTO</I></A>. Los art&iacute;culos
			que ha escrito incluyen <A HREF="http://www.dwheeler.com/sloc"><I>More
			than a Gigabuck: Estimating GNU/Linux's Size</I></A> y <A HREF="http://www.dwheeler.com/innovation"><I>The
			Most Important Software Innovations.</I></A> La direcci&oacute;n
			web de Mr. Wheeler es <A HREF="http://www.dwheeler.com/">http://www.dwheeler.com</A>.
			Puede ver la versi&oacute;n inglesa actualizada de su art&iacute;culo
			en <A HREF="http://www.dwheeler.com/oss_fs_why.html">http://www.dwheeler.com/oss_fs_why.html</A>.
			
		</TD>
		<TD>
			<P><IMG SRC="frozen/dwheel1.png" NAME="Imagen3" ALT="Picture of David A. Wheeler" ALIGN=BOTTOM WIDTH=150 HEIGHT=225 BORDER=0>
			
		</TD>
	</TR>
</TABLE>
<P><!-- <p
<font size="2"
PDA users can get
http://pilot.screwdriver.net/convert.prc?url=http%3A%2F%2Fwww.dwheeler.com&title=Why+OSS%2FFS%3F+Look+at+the+Numbers%21
<a href="http://pilot.screwdriver.net/convert.prc?url=http%3A%2F%2Fwww.dwheeler.com"a version of this document in (Aportis) DOC format</a;
PalmOS users can use open source DOC readers such as
<a href="http://www.32768.com/bill/palmos/cspotrun"CSpotRun</a or
<a href="http://sourceforge.net/projects/zurk"ZDoc</a to read it.
</font
 --><BR><BR>
</P>
</BODY>
</HTML>