<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
	<TITLE>M&eacute;todo para Actualizar la Versi&oacute;n de Documentaci&oacute;n</TITLE>
	<META NAME="GENERATOR" CONTENT="StarOffice/5.1 (Linux)">
	<META NAME="CREATED" CONTENT="20010928;1064600">
	<META NAME="CHANGEDBY" CONTENT=" ">
	<META NAME="CHANGED" CONTENT="20010928;1073000">
	<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
	<META HTTP-EQUIV="Expires" CONTENT="Tue, 01 Jan 2000 1:00:00 GMT">
	<META HTTP-EQUIV="Pragma" CONTENT="no-cache">
	<STYLE>
	<!--
		A:visited { color: #800080 }
		A:link { color: #0000ff }
	-->
	</STYLE>
</HEAD>
<BODY LINK="#0000ff" VLINK="#800080" BGCOLOR="#ccccff">
<CENTER>
	<TABLE WIDTH=100% BORDER=1 BORDERCOLOR="#000000" CELLPADDING=3 CELLSPACING=3 STYLE="page-break-before: always">
		<COL WIDTH=50*>
		<COL WIDTH=60*>
		<COL WIDTH=42*>
		<COL WIDTH=55*>
		<COL WIDTH=50*>
		<TR>
			<TD COLSPAN=5 WIDTH=100% HEIGHT=14 VALIGN=TOP BGCOLOR="#000000">
				<P ALIGN=CENTER><FONT COLOR="#ffffff"><FONT SIZE=5><B>Procedimiento
				para Actualizar la Documentaci&oacute;n </B></FONT></FONT>
				</P>
			</TD>
		</TR>
		<TR VALIGN=TOP>
			<TD WIDTH=19% HEIGHT=16 BGCOLOR="#808080">
				<P ALIGN=CENTER><A HREF="index.html"><B><FONT COLOR="#ffff00">Presentaci&oacute;n</FONT></B></A></P>
			</TD>
			<TD WIDTH=23% BGCOLOR="#808080">
				<P ALIGN=CENTER><A HREF="modus.htm"><B><FONT COLOR="#ffff00">Modus
				Operandi</FONT></B></A></P>
			</TD>
			<TD WIDTH=16% BGCOLOR="#808080">
				<P ALIGN=CENTER><A HREF="prioridades.htm"><B><FONT COLOR="#ffff00">Prioridades</FONT></B></A></P>
			</TD>
			<TD WIDTH=21% BGCOLOR="#808080">
				<P ALIGN=CENTER><A HREF="colaboradores.htm"><B><FONT COLOR="#ffff00">Colaboradores</FONT></B></A></P>
			</TD>
			<TD WIDTH=19% BGCOLOR="#808080">
				<P ALIGN=CENTER><A HREF="aclaraciones.htm"><B><FONT COLOR="#ffff00">Aclaraciones</FONT></B></A></P>
			</TD>
		</TR>
	</TABLE>
</CENTER>
<P><BR><BR><BR>
</P>
<TABLE WIDTH=100% BORDER=1 CELLPADDING=4 CELLSPACING=3>
	<COL WIDTH=147*>
	<COL WIDTH=13*>
	<COL WIDTH=45*>
	<COL WIDTH=51*>
	<THEAD>
		<TR VALIGN=TOP>
			<TH WIDTH=57%>
				<P>&iquest;Que tipo de conexi&oacute;n tienes con Internet?</P>
			</TH>
			<TH WIDTH=5%>
				<P><BR>
				</P>
			</TH>
			<TH WIDTH=17%>
				<P><A HREF="#acceso_permanente">Permanente</A></P>
			</TH>
			<TH WIDTH=20%>
				<P><A HREF="#pago_por_consumo">Pago por consumo</A></P>
			</TH>
		</TR>
	</THEAD>
</TABLE>
<P><BR><BR>
</P>
<P><A NAME="acceso_permanente"></A><FONT SIZE=4 STYLE="font-size: 16pt"><U><B>Con
acceso a internet permanente.</B></U></FONT></P>
<TABLE WIDTH=100% BORDER=1 CELLPADDING=4 CELLSPACING=3>
	<COL WIDTH=183*>
	<COL WIDTH=13*>
	<COL WIDTH=29*>
	<COL WIDTH=31*>
	<THEAD>
		<TR VALIGN=TOP>
			<TD WIDTH=71%>
				<P><B>&iquest;Tienes cuenta de acceso al servidor CVS del
				proyecto?</B></P>
			</TD>
			<TD WIDTH=5%>
				<P><BR>
				</P>
			</TD>
			<TD WIDTH=11%>
				<P ALIGN=CENTER><A HREF="#permanente_y_cvs"><B>SI</B></A></P>
			</TD>
			<TD WIDTH=12%>
				<P ALIGN=CENTER><A HREF="#permanente_sin_cvs"><B>NO</B></A></P>
			</TD>
		</TR>
	</THEAD>
</TABLE>
<P><BR><BR>
</P>
<P><A NAME="permanente_y_cvs"></A><FONT SIZE=4 STYLE="font-size: 16pt"><U><B>Con
acceso al CVS del proyecto.</B></U></FONT></P>
<P>En este caso, asumir&eacute; que ya te has descargado el arbol
doc-postgresql-es completo.</P>
<P>En estas condiciones tienes ya en tu PC la rama V6, en el que
todos los documentos se encuentran en la versi&oacute;n actual de
traducci&oacute;n (pr&aacute;cticamente todos en espa&ntilde;ol), y
la rama V7, que tiene la versi&oacute;n que queremos actualizar.</P>
<P>Conectate a la p&aacute;gina cvsweb del proyecto
(<A HREF="http://cvs.hispalinux.es/cgi-bin/cvsweb/doc-postgresql-es/">http://cvs.hispalinux.es/cgi-bin/cvsweb/doc-postgresql-es/</A>),
y navega por el directorio &quot;diferencia&quot; hasta llegar al
fichero que se te ha asignado, que salvo tratamientos especiales
puede encontrarse bajo src/sgml/ o src/sgml/ref/ 
</P>
<P>Si se encuentra en versi&oacute;n 1.1, es que es un fichero que
qued&oacute; obsoleto en la versi&oacute;n 6.5.3, y no hay que
actualizarlo. Se deben tratar s&oacute;lo los que se encuentren en
1.2, al menos.</P>
<P>Si hay m&aacute;s de dos versi&oacute;nes, (1.1, 1.2 y otra/s),
marca en la 1.1 como &quot;select for diffs&quot;. Si s&oacute;lo hay
dos no hace falta.</P>
<P>Ahora ve a la m&aacute;s alta que encuentres, normalmente la 1.2,
y pincha en &quot;diff to previous ... selected 1.1 (colored)&quot;</P>
<P STYLE="margin-left: 2cm">Se trata de ver la diferencia entre la
versi&oacute;n que hay como m&aacute;s alta y la que hay como
inicial.</P>
<P>Si todo ha ido bien, estar&aacute;s viendo un resumen del
documento original en ingl&eacute;s que tienes que actualizar, con
algunas marcas de diversos colores. Bien, esas marcas marcan (sorry)
las diferencias entre la versi&oacute;n 6.5.3 y la versi&oacute;n
7.1.2.</P>
<P>Ahora nos vamos en nuestro propio pc a la rama v6 del cvs, y
buscamos el fichero a actualizar. Antes de hacer otra cosa, lo
copiamos sobre el mismo fichero de la versi&oacute;n v7, que es sobre
el que vamos a trabajar directamente Normalmente debe de estar en
algo parecido a correcto castellano.</P>
<P>Bien, pues se trata de ir introduciendo las diferencias que hemos
encontrado en la vista en color, adecuadamente traducidas, en su
posici&oacute;n en la versi&oacute;n espa&ntilde;ola.</P>
<P>Y una vez demos por terminada la actualizaci&oacute;n del fichero,
ahora sobre la rama v7, la subimos al cvs con el comando cvs ci
fichero que ya conocemos.</P>
<P>Acto seguido enviamos un correo a los cuatro constructores, a
Roberto y a Eduardo, para que puedan llevar el adecuado seguimiento
del estado del proyecto.</P>
<P><A NAME="permanente_sin_cvs"></A><FONT SIZE=4 STYLE="font-size: 16pt"><U><B>Sin
cuenta en el cvs del proyecto.</B></U></FONT></P>
<P>Accedemos a ver las diferencias del mismo modo que si tenemos
&quot;<A HREF="#permanente_y_cvs">Acceso al cvs del proyecto</A>&quot;.</P>
<P>Nos cambiamos a la rama v6 del cvs del proyecto, y navegamos hasta
ver nuestro fichero. Cuando lleguemos, nos descargamos la &uacute;ltima
versi&oacute;n que aparezca. (Bot&oacute;n derecho sobre el enlace
&quot;download&quot; suele preguntar lo que se quiere hacer con el
enlace: pues eso, que &quot;guardarlo como...&quot;)</P>
<P>Y ahora trabajamos sobre el fichero que nos acabamos de descargar
como si lo tuviesemos en la rama v7 del cvs.</P>
<P>Una vez hemos terminado, le enviamos un correo (el mismo, no hace
falta que os repitais ;-P) a los cuatro constructores, a Roberto
Santos y a Eduardo Maldonado, para que ellos se ocupen de subirlo a
cvs e ir realizando las tareas de maquetaci&oacute;n y dem&aacute;s
oportunas. No olvideis indicar en el correo que se trata de una
actualizaci&oacute;n a v7.</P>
<P>Y procurar no cambiar el nombre al fichero, o nos volveremos
locos.</P>
<P><A NAME="pago_por_consumo"></A><FONT SIZE=4 STYLE="font-size: 16pt"><U><B>Con
conexi&oacute;n de pago por consumo.</B></U></FONT></P>
<P>Tranquilos, que no pasa nada. Revisamos en el punto de &quot;<A HREF="#permanente_y_cvs">Con
acceso al cvs del proyecto</A>&quot; los pasos para localizar las
diferencias entre las dos versiones del fichero.</P>
<P>Nos guardamos la p&aacute;gina que estamos viendo en el mismo PC,
utilizando las capacidades que tienen todos los navegadores. De esta
forma nos podremos desconectar enseguida, y podremos seguir
estudiando estas diferencias.</P>
<P>Y ahora nos comportamos como los que tienen conexi&oacute;n
permanente a internet pero no tienen acceso al cvs: primero navegamos
hasta el fichero asignado en la rama v6 del cvsweb, y nos lo
descargamos a nuestro pc.</P>
<P>Una vez descargado, ya podemos desconectarnos hasta que terminemos
de actualizar.</P>
<P>Una vez actualizado, se lo enviamos por correo electr&oacute;nico
a los cuatro constructores, a Roberto y Eduardo, para que lleven el
seguimiento y lo suban ellos al cvs.</P>
<P><B><U><FONT SIZE=4 STYLE="font-size: 16pt">Conclusiones y petici&oacute;n
de sugerencias</FONT></U></B>.</P>
<P>Bueno, ha sido f&aacute;cil, &iquest;no? &iquest;Que no entend&eacute;is
nada? Pues no me extra&ntilde;a: tengo conciencia de m&iacute; de que
necesito un curso urgente de comunicaci&oacute;n interpersonal.</P>
<P>En fin, que ya sab&eacute;is que se admiten todo tipo de
sugerencias. Enviadlas a la lista, y as&iacute; las comentaremos
entre todos.</P>
</BODY>
</HTML>
