<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
	<TITLE></TITLE>
	<META NAME="GENERATOR" CONTENT="StarOffice/5.1 (Linux)">
	<META NAME="CREATED" CONTENT="20011215;1493000">
	<META NAME="CHANGED" CONTENT="16010101;0">
	<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
	<STYLE>
	<!--
		A:visited { color: #800080 }
		A:link { color: #0000ff }
	-->
	</STYLE>
</HEAD>
<BODY LINK="#0000ff" VLINK="#800080" BGCOLOR="#ccffff">
<P>Bienvenidos a la p&aacute;gina de LuCAs sobre PgAccess. En ella
podr&aacute; obtener la traducci&oacute;n del tutorial de PgAccess
as&iacute; como un fichero que le permitir&aacute; tener la interfaz
en castellano. 
</P>
<P>La traducci&oacute;n de todo esto la han realizado <FONT COLOR="#dc2300">Gonzalo
Aguirre y Francisco Javier Sucunza</FONT> y supervisados por el
coordinador <FONT COLOR="#dc2300">Roberto Santos</FONT>. 
</P>
<H4>TUTORIAL</H4>
<DL>
	<DD STYLE="margin-bottom: 0.5cm">Desde aqu&iacute; podra bajarse la
	documentaci&oacute;n en castellano del tutorial de pgaccess. El
	formato del tutorial est&aacute; en html y se encuentran comprimidos
	en formato *.tar.gz y *.zip. 
	</DD><DD STYLE="margin-bottom: 0.5cm">
	Bajarse el <A HREF="http://lucas.hispalinux.es/Postgresql-es/archivos/tutorial-pgaccess-es.html.tar.gz">tutorial en español</A>
		</DD></DL>
<H4>
INTERFAZ PGACCESS EN CASTELLANO.</H4>
<P>Con este fichero conseguiras que la interfaz de PgAccess est&eacute;
en espa&ntilde;ol. El lugar d&oacute;nde debes guardarlo depender&aacute;
de si tienes un windows o un Linux y en este &uacute;ltimo caso
depender&aacute; de tu distribuci&oacute;n Linux. 
</P>
<DL>
	<DT STYLE="margin-bottom: 0.5cm">Por lo que he podido comprobar en
	distribuciones basadas en Redhat (Esware, Mandrake, Hispafuentes...)
	deber&iacute;as colocarlo en: 
	</DT><DD STYLE="margin-bottom: 0.5cm">
	/usr/lib/pgsql/pgaccess/lib/languages/ 
	</DD><DT STYLE="margin-bottom: 0.5cm">
	En Debian: 
	</DT><DD STYLE="margin-bottom: 0.5cm">
	/usr/lib/postgresql/pgaccess/lib/languages. 
	</DD></DL>
<P>
Una vez ah&iacute; ya solo tienes que llamar a PgAccess y elegir
dicho fichero como idioma preferido. En todo momento se presupone que
ya se tiene PgAccess y PostgreSQL instalado. Si alguien tiene m&aacute;s
informaci&oacute;n o alguna correci&oacute;n que hacer no tine m&aacute;s
que <A HREF="mailto:frantxu@teleline.es">enviarme un e-mail</A>. 
</P>
<P>Bajarse el <A HREF="espanol">fichero</A> para
la interfaz en castellano. 
</P>
<P><BR><BR>
</P>
<P><BR>La versi&oacute;n no es definitiva y esperamos la colaboraci&oacute;n
de todos para mejorarla ya que algunas frases una vez traducidas al
espa&ntilde;ol son tan largas que no caben en el cuadro de di&aacute;logo
reservado a una frase que en Ingles es m&aacute;s corta. Debido a la
imposibilidad de ir probando todas las opciones (no s&oacute;lo nos
dedicamos a esto) esperamos que nos indiqu&eacute;is los posibles
errores y vuestras sugerencias. Cuando acabemos con la documentaci&oacute;n
que acompa&ntilde;a a PgAccess empezaremos con la traducci&oacute;n
de la ayuda a la que se accede mediante el bot&oacute;n &quot;ayuda&quot;
o pulsando F1 
</P>
<P>Intentaremos ir actualizando esta p&aacute;gina conforme vayan
saliendo nuevas versiones, pero recordad que nos dedicamos a &eacute;sto
por &quot;amor al arte&quot;. 
</P>
<P>Sugerencias, correcciones, colaboraciones, etc. a <A HREF="mailto:frantxu@teleline.es">Francisco
Javier Sucunza.</A> 
</P>
</BODY>
</HTML>
