<html>
<head>

<title>Pensando en C++</title>

<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="keywords" content="pensando,c++,thinking,eitig,bruce,eckel,informatica,segovia,programacion,domingo,soto,universidad,facultad">
<meta name="description" content="EITIG.COM Web Independiente Colegio Universitario Domingo de Soto, Escuela de Informática">
</head>
<body bgcolor="#FFFFFF" link="#446699" vlink="#446699" alink="#446699">
<table width="90%" border="0" cellspacing="0" cellpadding="0" align="center" height="684">
  <tr> 
    <td bgcolor="#336699" height="23" width="81%"><font face="Arial, Helvetica, sans-serif" size="2"><b><font color="#FFFFFF">&nbsp;Pensando
      en C++</font></b></font></td>
    <td bgcolor="#577CB5" height="23" width="2%">&nbsp;</td>
    <td bgcolor="#88A3CA" height="23" width="2%">&nbsp;</td>
    <td bgcolor="#A7BAD8" height="23" width="2%">&nbsp;</td>
    <td bgcolor="#C1CFE3" height="23" width="2%">&nbsp;</td>
    <td bgcolor="#DDE4F0" height="23" width="2%">&nbsp;</td>
    <td bgcolor="#EDF1F8" height="23" width="2%">&nbsp;</td>
    <td bgcolor="#F8FAFC" height="23" width="2%">&nbsp;</td>
    <td height="23" width="2%">&nbsp;</td>
    <td width="3%" height="23">&nbsp;</td>
  </tr>
  <tr> 
    <td height="547" colspan="10">
      <div align="center">&nbsp;</div>
      <div align="center">
        <p align="left"><b><font face="Arial, Helvetica, sans-serif" size="4" color="#336699">
        
        <h1><b><font size=+2>Normas de estilo para la traducci&oacute;n de textos inform&aacute;ticos</font></b></h1>
        
        
        </font></b></div>
      <div align="center">
        <p align="left">&nbsp;</div>  
      
      
      
&nbsp;<font face="Arial,Helvetica"></font>&nbsp;
<div align=right>
<br><font face="Arial,Helvetica">Manuel A. Gonz&aacute;lez&nbsp;<a NAME="1"></a><font size=-1><a href="#(1)">(1)</a></font>,
Jos&eacute; Daniel S&aacute;nchez&nbsp;<a NAME="2"></a><font size=-1><a href="#(2">(2)</a></font></font>
<br><i>Grupo de Ingenier&iacute;a del Software,&nbsp;</i>
<br><i>Dpto. Inform&aacute;tica y Sistemas. Univ. de Murcia&nbsp;</i>
<br><b><i>e-mail: (manolo | jdaniel)@dif.um.es; tlf:34-68-</i></b>
<br><b><i>307100 ext.2051; fax: 34-68-364151</i></b></div>

<p><br><i><b>Resumen:</b> este art&iacute;culo est&aacute; basado en el
estudio de las traducciones de textos inform&aacute;ticos del ingl&eacute;s
al castellano y en la experiencia de los autores en el &aacute;rea de la
traducci&oacute;n. Su objetivo es proporcionar al lector una serie de normas
de estilo &uacute;ltiles a la hora de leer y traducir un texto infromat&iacute;co
en ingl&eacute;s, as&iacute; como advertirle de los errores m&aacute;s
frecuentesque intentenamos hacer una aportaci&oacute;n a la homogeneizaci&oacute;n
de t&eacute;rminos inform&aacute;ticos en castellano, con el fin de evitar
la invasi&oacute;n de extranjerismos que empobrecen nuestra lengua y que
hacen proliferar t&eacute;rminos no demasiado afortunados. No es un art&iacute;culo
dirigido a profesionales de la traducci&oacute;n, sino un intento de transmitir
el conocimientos de estos profesionales a la comunidad inform&aacute;tica.</i>
<h3>
</h3>

<h3>
1. Introducci&oacute;n&nbsp;</h3>
Es un hecho evidente e indiscutible que el lenguaje de la Inform&aacute;tica
es el ingl&eacute;s. Tradicionalmente, el iniciado en Inform&aacute;tica
ten&iacute;a (y tiene, aunque hoy en menor medida) que pasar por el trance
de enfrentarse a la lectura de textos en lengua inglesa, ya sean manuales
de software, el propio software o libros tem&aacute;ticos. En Espa&ntilde;a,
pese al avance de los &uacute;ltimos a&ntilde;os, el estudio de idiomas
es una asignatura pendiente, y si a ello unimos la distancia que existe
entre nuestra lengua materna (procedente del lat&iacute;n) y la inglesa
(con ra&iacute;ces sajonas), es f&aacute;cil comprender las grandes dificultades
que tuvieron las primeras generaciones inform&aacute;ticasrespecto a la
superaci&oacute;n de la barrera ling&uuml;&iacute;stica. Debido a esta
coyuntura, en la comunidad inform&aacute;tica han sobrevivido bastantes
'vicios' que no se acaban de corregir.&nbsp;
<p>No ser&aacute; dif&iacute;cil olvidar traducciones como aquella que
hac&iacute;a corresponder <i>correr</i> al verbo ingl&eacute;s <i>to run</i>
y que todav&iacute;a se puede o&iacute;r en boca de alg&uacute;n inform&aacute;tico
'jur&aacute;sico'. En este art&iacute;culo se intenta establecer una serie
de normas que eliminen algunas de las asperezas que perduran en las traducciones
de textos inform&aacute;ticos del ingl&eacute;s al castellano, en un test
que han realizado profesores y alumnos de la Universidad de Murcia, as&iacute;
como en la adaptaci&oacute;n de normas de estilo procedentes del periodismo
escrito al campo de la inform&aacute;tica. La experiencia de los autores
en la realizaci&oacute;n de traducciones para editoriales y empresas de
servicios ling&uuml;&iacute;sticos tambi&eacute;n ha sido un grado.&nbsp;
<p>Este art&iacute;culo no va dirigido a los profesionales de la traducci&oacute;n
que,&nbsp; por lo general, observan con bastantes escr&uacute;pulos las
reglas que aqu&iacute; se presentan. S&iacute; que solicitamos la atenci&oacute;n
de aquellos que sin ser traductores profesionales realizan traducciones
espor&aacute;dicas (para uso interno de una empresa, como colaboraci&oacute;n
de alguna publicaci&oacute;n o editorial,....), as&iacute; como la de aquellos
usuarios, profesionales y estudiantes de inform&aacute;tica que quieran
leer y traducir correctamente manuales y libros inform&aacute;ticos sin
que sus h&aacute;bitos ling&uuml;&iacute;sticos sufran las deformaciones
de una traducci&oacute;n literal.&nbsp;
<p>En la secci&oacute;n 2 se hacen una serie de consideraciones de car&aacute;cter
general que creemos deben observarse para conseguir una traducci&oacute;n
de calidad. En la secci&oacute;n 3 se hace hincapi&eacute; en la construcci&oacute;n
adecuada de las frases. En la secci&oacute;n 4 se revisa la traducci&oacute;n
de t&eacute;rminos inform&aacute;ticos.&nbsp;
<h3>
2. Consideraciones generales&nbsp;</h3>

<p><br>Una traducci&oacute;n de un texto inform&aacute;tico que no sea
excesivamente&nbsp; cient&iacute;fico, es decir, que vaya dirigido a un
p&uacute;blico amplio debe poseer las siguientes notas caracter&iacute;sticas:&nbsp;
<ul>
<li>
1)&nbsp; Correcci&oacute;n: debe estar pr&oacute;ximo al lenguaje coloquial
culto.&nbsp;</li>

<li>
2)&nbsp; Concisi&oacute;n: debe estar basado en frases cortas.&nbsp;</li>

<li>
3)&nbsp; Claridad: mediante el uso de verbos adecuados, en forma activa
y tiempo indicativo. Estas indicaciones son especialmente recomendables
para formular la negaci&oacute;n.&nbsp;</li>
</ul>

<p><br>La claridad es la condici&oacute;n primera. Nace de la frase corta,
eliminando de la oraci&oacute;n todo aquello que obliga a detenerse para
reflexionar sobre el sentido de la frase, todo lo que estorba para la rapidez
de la lectura. La claridad se consigue utilizando verbos de acci&oacute;n,
verbos en forma activa, huyendo todo lo posible de la voz pasiva. La man&iacute;a
de sustantivizar paraliza la vida de cualquier lenguaje.
<p>Para conseguir una redacci&oacute;n de calidad se deben adoptar criterios
que en la mayor&iacute;a de los casos deben de ser objetivos y en un peque&ntilde;o
porcentaje se deben ajustar a las preferencias del autor pero que &eacute;ste
debe mantener con coherencia durante toda la traducci&oacute;n. Estos criterios
deben servir de gu&iacute;as metodol&oacute;gicas durante la traducci&oacute;n
y su observaci&oacute;n garantiza una redacci&oacute;n clara, concisa y
elegante.&nbsp;
<p>Las construcciones y los giros deben estar exentos de anglicismos y
extranjerismos en general. Hay muchas construcciones extranjeras que no
tienen equivalencia en castellano, el hecho de intentar traducirlas literalmente
produce traducciones que no se ajustan a las reglas de nuestra gram&aacute;tica.
Una de las m&aacute;s frecuentes es el galicismo <i>a + infinitivo </i>que
aparece en frases como <i>el informe a crear (the report to create)</i>,
<i>el programa a ejecutar (the report to run)</i> cuya traducci&oacute;n
correcta deber&iacute;a ser una frase&nbsp; de relativo como <i>el informe
que se va a crear</i> o <i>el programa que se va a ejecutar.</i> Hay que
resaltar que <i>en base a, a nivel de</i>&nbsp; y otras construcciones
similares, son en todo punto, inaceptables. Para la primera mejor utilizar:
<i>bas&aacute;ndose en, a tenor de, seg&uacute;n, ...</i>
<p>Se debe evitar la proliferaci&oacute;n de pasivas que producen en algunos
casos traducciones poco din&aacute;micas y nada castellanas. El uso preferente
de la forma activa de los verbos proporciona en primer t&eacute;rmino grandes
dosis de claridad y agilidad. En segundo lugar, favorece la concisi&oacute;n
de la frase por su mayor riqueza de matices respecto a la frase apoyada
en el grupo nominal. As&iacute; pues, no se debe caer en el abuso de pasivas
y no hay que traducirlas en frases como <i>the disk is inserted into the
computer</i> (se evitar&aacute; la pasiva, innecesaria y poco castellana
<i>el disco es insertado en el ordenador).</i> Para la traducci&oacute;n
de la frase anterior es aconsejable la pasiva refleja&nbsp;<a NAME="3"></a><a href="#(3)">(3)</a>
con la cual la frase quedar&iacute;a traducida como: <i>se introduce el
disco en el ordenador.</i> Hay frases en las que es necesario el uso de
la pasiva impersonal, como por ejemplo en <i>this chapter describe how...
</i>(que se suele traducir como <i>este cap&iacute;tulo describe como...),</i>&nbsp;
con el fin de evitar que el peso de la acci&oacute;n recaiga en un sujeto
que no es tal. En el anterior ejemplo no es el cap&iacute;tulo quien describe
sino las personas que lo escribieron, por lo que ser&iacute;a m&aacute;s
natural traducirlo utilizando una pasiva impersonal por <i>en este cap&iacute;tulo
se describe c&oacute;mo...</i>
<br>&nbsp;
<p>El tiempo presente de los verbos es muy &uacute;til para dar vigor y&nbsp;
sensaci&oacute;n de actualidad a las narraciones. Por ello es preciso cuidar
que en un p&aacute;rrafo desarrollado en tiempo presente no se filtren,&nbsp;
respecto de la misma acci&oacute;n, giros verbales de tiempo pret&eacute;rito.
En&nbsp; cuanto al empleo de los verbos es muy importante mantener una&nbsp;
coherencia a lo largo de todo el texto, evitando mezclar en demas&iacute;a
el tiempo y la persona en la que se conjuga el verbo. Nosotros&nbsp;
<br>proponemos el empleo de la tercera persona del singular en presente.&nbsp;
S&oacute;lo se utilizar&aacute; la primera persona del plural cuando sea&nbsp;
imprescindible. Por ejemplo, en lugar de decir <i>en este cap&iacute;tulo
aprenderemos a...</i> es mejor <i>en este cap&iacute;tulo aprender&aacute;
a...</i> se mantiene el texto en tercera persona del singular y no se pierde
expresividad. En cuanto al tiempo del verbo, es obvio que no hay que ce&ntilde;irse
al uso exclusivo del presente sino hay que respetar el verbo cuando &eacute;ste
haga referencias a sucesos del pasado o futuro. Pero por&nbsp; ejemplo,
en instrucciones del tipo <i>when you press the button OK, the screen will
show...</i> no es necesario el uso del futuro y es posible traducirlas
por presente de indicativo o bien con un infinitivo seguido de presente
de indicativo: <i>si pulsa el bot&oacute;n&nbsp; Aceptar, aparece en pantalla...
</i>o<i> al pulsar el bot&oacute;n Aceptar&nbsp; aparece en pantalla...</i>
<p>Especial vigilancia merecen los gerundios incorrectos. El gerundio ser&aacute;
tanto m&aacute;s correcto desde el punto de vista gramatical, cuanto m&aacute;s
predomine el car&aacute;cter adverbial modificativo de la acci&oacute;n
expresada por el verbo principal (active la opci&oacute;n XXX utilizando
el rat&oacute;n) y cuanto m&aacute;s proximidad o coetaneidad temporal
haya entre las acciones&nbsp;
<br>expresadas por el verbo principal y el gerundio (apagando el ordenador
se consigue eliminar el virus de memoria). El gerundio tiene en castellano
unas funciones que no necesariamente coinciden con las que recibe en ingl&eacute;s.
No es necesario evitar el gerundio, pues tiene una funci&oacute;n muy necesaria,
pero es preciso reflexionar sobre el papel&nbsp;
<br>que desempe&ntilde;a en el texto original y ofrecer una traducci&oacute;n
castellana equivalente. En concreto son incorrectos:&nbsp;
<p>*El llamado gerundio de posterioridad (se selecciona el mandato X,&nbsp;
abri&eacute;ndose el panel de di&aacute;logo Y). Este tipo de construcciones&nbsp;
se deben traducir por se selecciona el mandato X, y se abre el panel&nbsp;
de di&aacute;logo Y.&nbsp;
<br>&nbsp;
<p>*El gerundio como participio presente. Ejemplo de traducci&oacute;n:
' a list containing the file name' no se debe traducir por una lista conteniendo
los nombres de archivo, sino por una construcci&oacute;n&nbsp; adjetival
equivalente, por ejemplo, una subordinada relativa (una lista que contiene
los nombres de archivo) o un complemento preposicional (una lista con los
nombres de archivo).&nbsp;
<p>*La construcci&oacute;n anglicista 'verbo auxiliar mas gerundio'. Es
frecuente leer construcciones como el archivo que estamos creando, donde
la acci&oacute;n moment&aacute;nea expresada por el verbo crear choca con
el significado&nbsp; durativo del gerundio, y que son influencia de una
mala traducci&oacute;n del ingl&eacute;s. Son acciones que no se pueden
estar haciendo sino que se hacen&nbsp; (el archivo que creamos).&nbsp;
<p>*En particular, los t&iacute;tulos de cap&iacute;tulos o secciones que
en ingl&eacute;s se&nbsp; presentan en gerundio, por ejemplo. <i>Sending
Messages,</i> se traducir&aacute;n&nbsp; por un sustantivo, <i>Env&iacute;o
de mensajes.&nbsp;</i>
<br>&nbsp;
<p>Como norma general hay que guardar fidelidad con el original para no
dejar de traducir ning&uacute;n matiz ni idea. Pero hay que tener cuidado
y no caer en el exceso de manera que las frases construidas en la&nbsp;
traducci&oacute;n guarden un excesivo parecido con el original en ingl&eacute;s.
Es bastante frecuente leer frases en castellano en las que no es muy&nbsp;
<br>&nbsp;dif&iacute;cil identificar la estructura inglesa de la frase
original. Por ejemplo, no hay m&aacute;s que observar esta frase:
<p><i>&laquo;Sin tener en cuenta la opci&oacute;n que seleccione, cuando
la aplicaci&oacute;n&nbsp; se ejecuta, el directorio actual se establece
a la ruta de acceso&nbsp; especificada en el panel de di&aacute;logo XXX&raquo;;&nbsp;</i>
<p>y leer a continuaci&oacute;n el original ingl&eacute;s:&nbsp;
<p><i>&laquo;Regardless of the option you choose, when the application
is run, the&nbsp; current directory will be set to the path specified in
the XXX dialog box&raquo;.&nbsp;</i>
<p>&nbsp;Para evitar este parecido antinatural se deben adoptar ciertas
normas, como evitar la posposici&oacute;n del sujeto <i>(muchos de los
detalles tradicionales de desarrollo los gestiona el repositorio</i> cuando
deber&iacute;a decir <i>el repositorio gestiona...).</i> No hay que abusar
de los verbos auxiliares o modales (los que sirven para la conjugaci&oacute;n
de los dem&aacute;s), como por ejemplo el verbo <i>poder (to can)</i> en
frases como <i>puede que desee visualizar... (you can want to visualize)</i>
o bien <i>puede querer ejecutar (you can want to execute).</i> Una alternativa
es el uso del adverbio <i>quiz&aacute;s (quiz&aacute;s desee visualizar...)</i>
u otras construcciones <i>(es posible ejecutar...).</i>
<p>El tono de la traducci&oacute;n debe ser formal; nunca utilice la segunda
persona del singular para traducir el pronombre personal <i>you. </i>Las
instrucciones dirigidas al lector se deben redactar en un modo directo;
por ejemplo se debe evitar el uso del verbo en infinitivo cuando sea posible
sustituirlo por un verbo imperativo <i>(seleccione la&nbsp;</i>
<br><i>opci&oacute;n XXX </i>es mejor que<i> seleccionar la...).</i> Nuestro
criterio personal es que no se debe emplear la palabra usted, ni su abreviatura,excepto
cuando sea necesario evitar ambig&uuml;edades (pocas veces lo es).&nbsp;
<p>Por otra parte, una vez decidida la utilizaci&oacute;n de un t&eacute;rmino,
se debe atener a &eacute;l durante toda la traducci&oacute;n. Si se opta,
por ejemplo, por la palabra <i>archivo</i> como traducci&oacute;n de <i>file,</i>
&eacute;ste es el t&eacute;rmino que debe utilizarse constantemente. Si
de repente se comienza a utilizar la palabra fichero, es posible que alguien
piense que se est&aacute; refiriendo a cosas distintas.&nbsp;
<br>&nbsp;
<h3>
3. Fraseolog&iacute;a&nbsp;</h3>

<p><br>En el apartado anterior ya se advirti&oacute; de la necesidad de
construir frases cortas, claras y en un tono formal. Pero nada se dijo
de c&oacute;mo cuidar el aspecto de las frases m&aacute;s frecuentes en
los textos inform&aacute;ticos para acercarlas a un estilo m&aacute;s acorde
con las reglas del castellano escrito.&nbsp;
<p>Este ser&aacute; el objetivo de este apartado. Cuando exista una lista
de tipo enumerativo (acciones que hay que realizar, etc...), se debe mantener
la coherencia del tiempo verbal en las instrucciones. En este tipo de lista
se optar&aacute; por dirigirse al lector en tercera persona del singular.&nbsp;
<br>Por ejemplo:&nbsp;
<blockquote>&nbsp;&nbsp; <i>1. Active la opci&oacute;n X,&nbsp;</i>
<br><i>&nbsp;&nbsp; 2. Abra el archivo Y,&nbsp;</i></blockquote>

<p><br>pero no son convenientes construcciones como:&nbsp;
<blockquote>&nbsp;&nbsp;&nbsp; <i>a) incorporaci&oacute;n de un objeto
incrustado;&nbsp;</i>
<br><i>&nbsp;&nbsp;&nbsp; b) mejora de la resoluci&oacute;n&nbsp;</i>
<br><i>&nbsp;&nbsp;&nbsp; c) abrir varios archivos a la vez.&nbsp;</i></blockquote>

<p><br>En castellano, el &uacute;ltimo elemento de las enumeraciones va
precedido por la conjunci&oacute;n que toma el lugar de la coma inglesa.
As&iacute;, frases del tipo <i>red, blue, and green</i> se traducir&aacute;n
como <i>rojo, azul y verde.</i> Esto no basta para que, cuando proceda,
las conjunciones&nbsp; puedan ir precedidas por coma.&nbsp;
<p>Las referencias del tipo <i>for more information see Chapter xxx of&nbsp;
the User Guide</i> no se deben traducir por frases del tipo <i>para&nbsp;
mayor informaci&oacute;n vea el Cap&iacute;tulo xxx</i> ya que son giros
poco castellanos y demasiado literales. Es m&aacute;s conveniente utilizar
frases como <i>Si desea m&aacute;s informaci&oacute;n, consulte el cap&iacute;tulo
xxx de la Gu&iacute;a del usuario</i> o <i>encontrar&aacute; informaci&oacute;n
m&aacute;s detallada en el cap&iacute;tulo xxx de la Gu&iacute;a del usuario.</i>
<p>Los textos inform&aacute;ticos, en especial los manuales, son muy repetitivos
en cuanto a contenido y en la construcci&oacute;n de las frases. Las repeticiones
de contenido son deseables en toda documentaci&oacute;n t&eacute;cnica.&nbsp;
Sin embargo, existe otro tipo de repetici&oacute;n, que parece estar creando
estilo en los manuales de este g&eacute;nero: <i>if you want to save the
file&nbsp;</i>
<br><i>with a file name different from the current one, chose <b>File Save
As</b> from the <b>File </b>menu and save the file, with the new file name.</i>
Sin intentar una traducci&oacute;n excesivamente afortunada, no resultar&iacute;a
dif&iacute;cil eliminar al menos la mitad de los <i>files:</i> <i>para
guardar el archivo con un nombre distinto, seleccione <b>Archivo Guardar
como</b> e indique el nuevo nombre.&nbsp;</i>
<p>Tambi&eacute;n hay que evitar la repetici&oacute;n innecesaria del sujeto
as&iacute; como el empleo de <i>el mismo</i> o <i>la misma</i> en sentido
anaf&oacute;rico, pues resulta innecesario en casi todos los casos, y en
los dem&aacute;s puede sustituirse por una part&iacute;cula que cumpla
la funci&oacute;n adecuada <i>(uno de ellos, uno de &eacute;sta, su, ...).</i>
Por ejemplo, en <i>abra la ventana de archivos y seleccione uno de la misma,</i>
puede eliminarse de la frase el fragmento <i>de la misma</i> sin ninguna
merma de sentido o&nbsp;
<br>expresividad.&nbsp;
<p>A colaci&oacute;n de los &uacute;ltimos ejemplos, intentaremos no decir
lo obvio si no resulta imprescindible para evitar ambig&uuml;edades. Por
ejemplo:&nbsp;
<blockquote>—<i>To open an already existing file</i> es <i>abrir un archivo</i>
(existente, claro, los inexistentes no se abren, en todo caso se crean).&nbsp;
<br>—<i>To save the file with a new filename</i> es <i>guardar el archivo
con otro nombre</i> (de archivo, por supuesto).&nbsp;</blockquote>
En cuanto a la puntuaci&oacute;n hay que recordar que la estructura inglesa
no se debe mantener en el texto ya que es diferente a la nuestra. Por ejemplo,
no se deben conservar los guiones, ya que es preferible sustituirlos por
comas, par&eacute;ntesis o dos puntos. Hay que escribir utilizando el menor
n&uacute;mero posible de comas. Esto, normalmente se&nbsp;
<br>consigue por la construcci&oacute;n de la frase siguiendo el orden
l&oacute;gico gramatical, evitando el hip&eacute;rbaton. Aunque se debe
emplear como despu&eacute;s de expresiones que introducen una frase, como
por ejemplo: <i>De esta manera. Para ello.</i> <i>A continuaci&oacute;n,
etc...</i> Si una frase completa se encierra entre par&eacute;ntesis, el
punto de finalizaci&oacute;n de la frase debe situarse antes del &uacute;ltimo
par&eacute;ntesis, (no despu&eacute;s).&nbsp;
<p>En la traducci&oacute;n de siglas se debe traducir el significado pero
nunca las letras que forman la sigla, por ejemplo <i>DLL (Librer&iacute;a
de Enlace Din&aacute;mico)</i> pero nunca <i>LED (Librer&iacute;a de Enlace
Din&aacute;mico),</i> so pena de que nuestro interlocutor piense que se
encuentra ante un concepto nuevo.&nbsp;
<p>En cuanto al uso del rat&oacute;n, las frases del tipo<i> clic on</i>
se traducir&aacute;n por<i> hacer clic en</i> y double clic se traducir&aacute;
por&nbsp;
<br><i>hacer doble clic en</i>. En las explicaciones acerca de las caracter&iacute;sticas
compartidas por todos los documentos, se debe utilizar <i>y</i> en vez
de <i>o.</i> Por ejemplo: <i>In this product you can design sheets, models
or macros</i> se debe traducir por <i>Con este producto es posible dise&ntilde;ar,
modelos y macros</i>.&nbsp;
<br>&nbsp;
<h3>
&nbsp;4. Terminolog&iacute;a&nbsp;</h3>
En situaciones concretas, la traducci&oacute;n demasiado literal de algunos
t&eacute;rminos inform&aacute;ticos produce resultados desafortunados.
Ya coment&aacute;bamos en la introducci&oacute;n la famosa traducci&oacute;n
del verbo <i>to run&nbsp;</i> en la que se pon&iacute;a a la misma altura
un programa de ordenador y un atleta de la marat&oacute;n de Nueva York.
U otros ejemplos como <i>salvar</i> por <i>to save</i> (lo correcto ser&iacute;a
<i>guardar)</i> o <i>reusar</i> por <i>reuse</i> (cuando existe el muy
castellano <i>reutilizar).</i>
<p>Por otro lado, echamos en falta la jerga inform&aacute;tica la traducci&oacute;n
de algunas palabras que siguen manteniendo el vocablo ingl&eacute;s porque
todav&iacute;a no se les ha encontrado una traducci&oacute;n que satisfaga
a la mayor&iacute;a. Un ejemplo podr&iacute;a ser <i>handle</i> (referido
a un <i>identificador</i> de archivo o a un <i>manejador</i> de una estructura
de memoria) o el mismo <i>software</i> al que los franceses m&aacute;s
cuidadosos con su lengua llaman <i>logiciel</i> y que nosotros podr&iacute;amos
sustituir por un sencillo <i>programas</i>.&nbsp;
<p>No hay que intentar traducciones de los t&eacute;rminos demasiado literales.
Ejemplos de buenas traducciones: <i>Getting Started (Primeros pasos), Helping
Hand (Ayudante), AutoBuild (Construcci&oacute;n autom&aacute;tica), </i>en
vez de aquellas que son 'instintivas' como <i>Comenzando</i> o <i>Autoconstrucci&oacute;n.&nbsp;</i>
<p>Hay veces que aparecen t&eacute;rminos que no existen en castellano
o que no tienen el significado que se les supone o que tienen una traducci&oacute;n
un tanto desafortunada, ejemplos: <i>user friendly (amigable</i> ya que
es incorrecto aplicar el anterior vocablo a cosas inanimadas), <i>requirement
(requerimiento</i> cuando se debe decir <i>requisito</i> ya que el primer
vocablo tiene distinto significado en castellano), <i>file (fichero</i>
cuando es mejor <i>archivo).</i> Los papeles no se <i>juegan</i>, se <i>desempe&ntilde;an</i>
(por<i> to play),</i> no es lo mismo <i>suponer</i> algo que <i>asumirlo</i>
(por <i>to assume,</i> la primera acepci&oacute;n es la correcta), <i>disccuss</i>
no es <i>discutir</i> (que en castellano tiene una&nbsp; connotaci&oacute;n
de pelea verbal) sino<i> tratar,</i> <i>command</i> no debe ser <i>comando</i>
(&iquest;antiterrorista?, &iquest;de autodefensa?) sino<i> mandato,</i>
<i>funcionality</i> no es <i>funcionalidad</i> (que no existe en el diccionario)
sino <i>funci&oacute;n </i>o <i>caracter&iacute;stica, to test</i> no es
<i>testar</i> sino <i>comprobar,</i> <i>to be introduced to</i> no es <i>ser
introducido</i> <i>en</i> sino <i>conocer</i> o <i>recibir informaci&oacute;n
de</i>, las versiones son <i>posteriores,</i> los ordenadores <i>superiores</i>
(por <i>386 or better/DOS 3.2 or better)</i>, se debe decir <i>el contenido
de un archivo</i> y no <i>los contenidos de un archivo</i> (al igual que
no se dice <i>los contenidos de una botella),</i> y tantos otros que un
art&iacute;culo breve como &eacute;ste no permite detallar.&nbsp;
<p>Hay veces que un verbo tiene varios sin&oacute;nimos y cada uno de ellos
es adecuado para una determinada situaci&oacute;n, por ejemplo,<i> to choose</i>
por <i>pulsar</i> cuando se refiere a un bot&oacute;n y por <i>seleccionar</i>
o <i>elegir</i> cuando se refiere a una opci&oacute;n de men&uacute; o
a una ventana.&nbsp;
<p>Los nombres de conceptos fundamentales de un programa deben traducirse
siempre excepto cuando aparecen referidos al software y este no se haya
traducido. Por ejemplo <i>Class Browser</i> por <i>Inspector de clases</i>.&nbsp;
<br>Pero en el caso de que no se haya traducido el software: <i>para abrir
el inspector de clases, seleccione el mandato Class Browser del men&uacute;
de Tools.&nbsp;</i>
<p>Una buena t&eacute;cnica a la hora de traducir es construir un glosario
con los t&eacute;rminos m&aacute;s frecuentes y ajustarse a &eacute;l.
Existen ya glosarios normalizados como el del GUI (Interfaz Gr&aacute;fico
de Usuario) de Microsoft indispensable para cualquier aplicaci&oacute;n
del entorno Windows que no quiera parecer una <i>advenediza.&nbsp;</i>
<p>Conste finalmente nuestro agradecimiento a los profesionales de CL Servicios
Ling&uuml;&iacute;sticos S.A. y de la Ed. McGraw-Hill de la que tanto&nbsp;
hemos aprendido.&nbsp;
<p><b>&nbsp;Bibliograf&iacute;a&nbsp;</b><b></b>
<p>&nbsp;[1] <b>J.L. Mart&iacute;nez Albertos.</b> <i>Curso General de
Redacci&oacute;n Period&iacute;stica.</i>&nbsp; Editorial Mitre. Barcelona
1983.&nbsp;
<br>&nbsp;[2] <b>Manuel Seco.</b> <i>Diccionario de dudas de la Lengua
Espa&ntilde;ola.</i> Madrid 1961.&nbsp;
<br>&nbsp;[3]<b> Real Academia Espa&ntilde;ola</b>. <i>Diccionario de la
Lengua Espa&ntilde;ola.</i> Vig&eacute;sima primera edici&oacute;n. Espasa
Calpe&nbsp;
<br>&nbsp;[4] <b>Manuel Casado.</b> <i>El castellano actual, usos y normas.
</i>Ediciones Universidad de Navarra, 1988.&nbsp;
<br>&nbsp;
<br>&nbsp;
<h3>
Notas</h3>
<a NAME="(1)"></a><font size=-1>(1) Traductor 'freelance' para la multinacional
CL Servicios Ling&uuml;&iacute;sticos S.A. <a href="#1">[volver]</a></font>
<p><a NAME="(2"></a><font size=-1>(2) Traductor 'freelance' para la editorial
McGraw-Hill. <a href="#2">[volver]</a></font>
<p><a NAME="(3)"></a><font size=-1>(3) Construcci&oacute;n oracional de
significado pasivo, cuyo verbo en tercera persona aparece en forma activa
precedido de se y sin complemento agente. <a href="#3">[volver]</a></font>
<br>&nbsp;
<br>&nbsp;
<h3>
<b>Notas a la presente edici&oacute;n</b></h3>
<b>*&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </b>Publicado en <i><a href="http://www.ati.es/novatica/" target="_uno">Nov&aacute;tica</a>
</i>n.&ordm; 119 (enero-febrero 1996).
<p><i>**&nbsp;&nbsp; </i>&copy;&nbsp; <i>Nov&aacute;tica</i> autoriza la
reproducci&oacute;n de este art&iacute;culo siempre que se cite su procendencia.
<p>***&nbsp; En la medida de lo posible se ha intentado conservar la ortotipograf&iacute;a
de la versi&oacute;n impresa. Tampoco se han corregido los gazapos que
pudiera tener el original.
<br>&nbsp;</td>
      </div>
        <p align="center"><font color="#336699"> [<a href="index.htm">página
        principal</a>]<font face="Arial, Helvetica, sans-serif" size="2">
      <br>
      </font>
      
        </font>
        <p align="center">&nbsp;
      
    </td>
  </tr>
  <tr> 
    <td bgcolor="#336699" height="24" width="81%">&nbsp;<font face="Arial, Helvetica, sans-serif" size="2"><b></b></font></td>
    <td bgcolor="#577CB5" height="24" width="2%">&nbsp;</td>
    <td bgcolor="#88A3CA" height="24" width="2%">&nbsp;</td>
    <td bgcolor="#A7BAD8" height="24" width="2%">&nbsp;</td>
    <td bgcolor="#C1CFE3" height="24" width="2%">&nbsp;</td>
    <td bgcolor="#DDE4F0" height="24" width="2%">&nbsp;</td>
    <td bgcolor="#EDF1F8" height="24" width="2%">&nbsp;</td>
    <td bgcolor="#F8FAFC" height="24" width="2%">&nbsp;</td>
    <td height="24" width="2%">&nbsp;</td>
    <td width="3%" height="24">&nbsp;</td>
  </tr>
  <tr> 
    <td height="24" colspan="10">&nbsp;</td>
  </tr>
  <tr> 
    <td colspan="10" height="66"> 
      <div align="left"> 
        <p align="center"><font size="1" face="Arial, Helvetica, sans-serif"> 
          <br>
          &copy; Copyright <a href="http://www.eitig.com" target="_parent">eitig.com</a> 
          1999-2000<br>
          Resoluci&oacute;n recomendada: 800 x 600</font><br>
          <font size="1" face="Arial, Helvetica, sans-serif"><a href="mailto:webmaster@eitig.com">webmaster@eitig.com</a> 
          </font> </p>
      </div>
    </td>
  </tr>
</table>
</body>
</html>
