<chapter>
        <title>Uso de los programas</title>

        <para>Ahora que ya tenemos todo instalado, aprendamos a ver nuestros DVDs con
        todos los programas que hemos instalado. Luego, t&uacute; eliges cu&aacute;l te gusta m&aacute;s o cu&aacute;l
        te funciona mejor.</para>

        <sect1>
                <title>xine</title>

                <para><emphasis>Xine</emphasis> es un programa bastante completo. Nos va a permitir
                reproducir DVDs, discos de audio, archivos de v&iacute;deo de varios formatos... Veamos c&oacute;mo
                debemos usarlo para ver nuestros DVDs.</para>

                <para>Lo primero que hay que hacer es arrancar las X si es que no las estamos usando ya.
                Anteriormente, en la instalaci&oacute;n ya lo configuramos todo adecuadamente. As&iacute; que ahora
                arrancaremos el programa con el comando <emphasis>xine</emphasis>.</para>

                <screen>
<prompt>$ </prompt><userinput>xine</userinput>
                </screen>

                <para>Si usamos KDE, y especificamos en la configuraci&oacute;n <emphasis>oss</emphasis> como
                demonio de sonido, podemos tener problemas y xine decirnos que fall&oacute; al intentar inicializar
                el audio (para ver esto arrancaremos xine desde una xterm o similar). Si pusimos arts
                como demonio de sonido y funciona, pues perfecto. Para comprobar los  formatos de sonido
		disponibles, miraremos la salida de <userinput>xine --help</userinput> y buscaremos
		en la secci&oacute;n de audio, donde nos aparecer&aacute;n los formatos que xine soporta
		en nuestro sistema. Si en la compilaci&oacute;n
                no a&ntilde;adimos <emphasis>arts</emphasis> o el soporte para este demonio no se compil&oacute; adecuadamente,
                deberemos matar el demonio de sonido de KDE y a continuaci&oacute;n iniciar xine:</para>

                <screen>
<prompt>$ </prompt><userinput>ps -aux | grep arts</userinput>
<prompt>usuario    535  0.4  1.7  6760 4384 ?        S    14:05   0:24 /usr/bin/artsd -F 10 -S 4096 -a oss -s 60 -m artsmessage -l 3 -f
usuario   1133  0.0  0.2  1672  688 pts/1    S    15:45   0:00 grep arts</prompt>
<prompt>$ </prompt><userinput>kill 535</userinput>
<prompt>$ </prompt><userinput>xine</userinput>
                </screen>
		
		<para>Si tenemos soporte para Arts o Esd, podemos elegirlo al iniciar xine, 
		por ejemplo: <userinput>xine -A arts</userinput>. Esto sobreescribir&aacute; a lo que tengamos
		en nuestro fichero de configuraci&oacute;n, y puede sernos &uacute;til para probar si podemos
		sacar el audio por el demonio de nuestro escritorio, cambiando en ese caso el fichero de configuraci&oacute;n
		apropiadamente.</para>

		<mediaobject>
			<imageobject>
				<imagedata fileref="xine1.png" scale="50" align="center" format="PNG"/>
			</imageobject>

			<textobject>
                <phrase>Pantalla principal de xine.</phrase></textobject></mediaobject>

                <para>Como vemos en la imagen, al ejecutar xine veremos la pantalla principal donde se nos
                mostrar&aacute; el v&iacute;deo y el panel de controles. Si pinchamos con el bot&oacute;n derecho en la pantalla principal
                desaparecer&aacute; el panel de controles y si volvemos a pinchar con el mismo bot&oacute;n volver&aacute; a aparecer. Puede
                ser &uacute;til cuando todos los ajustes est&eacute;n hechos y queramos relajarnos para ver nuestra pel&iacute;cula.</para>

                <para>En el panel de controles apreciamos en la parte central una serie de cuadros: NAV, VCD, DVD, CDA...
                Insertamos nuestro DVD. Esperamos unos 10 segundos y pinchamos, en contra de lo que pueda parecer, en el
                cuadro que pone <emphasis>NAV</emphasis> y <emphasis>NO en el que pone DVD</emphasis>. Una vez que hemos
                presionado el bot&oacute;n
                de NAV, podemos pulsar el bot&oacute;n <emphasis>Play</emphasis> que se encuentra en el c&iacute;rculo de botones de la
                derecha del panel de controles. El DVD se empezar&aacute; a reproducir. Ahora podemos cambiar varias cosas:</para>

                <para>
                <itemizedlist>
                        <listitem>
                                <para><emphasis>Idioma del audio</emphasis>: Justo encima de los cuadros NAV, VCD... tenemos
                                una zona que pone <emphasis>AUD</emphasis> y pegando, justo a su izquierda, dos flechas, una
                                hacia arriba y otra hacia abajo. Pinchando en ellas cambiaremos el idioma del audio entre los
                                disponibles.</para>
                        </listitem>
                        <listitem>
                                <para><emphasis>Subt&iacute;tulos</emphasis>: A la derecha de donde hemos visto AUD, tenemos otras
                                dos flechas y al lado pone <emphasis>SUB</emphasis>. Por defecto los subt&iacute;tulos estar&aacute;n desactivados.
                                Con esas dos flechas arriba y abajo podremos cambiar entre los idiomas de subt&iacute;tulos disponibles
                                o bien desactivarlos.</para>
                        </listitem>
                        <listitem>
                                <para><emphasis>Nivel de volumen</emphasis>: A la derecha de donde pone SUB, tenemos el control
                                del volumen. Mateniendo pinchado el rat&oacute;n sobre las l&iacute;neas y bajando o subiendo, podemos ajustar
                                el volumen.</para>
                        </listitem>
                        <listitem>
                                <para><emphasis>Pantalla completa</emphasis>: Si tenemos activa la ventana de salida de v&iacute;deo de
                                xine, y presionamos la tecla 'F', pasar&aacute; a pantalla completa, y si volvemos a pulsar 'F' volver&aacute;
                                a la ventana normal.</para>
                        </listitem>
                        <listitem>
                                <para><emphasis>Avance y Retroceso</emphasis>: En la parte superior del panel de controles tenemos la
                                barra del tiempo de la pista actual. Podemos movernos en ella para ir a cualquier parte de la pista
                                actual del DVD. Al lado del bot&oacute;n de Play tenemos los botones para avanzar a la pista siguiente y volver
                                a la anterior.</para>
                        </listitem>
                </itemizedlist>
                </para>

                <para>Xine tiene algunas posibilidades m&aacute;s. La verdad es que es un gran software. Investiga con &eacute;l y ver&aacute;s que puedes
                reproducir VideoCDs, DivX, MPEG, audio, streaming...</para>
        </sect1>

<sect1>
                <title>Ogle</title>

                <para>Como veremos <emphasis>Ogle</emphasis> es un programa muy
                sencillo, que nos permitir&aacute; reproducir nuestros
                DVDs.</para>

                <para>Es tan sencillo que s&oacute;lo tiene dos opciones;
                ejecutarlo con <prompt>-u gui</prompt> o sin ella: <prompt>-u
                cli</prompt> en ambos casos va seguido del path en el caso de que
                no sea el predeterminado.</para>

                <para>Un problema que se puede plantear es que ogle no encuentre la
                librer&iacute;a para desencriptar el DVD, pues no pasa nada, hacemos lo
                siguiente (como root, y en este caso es una m&aacute;quina Debian):</para>

                <screen>
<prompt>usuario@m&aacute;quina:#</prompt><userinput> ln -s /usr/lib/libdvdcss.so.&lt;&gt; /usr/lib/ogle/libdvdcss.so.0</userinput>
                </screen>

                <para>En el siguiente cap&iacute;tulo se explica como rippear un DVD
                al disco duro, bueno pues la utilidad est&aacute; aqu&iacute;, si en vez de
                dejar que ogle reproduzca el path predeterminado
                <prompt>/dev/dvd</prompt>, le decimos que lo haga en el
                directorio donde dejamos la copia del DVD (con los archivos .nfo)
                tambi&eacute;n podremos reproducirlo</para>

                <para>Bueno, vamos al programa en s&iacute;</para>

                <mediaobject>
			<imageobject>
				<imagedata fileref="panel_ogle.png" scale="50" align="center" format="PNG"/>
			</imageobject>

			<textobject>
                <phrase>Panel de ogle, bien
                sencillito.</phrase></textobject>
                </mediaobject>

                <para>Esto es lo que sale al iniciar ogle con soporte de
                gui. Ahora solo tenemos que darle a File -&gt; Open
                Disc. Y una vez haya explorado el DVD para ver los
                cap&iacute;tulos, empezar&aacute; la
                reproducci&oacute;n del mismo.</para>
		
		<!-- Comento esto porque ya se ha especificado en la seccion de configuracion detenidamente (lical)

                <tip><para>Los usuarios de debian deben activar el soporte
                DMA <emphasis>dma</emphasis> ya que por defecto no
		viene activado</para></tip>
		
		-->

                <!-- added (lical), a ver si te gusta -->
                <para>Como puedes ver en la imagen anterior, el panel de controles gr&aacute;fico de Ogle no es
                en absoluto dif&iacute;cil de usar. Una vez que hayas comenzado la reproducci&oacute;n del DVD,
                podr&aacute;s cambiar entre los idiomas de audio y los subt&iacute;tulos disponibles, entre varias otras
                opciones. Podemos apreciar varios grupos de botones. El que nos interesa para cambiar estas
                opciones es el grupo de cuatro botones que est&aacute; m&aacute;s a la derecha del panel. Ah&iacute; tenemos,
                de izquierda a derecha y de arriba a abajo:</para>

                <para>
                <itemizedlist>
                        <listitem>
                                <para><emphasis>Selecci&oacute;n de men&uacute;:</emphasis> Nos permite seleccionar un men&uacute;
                                si el disco que estamos reproducciendo dispone de ellos.</para>
                        </listitem>
                        <listitem>
                                <para><emphasis>Selecci&oacute;n de idioma del audio:</emphasis> Elegiremos un idioma
                                de audio entre los que nos ofrece el disco DVD.</para>
                        </listitem>
                        <listitem>
                                <para><emphasis>Selecci&oacute;n de subt&iacute;tulos:</emphasis> Elegimos el idioma de los
                                subt&iacute;tulos entre los disponibles.</para>
                        </listitem>
                        <listitem>
                                <para><emphasis>Selecci&oacute;n de &aacute;ngulo:</emphasis> Rara vez esto es posible, pero
                                cuando lo sea, usaremos este bot&oacute;n para cambiarlo.</para>
                        </listitem>
                        <listitem>
                                <para>El bot&oacute;n <emphasis>Chapters</emphasis> a la derecha del grupo anterior
                                sirve para cambiar de pista del disco.</para>
                        </listitem>
                </itemizedlist>
                </para>

                <para>El funcionamiento de los botones del grupo izquierdo es m&aacute;s que obvio :-). Pasaremos
                a pantalla completa bien con el men&uacute; <emphasis>View</emphasis> o con <emphasis>Ctrl+F</emphasis>,
                combinaci&oacute;n con la que volveremos al modo de ventana normal.</para>

                <para>Ogle tiene algunas otras funcionalidades que generalmente no se suelen usar. Puedes explorar
                el resto de botones del panel de controles por si alguna de estas funciones te es &uacute;til.</para>
                <!-- Fin de mi parte (lical) de adds a ogle -->

		<!-- LICAL: Comento esto tambien porque se supone que si se esta aqui ya se cumplen los requisitos
		puesto que la instalacion se detallo detenidamente en el capitulo anterior

                <para>Ahora s&oacute;lo falta que hag&aacute;is caso a la parte de
                instalaci&oacute;n de las librer&iacute;as que instal&eacute;is ogle
                y a ver pel&iacute;culas</para>

		/LICAL -->

<!-- Ya no falta explicacion en modo cli con las teclas -->
                <para>Tambi&eacute;n podemos usar nuestro teclado para manejar <emphasis>Ogle</emphasis> en modo cli, esto
		es, comenzamos la reproducci&oacute;n sin la GUI.</para>

                        <itemizedlist>
                                <listitem>
                                        <para>
                                        <prompt>&quot;,&quot; (coma)</prompt>--&gt; Bajamos la velocidad de reproducci&oacute;n
                                        , vaya c&aacute;mara lenta. La pel&iacute;cula quedar&aacute; en <emphasis>mute</emphasis>
                                        </para>
                                </listitem>
                                <listitem>
                                        <para>
                                        <prompt>&quot;p&quot;</prompt>--&gt; Play
                                        </para>
                                </listitem>
                                <listitem>
                                        <para>
                                        <prompt>&quot;.&quot; (punto)</prompt>--&gt; Reproducci&oacute;n a camara r&aacute;pida
                                        </para>
                                </listitem>
                                <listitem>
                                        <para>
                                        <prompt>&quot; &quot;(Espacio)</prompt>--&gt; Pausa
                                        </para>
                                </listitem>
                                <listitem>
                                        <para>
                                        <prompt>&quot;&gt;&quot;</prompt>--&gt; Siguiente Cap&iacute;tulo
                                        </para>
                                </listitem>
                                <listitem>
                                        <para>
                                        <prompt>&quot;&lt;&quot;</prompt>--&gt; Cap&iacute;tulo anterior
                                        </para>
                                </listitem>
                                <listitem>
                                        <para>
                                        <prompt>&quot;c&quot;</prompt>--&gt; Si hemos pasado de la pel&iacute;cula al men&uacute;
                                        podemos volver al mismo sitio pulsando &quot;<emphasis>c</emphasis>&quot;.
                                        </para>
                                </listitem>
                                <listitem>
                                        <para>
                                        <prompt>&quot;q&quot;</prompt>--&gt; Sale de <emphasis>Ogle</emphasis>
                                        </para>
                                </listitem>
                                <listitem>
                                        <para>
                                        <prompt>&quot;f&quot;</prompt>--&gt; Activa o desactiva el modo de <emphasis>pantalla completa</emphasis>
                                        </para>
                                </listitem>
                                <listitem>
                                        <para>
                                        <prompt>&quot;t&quot;</prompt>--&gt; Pasamos al men&uacute;.
                                        </para>
                                </listitem>
                                <listitem>
                                        <para>
                                        <prompt>&quot;r&quot;</prompt>--&gt; Pasamos al men&uacute; principal.
                                        </para>
                                </listitem>
                                <listitem>
                                        <para>
                                        <prompt>&quot;a&quot;</prompt>--&gt; As&iacute; vamos al men&uacute; de audio
                                        </para>
                                </listitem>
                                <listitem>
                                        <para>
                                        <prompt>&quot;A&quot;</prompt>--&gt; Men&uacute; de &aacute;ngulos disponibles
                                        </para>
                                </listitem>
                                <listitem>
                                        <para>
                                        <prompt>&quot;i&quot;</prompt>--&gt; Podremos guardar una impresion de pantalla en
                                        cualquier momento
                                        </para>
                                </listitem>
                          </itemizedlist>

        </sect1>

        <sect1>
                <title>Mplayer</title>
                <para>Bueno esto si que es una maravilla de programa, lo reproduce
                        todo, para aquellos que dicen que Linux no es multimedia que miren
                        este programa que aun siendo una beta... vamos que es
                        muy bueno. Pues empecemos, que s&iacute; que tiene miga.
                </para>
                <para>Tipos de reproducci&oacute;n:
                </para>
                <itemizedlist>
                <listitem>
	                <para><userinput>-dvd &lt;id&gt;</userinput> Para ver los DVDs, por
	                        otra parte es el prop&oacute;sito fundamental de este
	                        COMO. <prompt>&lt;id&gt;</prompt> le dice a
	                        <emphasis>mplayer</emphasis> por d&oacute;nde tiene que empezar a
	                        reproducir</para>
	                        <para>Por lo que para reproducir un DVD el comando
	                        b&aacute;sico ser&iacute;a:
                         </para>
                                <para>
                                <prompt>usuario@m&aacute;quina:$ </prompt><userinput> mplayer -dvd 1</userinput>
                                </para>
                </listitem>
                <listitem>
	                <para><userinput>-vcd &lt;track&gt;</userinput> Para reproducir
	                        v&iacute;deo CD. <prompt>&lt;track&gt;</prompt> indicamos la pista 1
	                        por defecto.
                         </para>
                </listitem>
                <listitem>
	                <para><userinput>-cdda &lt;opciones&gt;</userinput> Para reproducir
	                        un CD de audio.
                         </para>
                </listitem>
                <listitem>
	                <para><userinput>-tv</userinput> Para uso de nuestra flamante
	                        targeta de televisi&oacute;n
                         </para>
                </listitem>
                <listitem>
	                <para><emphasis>Stream</emphasis> para ver v&iacute;deos a
	                        trav&eacute;s de inet. El comando ser&iacute;a:
	                        <screen><userinput>mplayer http://direccion/del/video</userinput></screen>
                         </para>
                </listitem>

                </itemizedlist>
                        <para>Y hay m&aacute;s cosas, pero esto es un VideoDVD-Linux-COMO, no un manual de
                                mplayer (pero todo se andar&aacute;)
                        </para>
                        <para>Ahora veamos al &quot;animal&quot; en plena
                                acci&oacute;n
                        </para>
                <mediaobject>
			<imageobject>
				<imagedata fileref="mplayer2.png" scale="40" align="center" format="PNG"/>
			</imageobject>

			<textobject>
                        <phrase>No se ve mal, la escena es
                                as&iacute;
                        </phrase>
                        </textobject>
                </mediaobject>
                        <para>Veamos m&aacute;s de cerca el frontal, pero que quede
                                claro que ahora estamos usando
                                <emphasis>mplayer</emphasis> con la opci&oacute;n
                                gui.
                        </para>
                <mediaobject>
			<imageobject>
				<imagedata fileref="mplayer1.png" scale="40" align="center" format="PNG"/>
			</imageobject>
			<textobject>
                        <phrase>Pues aqu&iacute; tenemos la botonera m&aacute;s
                                cerca
                        </phrase>
                        </textobject>
                </mediaobject>
                <para>Para reproducir un DVD aqu&iacute; es f&aacute;cil, mira las opciones
                        pulsando sobre la ventana con el boton derecho del
                        rat&oacute;n.
                </para>

		<para><emphasis>Opciones b&aacute;sicas en l&iacute;nea de comandos</emphasis></para>

               	<itemizedlist>
               	<listitem>
                       	<para>
                       	<userinput>-dvd &lt;identificador de t&iacute;tulo&gt;</userinput> Es la opci&oacute;n m&aacute;s importante
                       	que le debemos pasar a <emphasis>mplayer</emphasis> (recordemos el nombre de este COMO una vez m&aacute;s ;-)). S&oacute;lo un
                       	problema, no todos los DVDs empiezan en el mismo sitio (y esto no tiene auto-detecci&oacute;n, !!!que no es
                       	wintanucos¡¡¡¡ :-P) por lo que puede que haya que investigar, de todos modos la mayor&iacute;a empieza en <emphasis>1</emphasis>.
                       	</para>
               	</listitem>
               	<listitem>
                       	<para>
                       	<userinput>-alang xx</userinput> Asi elegimos el idioma las <emphasis>xx</emphasis> son el c&oacute;digo
                       	del pa&iacute;s en nuestro caso <emphasis>es</emphasis>.
                       	</para>
               	</listitem>
               	<listitem>
                       	<para>
                       	<userinput>-chapter &lt;chapter id&gt;[-&lt;end chapter id&gt;]</userinput> Podemos reproducir a partir de un
                       	cap&iacute;lo con <emphasis>-chapter id</emphasis> siendo <emphasis>id</emphasis> el n&uacute;mero del cap&iacute;tulo.
                       	o reproducir una serie de cap&iacute;tulos con <emphasis>-chapter &lt;chapter id&gt; -&lt;end chapter id&gt;</emphasis>
                       	siendo los id's correspondientes el principio y el final.
                       	</para>
               	</listitem>
               	<listitem>
                       	<para>
                       	<userinput>-csslib</userinput> Si por lo que sea no hemos puesto la librer&iacute;a libdvdcss &quot;en su sitio&quot;
                       	le podemos decir d&oacute;nde est&aacute; con esta opci&oacute;n.
                       	</para>
               	</listitem>
               	<listitem>
                       	<para>
                       	<userinput>-dvd-device &lt;dispositivo&gt;</userinput> Bueno, si no has hecho lo que se te recomend&oacute; el linkado
                       	de la unidad de DVD pues mplayer no la encontrar&aacute; pues le decimos que est&aacute; en otro sitio como por ej.
                       	<emphasis>-dvd-device /dev/hdloquesea</emphasis>.
                       	</para>
               	</listitem>
               	<listitem>
                       	<para>
                        <userinput>-dvdangle &lt;identificador del &aacute;ngulo&gt;</userinput> De todos es sabida la cantidad de
                        &quot;chorradas&quot; que tiene un DVD, pues con esta opci&oacute;n podemos visionar la pel&iacute;cula
		 	desde un &aacute;ngulo distinto si la escena nos ofrece esta posibilidad.
                        <!--Ahora lo que no me explico es como cambiar de angulo durante la reproduccion || Esto rara vez es posible, yo tampoco se como (lical) -->
                       	</para>
               	</listitem>
               	<listitem>
                       	<para>
                       	<userinput>-dvdnav</userinput> Forzamos el uso de libdvdnav por lo que obtenemos los menus del DVD.
                       	</para>
               	</listitem>
               	<listitem>
                       	<para>
                       	<userinput>-x &lt;x&gt;</userinput> Para escalar el visionado de la pel&iacute;cula (claro est&aacute;, cuando sea posible).
                       	Esto es el ancho
                       	</para>
               	</listitem>
               	<listitem>
                       	<para>
                       	<userinput>-y &lt;y&gt;</userinput> Lo mismo pero para el alto.
                       	</para>
               	</listitem>
               	<listitem>
                       	<para>
                       	<userinput>-fs</userinput> Bien, ahora que ya has intentado ver la pel&iacute;cula escalando con las opciones
                       	anteriores, y no sabes que medidas poner para ver a pantalla completa (no ha funcionado ni poniendole la medida
                       	en cuartas jeje) usa esta opci&oacute;n.
                       	</para>
               	</listitem>
                <listitem>
                       	<para>
                       	<userinput>-xy &lt;x&gt;</userinput> Podemos usar esta opci&oacute;n para escalar la imagen, de esta manera
                       	tomar&aacute; el valor de <emphasis>x</emphasis> y le dar&aacute; a <emphasis>y</emphasis> un valor l&oacute;gico
                       	para un visionado correcto
                       	</para>
                </listitem>
                <listitem>
                       	<para>
                       	<userinput>-slang &lt;c&oacute;digo del pa&iacute;s&gt;</userinput> As&iacute; elegiremos los subt&iacute;tulos que queremos (es necesario haber
                       	instalado las fuentes).
                       </para>
                </listitem>
                <listitem>
                       	<para>
                       	<userinput>-sub &lt;archivo&gt;</userinput> Para indicar el archivo que contiene los subt&iacute;tulos. Esto no suele
			ser necesario.
                       	</para>
                </listitem>
                <listitem>
                       	<para>
                       	<userinput>-subcp &lt;p&aacute;gina de c&oacute;digos</userinput> Si es posible podemos definir la codificaci&oacute;n
                       	de los caracteres. Ej <emphasis>cp850</emphasis>
                       	</para>
                </listitem>
                <listitem>
                       	<para>
                       	<userinput>-subdelay &lt;seg&gt;</userinput> Si, por ejemplo, los subt&iacute;tulos van desfasados con respecto al audio
                       	podemos hacer que salgan un poco m&aacute;s tarde indicandole el tiempo en segundos.
                       	</para>
                </listitem>
                <listitem>
                       	<para>
                       	<userinput>-ao</userinput> Podemos especificar el driver de salida. Para ver los que ten&eacute;is en el sistema <emphasis>mplayer -ao help</emphasis>
                       	</para>
                </listitem>
                <listitem>
                       	<para>
                       	<userinput>-delay &lt;seg&gt;</userinput> Lo mismo que hac&iacute;amos con los subt&iacute;tulos (el retrasar). Si vemos que
                       	hay desfase con la imagen pues viene perfecto.
                       	</para>
                </listitem>

                </itemizedlist>

   		<para>Estas son las opciones m&aacute;s &uacute;tiles a la hora de ver un DVD.
   		</para>
   		<para>Con lo que un comando para ver un DVD podr&iacute;a ser:</para>

		<para><prompt>usuario@maquina $</prompt><userinput>mplayer -fs -dvd-device /dev/hdc -dvd 1 -alang es -slang en</userinput></para>

		<para><emphasis>Mplayer</emphasis> es un programa con much&iacute;simas opciones (y much&iacute;simos usos). Ya lo comentamos,
   		<emphasis>mplayer</emphasis> ahora mismo es una beta, cuando este programa llegue a su m&aacute;ximo desarrollo nadie podr&aacute;
  		 decir que GNU/Linux no es apto para la <emphasis>multimedia</emphasis>.
   		</para>

   		<!-- LICAL adds -->
   		<para>Otra posibilidad que tenemos, es iniciar mplayer (en modo gr&aacute;fico), y acceder a los men&uacute;s que tambi&eacute;n
   		nos ofrece en modo gr&aacute;fico sin necesidad de tener que indicar algunas opciones en la l&iacute;nea de comandos. Por ejemplo,
   		si pulsamos el bot&oacute;n central del rat&oacute;n en la ventana de visionado, aparecer&aacute; un men&uacute; con diversas opciones,
   		muy parecido al que sale si presionamos el bot&oacute;n derecho en la misma pantalla. Otro consejo &uacute;til desde la GUI, es que si
   		presionamos la tecla F teniendo activa la ventana de salida de v&iacute;deo, pasaremos al modo de pantalla completa, y si
   		lo volvemos a presionar, volveremos al modo de ventana normal. Un &uacute;ltimo consejo. Aunque generalmente suele ocultarse solo,
   		podemos minimizar el panel de controles de modo que nos lo quitemos de vista :-) presionando el bot&oacute;n de m&aacute;s a la
   		izquierda de los dos localizados en la esquina superior derecha de este panel de controles.</para>
		<!-- /LICAL adds -->

   		<para>Si es necesario tambi&eacute;n podemos cambiar la zona del DVD con <emphasis>regionset tool</emphasis> que viene
   		con <emphasis>mplayer</emphasis>.</para>

		<!-- recordatorio general, no solo para Debian (lical)-->
		<tip><para>Debes recordar tener activado el <emphasis>DMA</emphasis> en tu DVD con <emphasis>hdparm</emphasis></para></tip>

		<para>Bueno, esto es suficiente para que podais ver vuestros DVDs en GNU/Linux. Que lo disfruteis</para>
   		<!--Si quereis que lo complete mas pongo mas cosas(esta hecho en papel) pero creo que demomento va bien || Creo que esta de P.M. :-) (lical)-->
     </sect1>
</chapter>

