<chapter>
        <title>Inicio</title>

        <para>En esta primera secci&oacute;n vamos a detallar a qui&eacute;n va dirigido este documento, qu&eacute;
        necesitas para poder reproducir DVDs en Linux, y una peque&ntilde;a introducci&oacute;n a las secciones
        posteriores.</para>

        <sect1>
                <title>&iquest;A qui&eacute;n va dirigido este documento?</title>

                <para>Este COMO va dirigido a usuarios que tengan unos ciertos conocimientos b&aacute;sicos
                del uso de un sistema Linux:</para>

                <para>
                <itemizedlist>
                        <listitem>
                          <para>Moverse un poco por el shell BASH</para>
                        </listitem>
                        <listitem>
                          <para>Conocer el concepto de un enlace simb&oacute;lico</para>
                        </listitem>
                        <listitem>
                          <para>Saber la tarjeta de sonido que se tiene y algo sobre el sonido en Linux</para>
                        </listitem>
                        <listitem>
                          <para>Saber la tarjeta de v&iacute;deo que se tiene y saber instalarle la aceleraci&oacute;n gr&aacute;fica si fuera necesario</para>
                        </listitem>
                </itemizedlist>
                </para>

                <para>No obstante, os recomendamos que poste&eacute;is las dudas en <ulink url='http://www.zonasiete.org/foro'>
                el foro de ZonaSiete</ulink>, donde intentaremos ayudaros :-)</para>

                <para>En este COMO no est&aacute;n cubiertos los conjuntos DVD-Tarjeta decodificadora. Si sabes hacerlos funcionar, puedes
                colaborar con nosotros para mejorar el documento</para>
        </sect1>

        <sect1>
                <title>Requisitos m&iacute;nimos aproximados de hardware</title>

                <para>La reproducci&oacute;n de discos DVD es por naturaleza una actividad que consume muchos recursos. Piensa que
                una pel&iacute;cula puede ocupar unos 3 GB en el disco DVD, y que adem&aacute;s de extraer toda esa informaci&oacute;n en el tiempo
                que dura la pel&iacute;cula para que la reproducci&oacute;n no se atrase, tiene que ser decodificada; el v&iacute;deo tiene que ser procesado
                y separado del sonido. Es una tarea en la que interviene nuestro microprocesador, la memoria RAM,
                el lector DVD, la tarjeta de v&iacute;deo y la tarjeta de sonido. Como puedes ver, son casi todos los componentes de nuestro
                PC los que intervienen.</para>

                <para>Ser&iacute;a importante que cerrasemos aplicaciones que consuman muchos recursos para evitar una reproducci&oacute;n con
                peque&ntilde;as congelaciones de imagen.</para>

                <para>Es importante tener nuestra tarjeta de sonido funcionando correctamente. Deberemos tambi&eacute;n tener los mejores controladores
                disponibles para nuestra tarjeta de v&iacute;deo, la cual es un componente muy importante en esta tarea. Por ejemplo, si el fabricante,
                como en el caso de NVidia, proporciona drivers para Linux que permiten la aceleraci&oacute;n gr&aacute;fica, nuestro primer deber es instalarlos
                correctamente</para>

                <para>El hardware que necesitamos para ver DVDs es relativo a muchos factores, aunque a grandes rasgos podr&iacute;a ser algo como esto:</para>

                <para>
                <itemizedlist>
                        <listitem>
                                <para>Un microprocesador a al menos 450 MHz</para>
                        </listitem>
                        <listitem>
                                <para>M&iacute;nimamente 128 MB de RAM</para>
                        </listitem>
                        <listitem>
                                <para>Un lector DVD</para>
                        </listitem>
                        <listitem>
                                <para>Una tarjeta de sonido</para>
                        </listitem>
                        <listitem>
                                <para>Tarjeta de v&iacute;deo con al menos 8 MB de memoria de v&iacute;deo.</para>
                        </listitem>
                </itemizedlist>
                </para>

                <para>Es probable que necesites una tarjeta de v&iacute;deo mejor, aunque se puede reproducir el DVD con menos calidad con una tarjeta probre
                con algunos de los programas que explicamos en este documento.</para>

                <para>Algunos programas requieren tener una versi&oacute;n de XFree igual o superior a la 4.1. Adem&aacute;s, para los programas que no la requieren es
                igualmente recomendable.</para>
        </sect1>
</chapter>