<chapter>
        <title>Requisitos previos de configuraci&oacute;n y descargas</title>

        <sect1>
                <title>Enlaces simb&oacute;licos</title>

                <para>Los programas con los que vamos a trabajar, buscar&aacute;n nuestro lector de discos
                DVD en <prompt>/dev/dvd</prompt>. Bien, pues hagamos un enlace simb&oacute;lico desde el
                dispositivo real de nuestro lector DVD a <prompt>/dev/dvd</prompt>. Si es IDE, lo m&aacute;s probable es que
                sea /dev/cdrom, mientras que si es SCSI (o emulado a SCSI), es muy probable que sea
                <prompt>/dev/sr0</prompt>, <prompt>/dev/scd0</prompt> o algo por el estilo.
                Tienes que deterinar cu&aacute;l es tu lector. Entonces, iremos a una consola como root y,
                suponiendo que nuestro lector es /dev/cdrom, haremos:</para>

                <screen>
<prompt>root@maquina:/directorio/actual #</prompt>
<userinput>ln -s /dev/cdrom /dev/dvd</userinput>
                </screen>

		<para>Si en tu sistema est&aacute;s usando <prompt>devfs</prompt>, tendr&aacute;s que tenerlo en cuenta a la hora
		de hacer los enlaces al DVD, para enlazar al dispositivo correcto. Un ejemplo podr&iacute;a ser:</para>

		<screen>
<prompt>root@maquina:/directorio/actual #</prompt>
<userinput>ln -s /dev/cdroms/cdrom0 /dev/dvd</userinput>
		</screen>

                <para>Ya tenemos nuestro enlace simb&oacute;lico y los programas podr&aacute;n acceder a nuestro lector.</para>
        </sect1>

        <sect1>
                <title>Tarjeta de v&iacute;deo</title>

                <para>Como ya hemos dicho, nuestra tarjeta de v&iacute;deo debe estar trabajando en sus mejores condiciones
                y con el mejor controlador, que le permita usar la aceleraci&oacute;n gr&aacute;fica si es que dispone de ella.</para>
        </sect1>

        <sect1>
                <title>Tarjeta de sonido</title>

                <para>La tarjeta de sonido debe estar configurada. Necesitamos saber qu&eacute; sistema de sonido estamos usando
                (si no sabes de qu&eacute; estamos hablando, puedes asumir que est&aacute;s usando el sistema OSS solamente, OpenSoundSystem) para poder indic&aacute;rselo
                luego a los programas. Aunque si usas Gnome probablemente est&eacute;s usando <emphasis>eSound (esd)</emphasis>, y si usas
		KDE, <emphasis>Arts (arts)</emphasis></para>

                <para>Podr&iacute;amos tener alg&uacute;n problema porque los entornos de escritorio tales como KDE o Gnome usan su propio
                demonio de sonido y pueden a veces bloquearnos la tarjeta de sonido. Si vemos un problema de este tipo, mataremos
                el demonio que controla el sonido de nuestro entorno de escritorio; <emphasis>arts</emphasis> en KDE y <emphasis>eSound (ESD)</emphasis>
                en Gnome. No obstante intentaremos darle este dato a los programas en los ficheros de configuraci&oacute;n o a la hora de compilarlos
                para que intente sacar el audio por el demonio de sonido de nuestro escritorio.</para>
        </sect1>

	<sect1>
		<title>DMA</title>

		<para>En algunas distribuciones no tendremos DMA (opci&oacute;n para que el procesador no tenga que 'esperar' a que los datos le lleguen
		sino que &eacute;stos pasen directamente a la memoria cuando lleguen del dispositivo en cuesti&oacute;n) activado. DMA es una opci&oacute;n
		que necesitamos activar, as&iacute; que veamos c&oacute;mo se hace:</para>
		
		<para>En lectores IDE, o IDE emulados a SCSI (ide-scsi), el procedimiento es el que sigue. Primero, comprobamos
		si est&aacute; activado en nuestro lector. Necesitamos saber qu&eacute; posici&oacute;n ocupa y en qu&eacute; IDE; esto es,
		necesitamos saber su denominaci&oacute;n <prompt>/dev/hdX</prompt> (recuerda, incluso si es ide-scsi, usaremos /dev/hdX aqu&iacute;)
		, donde X es la posici&oacute;n. Si usamos <prompt>devfs</prompt>
		averiguaremos cu&aacute;l es nuestro lector, probaremos con el dispositivo de nuestro lector, y si no funcionase,
		con <prompt>/dev/hdX</prompt>. Una vez lo sepamos:</para>
		
		<screen>
<prompt>root@maquina:/directorio/actual #</prompt> <userinput>hdparm /dev/hdX</userinput>
<prompt>...
using_dma    =  1 (on)
...
</prompt>
		</screen>

		<para>Si tenemos <prompt>(on)</prompt> aqu&iacute;, ya hemos terminado con esta secci&oacute;n. Si no es as&iacute; tendremos que activarlo
		con el comando <userinput>hdparm -d1 /dev/hdX</userinput>. Tambi&eacute;n debemos poner esto en un script de inicio del sistema
		para que tengamos activo DMA en el DVD en cada inicio del sistema por defecto.</para>
	</sect1>

        <sect1>
                <title>Descarga de los paquetes necesarios</title>

                <para>Es recomendable compilar estos paquetes desde el c&oacute;digo fuente puesto que podremos ganar rendimiento y es muy
                posible que nos haga falta.</para>

                <para>Tambi&eacute;n tendremos que saber qu&eacute; es CSS. Es un sistema de encriptaci&oacute;n que llevan la mayor&iacute;a de los DVDs porque la industria
                del cine se ha empe&ntilde;ado en que los usuarios que compramos sus DVDs no los veamos en el PC... En fin, hay que agradecer al creador de
                DeCSS que nos va a permitir ver nuestros DVDs con Linux. Hay alg&uacute;n jaleo legal con este soft, m&aacute;s detalles en su web.</para>

                <para>Necesitaremos los siguientes paquetes (y alguno derivado de ellos): liba52, dvdnav, dvdread, DeCSS, xine, ogle, mplayer, lame:</para>

                <para>
                <itemizedlist mark='opencircle'>
                        <listitem>
                                <para><emphasis>liba52</emphasis>: Un decoder de audio, descargable desde <ulink url='http://liba52.sourceforge.net/downloads.html'>aqu&iacute;</ulink>.</para>
                        </listitem>
                        <listitem>
                                <para><emphasis>libdvdcss</emphasis>: La librer&iacute;a que nos permitir&aacute; ver los DVDs encriptados. Podremos
                                leer acerca de ella y descargarla en <ulink url='http://www.videolan.org/libdvdcss/download.html'>este enlace</ulink>.</para>
                        </listitem>
                        <listitem>
                                <para><emphasis>libdvdread</emphasis>: Esta es una librer&iacute;a que ofrece algunas funcionalidades para la lectura
                                de DVDs. Est&aacute; dentro del proyecto Ogle, y la buscaremos para descargar en <ulink url='http://www.dtek.chalmers.se/groups/dvd/downloads.shtml'>
                                esta url</ulink>.</para>
                        </listitem>
                        <listitem>
                                <para><emphasis>libdvdnav</emphasis>: Esta librer&iacute;a ofrece funcionalidades de cara a la reproducci&oacute;n de los DVDs que contienen men&uacute;s.
                                La descargaremos en <ulink url='http://dvd.sourceforge.net/'>este enlace</ulink>. Ah&iacute; tambi&eacute;n encontraremos el paquete <emphasis>xine_dvdnav</emphasis>
                                que aunque es posible que no lo necesitemos en futuras versiones, ahora necesitamos descargar junto con <emphasis>libdvdnav</emphasis></para>
                        </listitem>
                        <listitem>
                                <para><emphasis>Lame</emphasis> codificador de mp3 <ulink url='http://www.mp3dev.org/'>aqu&iacute;</ulink>.</para>
                        </listitem>
                        <listitem>
                                <para><emphasis>xine</emphasis>: Un software de reproducci&oacute;n muy completo. Deberemos descargar los paquetes xine-libs y xine-ui de
                                <ulink url='http://xine.sourceforge.net/'>esta direcci&oacute;n</ulink>.</para>
                        </listitem>
                        <listitem>
                                <para><emphasis>ogle</emphasis>: Otro soft de reproducci&oacute;n. En <ulink url='http://www.dtek.chalmers.se/groups/dvd/downloads.shtml'>esta p&aacute;gina</ulink>
                                descargaremos los paquetes <emphasis>ogle</emphasis> y <emphasis>ogle_gui</emphasis>. La interfaz gr&aacute;fica de este soft requiere libgtk y libglade en su sus
                                versiones -dev (de desarrollador). Si no quieres complicarte puedes intentar instalar estos paquetes con los paquetes de tu distribuci&oacute;n. Si esto
                                te ocasiona alg&uacute;n problema puedes probar con los otros programas de reproducci&oacute;n que explicamos.</para>
                        </listitem>
                        <listitem>
                                <para><emphasis>mplayer</emphasis>: Un soft de reproducci&oacute;n m&aacute;s :-) que descargaremos de <ulink url='http://www.mplayerhq.hu/homepage/'>aqu&iacute;</ulink>.
                                Necesitaremos tambi&eacute;n unas fuentes para los subtitulos (el primer paquete de la lista de fuentes de la p&aacute;gina de descargas puede
                                valernos), y un skin para el interfaz gr&aacute;fico de mplayer. Descargaremos cualquiera de ellos, aunque el <emphasis>Default</emphasis> es el m&aacute;s com&uacute;n.
                                Adem&aacute;s tambi&eacute;n necesitamos descargar los <emphasis>win32 c&oacute;decs</emphasis> de la misma web, que nos
                                servir&aacute;n simplemente para rippear DVDs como m&aacute;s adelante vamos a ver.</para>
                        </listitem>
                </itemizedlist>
                </para>

                <para>Puede que estos programas tengan alguna dependencia con otras librer&iacute;as. Podremos verlo en las p&aacute;ginas webs correspondientes, aunque con una instalaci&oacute;n
                general no deber&iacute;a faltarnos nada. Si nos falta, instalaremos estos paquetes desde los discos de nuestra distribuci&oacute;n o desde mirrors de Internet, no ser&aacute; necesario que las compilemos.</para>
        </sect1>
</chapter>
