olea/LuCAS-cvs/web-pameli/man/man8/fsck.minix.8
.\" Copyright 1992, 1993, 1994 Rickard E. Faith (faith@cs.unc.edu)
.\" May be freely distributed.
.\" 
.\" Translated into Spanish on Fri Jul 24 1998 by Gerardo Aburruzaga
.\" García <gerardo@cica.es>
.\"
.\" " for hilit19
.TH FSCK 8 "2 Julio 1996" "Util-Linux 2.6" "Manual del Programador de Linux"
.SH NOMBRE
fsck.minix \- un comprobador de consistencia de sistemas de ficheros
Minix para Linux
.SH SINOPSIS
.B "fsck.minix [ \-larvsmf ]"
dispositivo
.SH DESCRIPCIÓN
.B fsck.minix
realiza una comprobación de consistencia para el sistema de ficheros
MINIX de Linux. La versión actual admite las opciones de nombre de
fichero de 14 caracteres y de 30 caracteres.

El programa supone que el sistema de ficheros está inactivo.
.\" quiescent
.B fsck.minix
no debería emplearse en un dispositivo montado a menos que Ud. esté
seguro de que nadie está escribiendo en él (y recuerde que el núcleo
puede escribir en él cuando busca ficheros).

El dispositivo tendrá usualmente la forma siguiente:
.nf
.RS
/dev/hda[1-63] (disco IDE 1)
/dev/hdb[1-63] (disco IDE 2)
/dev/sda[1-15] (disco SCSI 1)
/dev/sdb[1-15] (disco SCSI 2)
.RE
.fi

Si el sistema de ficheros sufrió algún cambio (esto es, fue reparado),
entonces
.B fsck.minix
mostrará la frase "FILE SYSTEM HAS CHANGED" ("el sistema de ficheros
ha cambiado") y hará un
.BR sync (2)
tres veces antes de salir. Puesto que Linux actualmente no tiene
dispositivos "crudos", 
.I no
hay necesidad de rearrancar en este momento (lo contrario de un
sistema que
.I sí
tenga dispositivos "crudos").
.SH AVISO
.B fsck.minix
.B no
debería emplearse en un sistema de ficheros montado. Usar
.B fsck.minix
en un sistema de ficheros montado es muy peligroso, debido a la
posibilidad de que ficheros borrados estén todavía en uso, ¡y se puede
dañar seriamente un sistema de ficheros en perfecto estado! Si
Ud. tiene la absoluta necesidad de ejecutar
.B fsck.minix
en un sistema de ficheros montado (i.e., el sistema de ficheros raíz),
asegúrese de que nada está escribiendo en el disco, y que no hay
ficheros "zombis" esperando su borrado.
.SH OPCIONES
.TP
.B \-l
Lista todos los nombres de fichero
.TP
.B \-r
Efectúa reparaciones interactivas
.TP
.B \-a
Efectúa reparaciones automáticas (esta opción implica
.BR \-r ),
y sirve para contestar todas las preguntas con la respuesta
predeterminada. Observe que esto puede ser extremadamente peligroso en
el caso de daños extensos en el sistema de ficheros.
.TP
.B \-v
Prolijo
.TP
.B \-s
Muestra información del súper-bloque
.TP
.B \-m
Activa los avisos al estilo de MINIX "modo no limpiado"
.TP
.B \-f
Fuerza la comprobación del sistema de ficheros incluso si el sistema
de ficheros fue marcado como válido (esta marca la hace el núcleo
cuando el sistema de ficheros se desmonta).
.SH "VÉASE TAMBIÉN"
.BR fsck (8),
.BR fsck.ext (8),
.BR fsck.ext2 (8),
.BR fsck.xiafs (8),
.BR mkfs (8),
.BR mkfs.minix (8),
.BR mkfs.ext (8),
.BR mkfs.ext2 (8),
.BR mkfs.xiafs (8).
.BR reboot (8)
.SH DIAGNÓSTICOS
Hay numerosos mensajes de diagnóstico. Los mencionados aquí son los
más comúnmente vistos en el uso normal.

Si el dispositivo no existe,
.B fsck.minix
mostrará "unable to read super block" ("incapaz de leer el
súper-bloque").  Si el dispositivo existe pero no es un sistema de
ficheros MINIX,
.B fsck.minix
imprimirá "bad magic number in super-block" ("mal numéro mágico en el
súper-bloque").
.SH "CÓDIGOS DE SALIDA"
El código de salida devuelto por
.B fsck.minix
es la suma de los siguientes:
.IP 0
Sin errores
.IP 3
Errores del sistema de ficheros corregidos, el sistema debería
rearrancarse si el sistema de ficheros estaba montado
.IP 4
Se han dejado errores del sistema de ficheros sin corregir
.IP 8
Error operacional
.IP 16
Error de modo de empleo o de sintaxis
.PP
Para hacer honor a la verdad, solamente pueden devolverse 0, 3, 4, 7,
8 y 16. 
.SH AUTORES
El gran Linus Benedictus Torvalds (torvalds@cs.helsinki.fi).
.br
Valores de los códigos de error por Rik Faith (faith@cs.unc.edu).
.br
Añadió soporte para la bandera de sistema de fichero válido: Dr. Wettstein
(greg%wind.uucp@plains.nodak.edu).
.br
Comprobación para impedir fsck de sistemas de ficheros montados
añadida por Daniel Quinlan (quinlan@yggdrasil.com).
.br
Soporte del sistema de ficheros de Minix versión 2 por Andreas Schwab
(schwab@issan.informatik.uni-dortmund.de), actualizado por Nicolai
Langfeldt (janl@math.uio.no).
.br
Parche de transportabilidad por Russell King (rmk@ecs.soton.ac.uk).

