olea/LuCAS-cvs/web-pameli/man/man8/mkfs.minix.8
.\" Copyright 1992, 1993, 1994 Rickard E. Faith (faith@cs.unc.edu)
.\" May be freely distributed.
.\" " for emacs hilit19 mode
.\"
.\" Translated into Spanish on Tue Sep 8 1998 by Gerrado Aburruzaga
.\" García <gerardo@cica.es>
.\"  
.TH MKFS 8 "2 Julio 1996" "Util-linux 2.6" "Manual del Administrador del Sistema Linux"
.SH NOMBRE
mkfs \- construye un sistema de ficheros MINIX en Linux
.SH SINOPSIS
.BR "mkfs [ \-c | \-l nombrefichero ] [ \-n" longitudnombre
.B ] [ \-i
numeronodosi
.B ] [ \-v ]
dispositivo
.B [ 
tamañoenbloques
.B ]
.SH DESCRIPCIÓN
.B mkfs
crea un sistema de ficheros MINIX en Linux sobre un dispositivo
(usualmente una partición de disco).

El
.I dispositivo
es normalmente de la forma siguiente:

.nf
.RS
/dev/hda[1-8] (primer disco IDE)
/dev/hdb[1-8] (segundo disco IDE)
/dev/sda[1-8] (primer disco SCSI)
/dev/sdb[1-8] (segundo disco SCSI)
.RE
.fi

El parámetro
.I tamañoenbloques
es el tamaño deseado del sistema de ficheros, en bloques. Esta
información puede determinarse con el programa
.BR fdisk (8)
o
.BR cfdisk (8).
Si se omite, se determinará automáticamente. Sólo se permiten números
de bloques estrictamente mayores de 10 y estrictamente menores de 65536.
.SH OPCIONES
.TP
.B \-c
Antes de crear el sistema de ficheros se miran los bloques malos del
dispositivo. Si se encuentran algunos, se muestran cuántos.
.TP
.BI \-n "longitudnombre"
Especifica la longitud máxima de los nombres de ficheros. No se
permite ningún espacio entre el
.B \-n
y 
.IR longitudnombre .
En la actualidad, los únicos valores permitidos son 14 y 30.
.B 30
es el predeterminado.
.TP
.BI \-i " numeronodosi"
Especifica el número de nodos-índice para el sistema de ficheros.
.TP
.BI \-l " nombrefichero"
Lee la lista de bloques malos de
.IR nombrefichero .
El fichero tendrá un número de bloque malo en cada renglón. Se muestra
el número de bloques malos.
.TP
.B \-v
Construye un sistema de ficheros Minix versión 2.
.SH "CÓDIGOS DE SALIDA"
El código de salida devuelto por
.B mkfs.minix
es uno de los siguientes:
.IP 0
Ningún error.
.IP 8
Error operativo.
.IP 16
Error de sintaxis o de modo de empleo.
.SH "VÉASE TAMBIÉN"
.BR fsck (8),
.BR mkefs (8),
.BR efsck (8),
.BR reboot (8)
.SH AUTORES
Linus Benedictus Torvalds (torvalds@cs.helsinki.fi).
.br
Valores de los códigos de error por Rik Faith (faith@cs.unc.edu)
.br
Característica de petición de nodos-í por Scott Heavner (sdh@po.cwru.edu)
.br
Soporte para la bandera de validez del sistema de ficheros por el Dr. Wettstein
(greg%wind.uucp@plains.nodak.edu)
.br
Comprobación para prevenir mkfs en sistemas de ficheros montados y la
limpieza del sector de arranque por Daniel Quinlan (quinlan@yggdrasil.com)
.br
Soporte de Minix v2 por Andreas Schwab
(schwab@issan.informatik.uni-dortmund.de), actualizado por Nicolai
Langfeldt (janl@math.uio.no)
.br
Parche de transportabilidad por Russell King.
