    <chapter id="genera-llave-gpg">
    <title>Crear una llave GNUPG para firmar los paquetes generados.</title>
    <para>En esta secci&oacute;n explicaremos como crear una llave GNUPG para firmar
    nuestros paquetes RPM.</para>

    <note>
    <title>Nota</title>
    <para>Si ya cuentas con una llave GNUGP puedes saltar esta secci&oacute;n</para>
    </note>

    <para>Lo primero que debes ver es si contamos con GNUPG en nuestro sistema,
    este documento asume que cuentas con el, sino lo tienes instalado, ve a
    <ulink url="http://www.gnupg.org/">http://www.gnupg.org</ulink> y descarga e
    instala una versi&oacute;n estable.</para>

    <para>Primero vemos si lo tenemos, en una consola de comandos teclea lo
    siguiente.</para>

    <screen><userinput>
$ rpm -qa|grep gnupg
    </userinput></screen>

    <para>Y deber&aacute;s tener el siguiente resultado:</para>

    <screen><userinput>
$ rpm -qa|grep gnupg
gnupg-x.x.x-x.x
    </userinput></screen>

    <para>Si tienes ese resultado cuentas con GNUPG en tu sistema, las X deber&aacute;n ser
    n&uacute;meros mostrando la versi&oacute;n que tienes instalada.</para>

    <para>Ahora debes generar una llave, en una consola de comandos
    escribe:</para>

    <screen><userinput>
$ gpg --gen-key
    </userinput></screen>

    <para>Generar una llave GNUPG es un proceso interactivo, debes responder
    algunas preguntas, como el tipo de llave, la duraci&oacute;n, tu nombre y
    correo.</para>

    <para>Deber&aacute;s tener una salida similar a esta:</para>

    <screen><userinput>
$ gpg --gen-key
gpg (GnuPG) 1.2.4; Copyright (C) 2003 Free Software Foundation, Inc.
This program comes with ABSOLUTELY NO WARRANTY.
This is free software, and you are welcome to redistribute it
under certain conditions. See the file COPYING for details.
 
gpg: /home/jorge/.gnupg: directorio creado
gpg: creado un nuevo fichero de configuraci&oacute;n /home/jorge/.gnupg/gpg.conf
gpg: AVISO: las opciones en /home/jorge/.gnupg/gpg.conf no est&aacute;n a&uacute;n activas en esta ejecuci&oacute;n
gpg: anillo /home/jorge/.gnupg/secring.gpg creado
gpg: anillo /home/jorge/.gnupg/pubring.gpg creado
Por favor seleccione tipo de clave deseado:
   (1) DSA y ElGamal (por defecto)
   (2) DSA (s&oacute;lo firmar)
   (4) RSA (s&oacute;lo firmar)
Su elecci&oacute;n: 1
El par de claves DSA tendr&aacute; 1024 bits.
Listo para generar un nuevo par de claves ELG-E.
              el tama&ntilde;o m&iacute;nimo es 768 bits
        el tama&ntilde;o por defecto es 1024 bits
 el tama&ntilde;o m&aacute;ximo recomendado es 2048 bits
&iquest;De qu&eacute; tama&ntilde;o quiere la clave (1024)? 1024
El tama&ntilde;o requerido es de 1024 bits
Por favor, especifique el periodo de validez de la clave.
         0 = la clave nunca caduca
      n  = la clave caduca en n d&iacute;as
      n w = la clave caduca en n semanas
      n m = la clave caduca en n meses
      n y = la clave caduca en n a&ntilde;os
&iquest;Validez de la clave (0)? 0
Key nunca caduca
&iquest;Es correcto (s/n)? s
                       
Necesita un identificador de usuario para identificar su clave. El programa
construye el identificador a partir del Nombre Real, Comentario y Direcci&oacute;n
de Correo Electr&oacute;nico de esta forma:
    Heinrich Heine (Der Dichter)
 
Nombre y apellidos: Jorge Garcia (Garsan)
Direcci&oacute;n de correo electr&oacute;nico: garsan@garsan.ws
Comentario: Llave para firmar paquetes RPM y correo-e
Ha seleccionado este ID de usuario:
    Jorge Garcia (Garsan) (Llave para firmar paquetes RPM y correo-e)
 
&iquest;Cambia (N)ombre, (C)omentario, (D)irecci&oacute;n o (V)ale/(S)alir? v
Necesita una frase contrase&ntilde;a para proteger su clave secreta.
 
Es necesario generar muchos bytes aleatorios. Es una buena idea realizar
alguna otra tarea (trabajar en otra ventana/consola, mover el rat&oacute;n, usar
la red y los discos) durante la generaci&oacute;n de n&uacute;meros primos. Esto da al
generador de n&uacute;meros aleatorios mayor oportunidad de recoger suficiente
entropia.
++++++++++++++++++++.++++++++++.+++++.++++++++++++++++++++++++++++++++++++++++.
Es necesario generar muchos bytes aleatorios. Es una buena idea realizar
alguna otra tarea (trabajar en otra ventana/consola, mover el rat&oacute;n, usar
la red y los discos) durante la generaci&oacute;n de n&uacute;meros primos. Esto da al
generador de n&uacute;meros aleatorios mayor oportunidad de recoger suficiente
entropia.
+++++.++++++++++++++++++++.+++++++++++++++++++++++++..
gpg: /home/jorge/.gnupg/trustdb.gpg: se ha creado base de datos de confianza
claves p&uacute;blica y secreta creadas y firmadas.
clave marcada como de confianza absoluta.
 
pub  1024D/XXXXXXXX 2004-05-20 Jorge Garcia (Garsan) (Llave para firmar paquetes RPM y correo-e)
    Huella de clave = XXXX XXXX XXXX XXXX XXXX  XXXX XXXX XXXX XXXX XXXX
sub  1024g/XXXXXXXX 2004-05-20
    </userinput></screen>

    <para>Despu&eacute;s de responder unas cuantas preguntas, ya tendremos nuestra
    llave lista.</para>

    <para>Para listar y comprobar que se ha creado la llave puedes usar el
    siguiente comando:</para>

    <screen><userinput>
$ gpg --list-keys
    </userinput></screen>

    <para>El cual dar&aacute; el siguiente resultado:</para>

     <screen><userinput>
$ gpg --list-keys

gpg: ATENCION &iexcl;se est&aacute; usando memoria insegura!
gpg: por favor, vea http://www.gnupg.org/faq.html para m&aacute;s informaci&oacute;n
/home/jorge/.gnupg/pubring.gpg
------------------------------
pub  1024D/XXXXXXXX 2004-06-22 Jorge Garcia (Garsan) &lt;garsan@garsan.ws&gt;
sub  2048g/XXXXXXXX 2004-06-22
    </userinput></screen>
    </chapter>
