<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Art&iacute;culo para la revista Linux Actual n&uacute;mero 13: Interfaces WWW a Bases de Datos.</TITLE>


</HEAD>
<BODY>
<H1>Art&iacute;culo para la revista Linux Actual n&uacute;mero 13: Interfaces WWW a Bases de Datos.</H1>

<H2>Javier Fern&aacute;ndez-Sanguino Pe&ntilde;a 
<A HREF="jfs@computer.org">jfs@computer.org</A></H2>18 Marzo 2000
<P><HR>
<EM> Con este art&iacute;culo va a dar comienzo a una serie que va a estudiar
las herramientas, dise&ntilde;o y programaci&oacute;n para unir dos importantes
tecnolog&iacute;as entre s&iacute;: Internet y las Bases de Datos.</EM>
<HR>
<H2><A NAME="s1">1. Introducci&oacute;n a la serie</A></H2>

<P>Este art&iacute;culo es el primero de una serie que pretende ense&ntilde;ar al
lector como, con herramientas sobre GNU/Linux se pueden unir dos
tecnolog&iacute;as tan importantes  hoy en d&iacute;a como son las Bases de
Datos y el fen&oacute;meno de Internet, en particular la <EM>World Wide
Web</EM>.
<P>En primer lugar se va a realizar una introducci&oacute;n
breve a estas tecnolog&iacute;as y a explicar la raz&oacute;n de usar como
herramienta de desarrollo e integraci&oacute;n a GNU/Linux. Posteriormente
se  analizar&aacute;n las herramientas que pueden servir para gestionar
la base de datos, y se aplicar&aacute;n todos los conceptos en el dise&ntilde;o de
una aplicaci&oacute;n real. Se ver&aacute;n los m&eacute;todos de programaci&oacute;n y las
alternativas existentes actualmente para integrar ambos sistemas,
deteni&eacute;ndonos en una de ellas para solucionar la implementaci&oacute;n de la
aplicaci&oacute;n.
<P>
<H2><A NAME="s2">2. Introducci&oacute;n breve a las Bases de Datos</A></H2>

<P>La tecnolog&iacute;a de bases de datos es  una de las m&aacute;s antiguas dentro de
la ciencia de la inform&aacute;tica, esencialmente es una tecnolog&iacute;a que se
basa en la capacidad para almacenar y recuperar informaci&oacute;n
relacionada entre s&iacute;. Una base de datos puede ser desde un fichero de
texto (estilo <EM>/etc/passwd</EM>) hasta un conjunto de tablas
repartidas en ficheros binarios y que acumulen millones de
registros. En cualquier caso es necesario un programa capaz de
gestionar estos datos y permitir acceder a esta informaci&oacute;n de la
manera m&aacute;s r&aacute;pida posible.
<P>Existe m&aacute;s de un esquema a la hora del desarrollo y definici&oacute;n de las
bases de datos: bases de datos orientadas a objetos, bases de datos
relacionales, bases de datos jer&aacute;rquicas, etc... Hoy en d&iacute;a, a pesar
del crecimiento de la programaci&oacute;n orientada a objetos y, por tanto,
de las bases de datos dise&ntilde;adas con la misma filosof&iacute;a (que
actualmente permiten el desarrollo de las bases de datos multimedia),
el tipo de bases de datos m&aacute;s utilizada sigue siendo las bases de
datos relacionales.
<P>Es necesario distinguir en una base de datos su dise&ntilde;o de su
implementaci&oacute;n, como veremos m&aacute;s adelante, para el mismo dise&ntilde;o se
pueden escoger implementaciones distintas que se ajusten m&aacute;s o menos a
&eacute;ste. Evidentemente, si se escoge una implementaci&oacute;n inadecuada se
perder&aacute;n algunas de las ventajas del modelo realizado en la etapa de
dise&ntilde;o.
<P>Las bases de datos constituyen una importante herramienta a la hora de
almacenar y recuperar la informaci&oacute;n. Sin embargo, para utilizar esta
herramienta es necesario ofrecer un interfaz al usuario para abstraer
toda su complejidad. Sin este interfaz la base de datos puede
seguir utiliz&aacute;ndose pero el usuario ha de conocer el "lenguaje" de la
misma para hacer uso de &eacute;sta (actualmente el m&aacute;s utilizado es
SQL, <EM>Standard Query Language</EM>). 
<P>
<P>
<H2><A NAME="s3">3. El interfaz World Wide Web a una base de datos.</A></H2>

<P>As&iacute; pues, el interfaz es un
elemento fundamental a la hora de hacer uso de una base de datos, aqu&iacute;
es donde entra la World Wide Web (WWW).
<P>La World Wide Web se puede considerar como el elemento de Internet que
integra el cliente universal, y por tanto, puede usarse como el
interfaz universal a todo tipo de aplicaciones. 
<P>Muchos fabricantes de equipos y desarrolladores han empezado a mover
sus aplicaciones e interfaces para que puedan ser operados con
clientes basados en &eacute;sta. As&iacute;, por ejemplo, nos encontramos con
fabricantes de elementos de interconexi&oacute;n de redes (<EM>switches</EM>,
conmutadores, o <EM>routers</EM>) o impresoras de red que incluyen en
su hardware un servidor de WWW para que sus herramientas puedan ser
manejadas, configuradas, en fin, gestionadas, desde un navegador de
WWW.
<P>La ventaja para el fabricante es clara ya que le evita tener que crear
una herramienta para el cliente, ahorrando en el desarrollo; no
olvidemos que para un fabricante de hardware un cliente puede ser,
potencialmente, cualquier combinaci&oacute;n posible de uso de hardware,
sistema operativo y software. As&iacute; pues en lugar de tener que realizar
un interfaz para, por ejemplo, Solaris, otro para Linux y otro para
Windows NT, el fabricante indica al usuario que s&oacute;lo necesita un
navegador de WWW como interfaz a la gesti&oacute;n de su equipo. No ser&aacute;
necesario que programe un interfaz para cada plataforma en la que
quiera que su hardware sea gestionado sino que, al incorporar
tecnolog&iacute;as est&aacute;ndar de la WWW tanto de presentaci&oacute;n (HTML) como de
interacci&oacute;n cliente servidor (protocolo HTTP) su herramienta puede ser
utilizada desde cualquier lugar y con cualquier plataforma que tenga
un cliente de WWW.
<P>El movimiento del acceso de bases de datos de sistemas propietarios a
un sistema abierto como es la WWW, empez&oacute; ya hace a&ntilde;os, y su arquetipo
un sistema por y para la WWW, es el conocido <EM>yahoo</EM>, en
realidad cualquier buscador en la WWW. Este buscador no es m&aacute;s que una
base de datos de documentos al que se accede mediante un interfaz
WWW. La ventaja, al margen de la que ofrezca la aplicaci&oacute;n en si, es
que, por un lado, cualquiera puede "preguntar" a la base de datos sin
conocer el funcionamiento de lo que hay  detr&aacute;s, por otro los
"clientes" potenciales son todos aquellos con acceso a la WWW porque
los est&aacute;ndares usados son los mismos que para acceder a cualquier otro
servidor.
<P>
<H2><A NAME="s4">4. GNU/Linux como sistema de desarrollo</A></H2>

<P>GNU/Linux es un sistema ideal para instalar una base de datos que se
va a utilizar desde Internet, no s&oacute;lo por su demostrada velocidad en
el acceso a bases de datos, sino tambi&eacute;n por la multitud de sistemas
de bases de datos y herramientas que se pueden encontrar para GNU/Linux.
<P>En GNU/Linux se dispone actualmente de un buen n&uacute;mero de sistemas de
bases de datos, por un lado sistemas libres como PostgreSQL o
BeagleSQL, por otro sistemas "semi-libres" como mSQL o mySQL, y,
finalmente, sistemas propietarios: Oracle, Informix o Sybase.
<P>Tambi&eacute;n dispone de una multitud de servidores de WWW, de entre los que
merece una menci&oacute;n especial Apache, el servidor de WWW m&aacute;s utilizado
en Internet. Finalmente, al tratarse de un sistema abierto y poderse
optimizar "a medida" para el desarrollo a realizar se convierte en la
alternativa ideal.
<P>No hay que olvidar tampoco el factor coste. En la actualidad se puede
montar un sistema profesional utilizando herramientas totalmente
libres, el coste ser&aacute; s&oacute;lo el del hardware y el de las personas
dedicadas a montarlo. El coste en licencias ser&aacute; nulo y puede creer
el lector que el coste de un sistema de base de datos 
y un sistema operativo propietarios que d&eacute; las mismas prestaciones
(sino menos) es ciertamente elevado (estamos hablando de millones de
pesetas). Si se monta el sistema con herramientas libres se podr&aacute;n
adaptar al 100% para lo que se precisa ya que el desarrollador tendr&aacute;
a su disposici&oacute;n el c&oacute;digo fuente de todas ellas para adaptarlas a
medida.
<P>
<P>
<H2><A NAME="s5">5. Elecci&oacute;n de los componentes</A></H2>

<P>Para montar un sistema de interfaz de bases de datos v&iacute;a WWW se han
elegido como componentes b&aacute;sicos:
<UL>
<LI>Sistema operativo: Debian GNU/Linux 2.1. Actualmente Debian es
la distribuci&oacute;n que m&aacute;s herramientas ofrece para un desarrollador y
para el usuario, con m&aacute;s de 5000 paquetes (4 cds de binarios en Debian
2.2) de c&oacute;digo libre en la distribuci&oacute;n principal. Si el lector es un
desarrollador <EM>debe</EM> usar Debian GNU/Linux. Como n&uacute;cleo del
sistema utilizaremos un n&uacute;cleo Linux 2.2 ajustado a las necesidades.</LI>
<LI>Servidor de web: Apache 1.3.3. El servidor de web m&aacute;s utilizado
en Internet, extensible, seguro y r&aacute;pido, y portado a multitud de sistemas.</LI>
<LI>Gestor de base de datos: PostgreSQL 6.3.2. Se ha elegido
PostgreSQL en lugar de otros sistemas de base de datos semi-libres
debido a su amplia licencia. Quiz&aacute;s otros sistemas de base de datos
(como mySQL) puedan ser m&aacute;s r&aacute;pidos pero PostgreSQL ofrece todas las
capacidades necesarias para un desarrollo e implementaci&oacute;n
inicial. El cambio posterior de la base de datos a otro
sistema de base de datos no ser&aacute; dificil si en las
herramientas desarrolladas se hace uso de est&aacute;ndares para comunicarse
con la misma (JDBC, SQL..).</LI>
</UL>
<P>
<H2><A NAME="s6">6. Instalaci&oacute;n de los componentes</A></H2>

<P>Gracias al sistema de paquetes usado por las distribuciones de
GNU/Linux, hoy en d&iacute;a se pueden instalar los componentes comentados
previamente sin mayor esfuerzo por parte del
administrador. Simplemente seleccionando el componente e instal&aacute;ndolo,
restando s&oacute;lo hacer la configuraci&oacute;n (que en la mayor parte de los
casos vendr&aacute; una por defecto pero ser&aacute; necesaria adaptar a las necesidades
espec&iacute;ficas del usuario). En el caso de Debian GNU/Linux instalaremos
los paquetes <CODE>apache</CODE> y <CODE>postgresql</CODE>.
<P>Podr&iacute;amos comentar c&oacute;mo hacer la instalaci&oacute;n a partir de cero desde el
c&oacute;digo fuente distribuido por los proyectos de desarrollo, pero no se
va a comentar aqu&iacute; como hacerlo ya que ha sido previamente comentado
para ambos componentes en esta misma revista.
<P>Dado que a&uacute;n no hemos especificado la aplicaci&oacute;n que vamos a realizar
no entraremos a&uacute;n en la configuraci&oacute;n de estos componentes, sino que
la dejaremos para m&aacute;s adelante. Nos bastar&aacute; con ver que los
componentes han sido correctamente instalados y funcionan.
<P>
<H2><A NAME="s7">7. Comprobaci&oacute;n de la instalaci&oacute;n: Apache</A></H2>

<P>Para ver que efectivamente tenemos el servidor de web instalado y
lanzado haremos lo siguiente:
<P>
<UL>
<LI>Comprobaremos que existe el demonio que atiende a las peticiones
y est&aacute; actualmente ejecut&aacute;ndose. Para ello ejecutamos <CODE>ps aux |
grep apache</CODE>. Que nos deber&aacute; mostrar el proceso ejecut&aacute;ndose. Si
no aparece una lista de procesos lo deber&iacute;amos reiniciar con
<CODE>/etc/init.d/apache start</CODE> (esto es para Debian GNU/Linux,
otras distribuciones ponen los guiones para lanzar los demonios de
otra forma.</LI>
<LI>Probaremos el servidor para comprobar que funciona
conect&aacute;ndonos al puerto en que por defecto se instala el demonio, el
puerto 80. Bastar&aacute; con hacer un <CODE>telnet localhost 80</CODE> y ver
que efectivamente hay una conexi&oacute;n. Para cerrarla sin enviar
pulsaremos Ctrl+5 lo que enviar&aacute; el c&oacute;digo de escape a la aplicaci&oacute;n
telnet y podremos cerrarla escribiendo <CODE>close</CODE> (m&aacute;s
informaci&oacute;n <CODE>man telnet</CODE>)</LI>
<LI>Para ver que sirve adecuadamente p&aacute;ginas lanzaremos un navegador
contra el servidor, escribiendo como direcci&oacute;n
<CODE>http://localhost/</CODE>. Si el servidor ha sido adecuadamente
lanzado veremos una p&aacute;gina de muestra.</LI>
</UL>
<P>En cualquier caso si vemos cualquier problema es recomendable acudir a
la documentaci&oacute;n. En el caso de Debian viene dentro del paquete
<CODE>apache-doc</CODE>, y que, tras instalar, incluir&aacute; la documentaci&oacute;n
en <CODE>/usr/doc/apache-doc</CODE>. Tambi&eacute;n es recomendable acudir a los
registros del programa que se encuentran (en Debian) en
<CODE>/var/log/apache</CODE>.
<P>
<P>
<H2><A NAME="s8">8. Comprobaci&oacute;n de la instalaci&oacute;n: PostgreSQL</A></H2>

<P>Para probar la configuraci&oacute;n de PostgreSQL vamos a utilizar uno de los
interfaces de gesti&oacute;n que m&aacute;s adelante se comentar&aacute;n, ya que se trata
del m&aacute;s sencillo viene incluido con la distribuci&oacute;n normal de
PostgreSQL.
<P>Conviene comentar que Debian GNU/Linux viene con un usuario de gesti&oacute;n
de la base de datos que es que el debe usarse para realizar la gesti&oacute;n
de la misma: creaci&oacute;n de usuarios de la base de datos y bases de
datos. Mientras no se haya creado ning&uacute;n usuario de base de datos que
sea un DBA (<EM>Database Administrator</EM>) ser&aacute; necesario usar
siempre &eacute;ste.
<P>Por ello para probar la base de datos lo primero que haremos ser&aacute;
"convertirnos" en este usuario haciendo, como superusuario, <EM>su -
postgres</EM>. Este usuario tiene como directorio <EM>home</EM> el
<CODE>/var/postgres</CODE> que es donde se van a encontrar todos los
ficheros que utilice la base de datos. Tras esto haremos algunas
pruebas:
<P>
<UL>
<LI>De igual manera que para el servidor de web, la base de datos se
lanza como un servicio llamado <EM>postmaster</EM> en un puerto
determinado. Para ver si el servidor est&aacute; lanzado haremos <CODE>ps aux
|grep postgres</CODE> que nos deber&aacute; listar un proceso lanzado como
usuario postgres. Si no es as&iacute; quiz&aacute;s no est&eacute; lanzado (aunque el
gestor de paquetes lo lanza al instalarlo) pero se puede lanzar con
<CODE>/etc/init.d/postgres start</CODE>.</LI>
<LI>Ahora mismo no probaremos que nos podemos
conectar al servidor ya que, posiblemente, a&uacute;n no est&eacute; configurado
para aceptar conexiones a trav&eacute;s de TCP/IP. Si estuviera configurado
se lanzar&iacute;a en el puerto 5432 (ver <CODE>/etc/services</CODE>), y
podr&iacute;amos probarlo conect&aacute;ndonos mediante un <CODE>telnet</CODE> como antes.</LI>
<LI>Dado que posiblemente acepte s&oacute;lo conexiones de usuarios de la
misma m&aacute;quina, probaremos a conectarnos con el interfaz de texto. Para
ello ejecutaremos <CODE>pgsql</CODE> sin argumentos. Si nos da un
<EM>prompt</EM> del estilo de <CODE>template1=&gt;</CODE> estar&aacute;
funcionando correctamente (saldremos con Ctrl+D o con "\q"). Si da un
error posiblemente no est&eacute; funcionando.</LI>
</UL>
<P>De la misma forma que Apache, para cualquier problema debemos
consultar la documentaci&oacute;n, que en Debian se instala en el paquete
<CODE>postgres-doc</CODE>, y los ficheros de registro que ahora estar&aacute;n en
<CODE>/var/log/postgres.log</CODE>.
<P>
<H2><A NAME="s9">9. Gesti&oacute;n como usuario postgres</A></H2>

<P>Hay ciertas herramientas de gesti&oacute;n de la base de datos que son
necesarias conocer para utilizarlas como usuario 'postgres'. Veremos
m&aacute;s adelante su uso particular para la base de datos que se va a
crear, pero no est&aacute; de m&aacute;s recordarlas aqu&iacute;. Al instalar la
distribuci&oacute;n de postgres, quedar&aacute;n instalados en el directorio
<CODE>/usr/lib/postgresql/bin</CODE> los programas que son necesarios para
gestionar "desde cero" la base de datos. Estos programas estar&aacute;n en el
<CODE>PATH</CODE> del usuario postgres.
<P>Antes de nada es necesario tener clara una cosa del sistema de base de
datos. Un sistema de base de datos es una colecci&oacute;n de bases de datos
administradas por el mismo usuario, f&iacute;sicamente el sistema as&iacute; como
cada base de datos, es una serie de ficheros pertenecientes al usuario
y que el servicio <EM>postmaster</EM> se encarga de gestionar, en el
caso de Debian estos ficheros se instalan por defecto en
<CODE>/var/lib/postgres/data</CODE>. La ventaja de esta filosof&iacute;a es que
para mover la base de datos o hacer una copia de seguridad de &eacute;sta
basta con copiar los ficheros de la misma.
<P>
<UL>
<LI><CODE>cleardbdir</CODE>: destruye todas las bases de datos
instaladas. S&oacute;lo se utiliza cuando se quiere reinicializara el sistema
de base de datos y es necesario para el demonio <EM>postmaster</EM>.
</LI>
<LI><CODE>initdb</CODE>: crea un nuevo sistema de base de datos, crea
los directorios necesarios para el sistema y la base de datos
<EM>template1</EM> que se trata de la plantilla a trav&eacute;s de la cual 
se generar&aacute;n el resto de las bases de datos. En un sistema en el que
se haya instalado correctamente la base de datos esto se habr&aacute;
realizado ya y el usuario no tendr&aacute; que hacerlo.
</LI>
<LI><CODE>initlocation</CODE>: prepara un directorio para albergar el
sistema de base de datos.
</LI>
<LI><CODE>pg_passwd</CODE>: permite manipular el fichero de contrase&ntilde;as
de la base de datos. Se trata de una aplicaci&oacute;n similar al programa
<CODE>passwd</CODE> pero para el sistema de base de datos.
</LI>
<LI><CODE>pg_upgrade</CODE>: permite actualizar el sistema de base de
datos. Cuando se cambia de versi&oacute;n del sistema de base de datos es
necesario actualizar los datos ya que sino ser&aacute;n incompatibles con el
nuevo sistema. Este programa facilita el movimiento de una versi&oacute;n a otra.
</LI>
<LI><CODE>pg_dump</CODE> y <CODE>pg_dumpall</CODE> vuelcan (una base de
datos en el caso del primero y todas las bases el segundo), las
ordenes SQL necesarias en un fichero ASCII de forma que la base de
datos se pueda recuperar a trav&eacute;s de &eacute;ste. Sin hacer uso de ninguna
opci&oacute;n la base de datos ser&aacute; volcada con todos los datos incluidos. Al
tratarse de SQL est&aacute;ndar, este mismo fichero puede usarse para crear
de nuevo la base de datos en otro sistema de bases de datos,
facilitando la migraci&oacute;n a cualquier otro sistema.
</LI>
<LI><CODE>pg_id</CODE>: devuelve el identificador de usuario
correspondiente al usuario administrador de las bases de datos.
</LI>
<LI><CODE>createdb</CODE>: crea una base de datos en nuestro sistema de
base de datos. En realidad llama al interfaz <CODE>pgsql</CODE> para
realizar esto.
</LI>
<LI><CODE>createuser</CODE>: crea un usuario reconocido en el sistema de
bases de datos. Los usuarios del sistema de base de datos<EM>no</EM>
tienen por qu&eacute; tener relaci&oacute;n con los usuarios en nuestro sistema
operativo, pudiendo haber usuarios distintos. 
</LI>
<LI><CODE>destroydb</CODE>: elimina una base de datos.
</LI>
<LI><CODE>destroyuser</CODE>: elimina un usuario del sistema de bases de
datos.

</LI>
</UL>
<P>El administrador de la base de datos necesita conocer estas
herramientas para usarlas, si surge la necesidad. En particular,
aquellas funciones que no se pueden hacer a trav&eacute;s del interfaz, ya
que la creaci&oacute;n y destrucci&oacute;n de bases de datos y usuarios se podr&aacute;
hacer con las herramientas de gesti&oacute;n que ahora se analizar&aacute;n.
<P>
<H2><A NAME="s10">10. Herramientas de gesti&oacute;n de la base de datos</A></H2>

<P>Antes de hacer nada en el sistema de base de datos, ni crear usuarios
ni otras bases de datos, deberemos conocer primero qu&eacute; programas
podremos usar para la gesti&oacute;n de la base de datos:
<P>
<UL>
<LI><CODE>pgsql</CODE>: el interfaz en modo texto para acceder a la base
de datos, permite realizar todas las funciones de acceso a una base de
datos mediante &oacute;rdenes SQL (teclear <CODE>\h</CODE> para acceder a la lista
de todas las &oacute;rdenes disponibles) y obtener tambi&eacute;n informaci&oacute;n del
sistema de base de datos, como ver las bases de datos, los tipos de
datos soportados, etc... para ver las &oacute;rdenes disponibles teclear
<CODE>\?</CODE>. 
</LI>
<LI><CODE>pgaccess</CODE> (&uacute;ltima versi&oacute;n 0.98.4): interfaz en Tcl/Tk que permite visualizar las
tablas, crearlas mediante un formulario de forma r&aacute;pida, etc.. Es el
interfaz m&aacute;s evolucionado para postgresql aparte del interfaz
textual. No son necesarios conocimientos de SQL para hacer uso de
muchas de las funciones y permite administrar tanto la base de datos
como los datos en s&iacute; de una manera eficaz.  En el caso de Debian para
instalarlo es necesario instalar el paquete <CODE>libpgtcl</CODE>.
</LI>
<LI><CODE>gtksql</CODE> (&uacute;ltima versi&oacute;n 0.3): interfaz en Gtk a la base
de datos. Muestra las tablas de la base de datos y permite hacer
consultas SQL, visualizando el resultado en el mismo interfaz. Se
trata de una herramienta a&uacute;n en desarrollo pero que le puede resultar
&uacute;til a un administrador para hacer tareas sencillas.
</LI>
<LI><CODE>gasql</CODE>: un interfaz en Gtk para PostgreSQL desarrollado
para el proyecto GNOME, a&uacute;n se encuentra en desarrollo, pero tiene
algunas funcionalidades &uacute;tiles.</LI>
</UL>
<P>Estos programas nos van a ser &uacute;tiles para poder acceder a la base de
datos sin tener muchos conocimientos del funcionamiento de &eacute;sta,
aunque nos va a ser imprescindible el conocimiento del lenguaje SQL,
podemos utilizarlas en muchas situaciones. Existen otras herramientas
como <CODE>wisql</CODE> y <CODE>owd</CODE> que el autor a&uacute;n no ha probado, y
ser&aacute;n comentadas en posteriores art&iacute;culos.
<P>
<H2><A NAME="s11">11. Siguientes art&iacute;culos</A></H2>

<P>En los siguientes art&iacute;culos de esta serie vamos a analizar el
desarrollo de una aplicaci&oacute;n espec&iacute;fica y a ver las herramientas
necesarias para ofrecer un interfaz de acceso a nuestra base de datos
mediante la WWW.
<P>Llevaremos a cabo el an&aacute;lisis de la aplicaci&oacute;n as&iacute; como su desarrollo
y empezaremos a ver la ventaja de tener herramientas gr&aacute;ficas de
gesti&oacute;n de la base de datos para detectar errores y depurar la aplicaci&oacute;n.
<P>
<H2><A NAME="s12">12. Sumarios</A></H2>

<P>
<P>
<H2><A NAME="s13">13. Listados</A></H2>

<P>LISTADO 1-
<P>
<P>Para el lector interesado se recomienda buscar m&aacute;s informaci&oacute;n en
diversos servidores de web. Estos son:
<P>
<UL>
<LI>PostgreSQL: 
<A HREF="http://www.postgresql.org">http://www.postgresql.org</A> y su FAQ en
<A HREF="http://www.postgresql.org/docs/">http://www.postgresql.org/docs/</A>.</LI>
<LI>Apache: http://www.apache.org</LI>
<LI>El HOWTO de PostgreSQL para Linux: 
<A HREF="http://metalab.unc.edu/LDP/HOWTO/PostgreSQL-HOWTO.html">http://metalab.unc.edu/LDP/HOWTO/PostgreSQL-HOWTO.html</A>,
tambi&eacute;n se instala en <CODE>/usr/doc/HOWTO</CODE> al instalar el paquete
HOWTO en Debian.</LI>
<LI>PGaccess: 
<A HREF="http://www.flex.ro/pgaccess">http://www.flex.ro/pgaccess</A></LI>
<LI>gtksql: 
<A HREF="http://www.mygale.org/~bbrox/GtkSQL">http://www.mygale.org/~bbrox/GtkSQL</A></LI>
<LI>gasql: 
<A HREF="http://www.gnome.org/applist">http://www.gnome.org/applist</A></LI>
</UL>
<P>Tambi&eacute;n para seguir esta serie puede ser conveniente alg&uacute;n
conocimiento de bases de datos generales. Se recomienda el libro
de Silberschatz, Korth y Sudarsan: "Database Systems Concepts, III ed,
Mc Graw-Hill, 1996."
(
<A HREF="http://www.bell-labs.com/topic/books/db-book/index.html">http://www.bell-labs.com/topic/books/db-book/index.html</A>) que tambi&eacute;n
ha sido traducido al castellano, otro libro tambi&eacute;n recomendado es 
el de Ullman y Widom: "A First Course in Database Systems" de 1997
editado por Prentice-Hall
(
<A HREF="http://www-db.stanford.edu/~ullman/fcdb.html">http://www-db.stanford.edu/~ullman/fcdb.html</A>).
<P>
<P>Para el lector que quiera profundizar en
SQL podr&aacute; encontrar muchos enlaces en la parte bibliogr&aacute;fica del HOWTO
de PostgreSQL para Linux aunque tambi&eacute;n es recomendable el tutorial
disponible en 
<A HREF="http://w3.one.net/~jhoffman/sqltut.htm">http://w3.one.net/~jhoffman/sqltut.htm</A>.
<P>Finalmente, se recomienda la lectura de los art&iacute;culos relacionados con
Bases de Datos publicados en Linux Actual ("Bases de Datos en Internet
bajo GNU/Linux" de Alvaro del Castillo en LA 2 y la serie "ODBC sobre
Linux" de Juan Antonio Mart&iacute;nez que comienza en LA 3 ) y en Linux
Journal (n&uacute;mero 5 de la edici&oacute;n en castellano "Especial Bases de Datos").
<P>
<P>PIE LISTADO 1:Servidores donde encontrar m&aacute;s informaci&oacute;n
<P>
<P>
<P>
<P>
<H2><A NAME="s14">14. Capturas</A></H2>

<P>Esta es la lista de ficheros adjuntos as&iacute; como su pie de p&aacute;gina. La
primera captura puede ir en cualquier lado, las segundas conviene que
est&eacute;n hacia el final del art&iacute;culo.
<UL>
<LI>postgresl.jpg: PostgreSQL es el sistema de base de datos libre
m&aacute;s potente del mundo.
<A NAME="fig-postgresql"></A> <IMG SRC="postgresql.jpg">

</LI>
<LI>pgaccess.gif. PgAccess es un interfaz tremendamente &uacute;til para la
gesti&oacute;n de nuestro sistema de base de datos.
<A NAME="fig-pgaccess"></A> <IMG SRC="pgaccess.gif">

</LI>
<LI>gtksql.gif. Para los que quieran una simple "hoja SQL" gtksql es
la herramienta a utilizar.
<A NAME="fig-gtksql"></A> <IMG SRC="gtksql.gif">
</LI>
</UL>
<P>
<H2><A NAME="s15">15. Notas de maquetaci&oacute;n</A></H2>

<P>Es mejor que, si no entra todo el art&iacute;culo, antes que ponerlo a cuatro
columnas se avise al autor de que es necesario recotarlo. Dado que es
una serie no hay ning&uacute;n problema en poner lo recortado en el siguiente
art&iacute;culo de la serie. Por favor, contactar con el autor si hay alg&uacute;n problema.
<P>
<P>
<H2><A NAME="s16">16. Notas de coordinaci&oacute;n</A></H2>

<P>Este es el primer art&iacute;culo de la serie, si es necesario recortarlo
hablar con el autor para que lo que no se incluya en &eacute;ste n&uacute;mero se
incluya en el siguiente art&iacute;culo.
<P>
<P>
</BODY>
</HTML>
