<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>RAID-Software C&Oacute;MO: Comprobaci&oacute;n</TITLE>
 <LINK HREF="Software-RAID.HOWTO-6.html" REL=next>
 <LINK HREF="Software-RAID.HOWTO-4.html" REL=previous>
 <LINK HREF="Software-RAID.HOWTO.html#toc5" REL=contents>
</HEAD>
<BODY>
<A HREF="Software-RAID.HOWTO-6.html">Página siguiente</A>
<A HREF="Software-RAID.HOWTO-4.html">Página anterior</A>
<A HREF="Software-RAID.HOWTO.html#toc5">Índice general</A>
<HR>
<H2><A NAME="s5">5. Comprobaci&oacute;n</A></H2>

<P>Si piensa usar un RAID para obtener tolerancia a fallos, tambi&eacute;n puede que
quiera comprobar su configuraci&oacute;n para ver si realmente funciona. Ahora
bien, ¿c&oacute;mo se simula un fallo de disco?.
<P>El resumen es que no puede, salvo quiz&aacute;s atravesando mediante un hacha de
fuego la unidad sobre la que quiere ``simular'' el fallo.
Nunca puede saber qu&eacute; ocurrir&aacute; si un disco muere. Puede que se apodere
el&eacute;ctricamente del bus al que est&aacute; conectado, haciendo que todas las
unidades en ese bus sean inaccesibles, aunque yo nunca he o&iacute;do que eso haya
ocurrido. La unidad tambi&eacute;n puede simplemente informar de un fallo de
lectura/escritura a la capa SCSI/IDE que a su vez har&aacute; que la capa RAID
maneje esta situaci&oacute;n de forma elegante. Afortunadamente, esta es la forma
en la que normalmente ocurren las cosas.
<P>
<H2><A NAME="ss5.1">5.1 Simulaci&oacute;n de un fallo de disco</A>
</H2>

<P>Si quiere simular un fallo de disco entonces desconecte la unidad. Debe
hacer esto con el <B>sistema apagado</B>. Si est&aacute; interesado en comprobar
si sus datos pueden sobrevivir con un disco menos de los habituales, no hay
motivo para ser un vaquero de las conexiones en caliente aqu&iacute;. Apague el
sistema, desconecte el disco y enci&eacute;ndalo de nuevo.
<P>Mire en el registro del sistema (``syslog'') y en <CODE>/proc/mdstat</CODE> para ver qu&eacute; es
lo que est&aacute; haciendo el RAID. ¿Ha funcionado?.
<P>Recuerde que <B>debe</B> utilizar un RAID-{1,4,5} para que su array sea
capaz de sobrevivir a un fallo de disco. Un modo lineal o un RAID-0 fallar&aacute;n
totalmente cuando se pierda un dispositivo.
<P>Cuando haya reconectado el disco de nuevo (recuerde, con el sistema apagado,
naturalmente) podr&aacute; a&ntilde;adir el ``nuevo'' dispositivo al RAID otra vez, con la
orden <CODE>raidhotadd</CODE>.
<P>
<H2><A NAME="ss5.2">5.2 Simulaci&oacute;n de una corrupci&oacute;n de datos</A>
</H2>

<P>Un RAID (ya sea hardware o software) asume que si una escritura en un disco
no devuelve un error, entonces la escritura ha tenido &eacute;xito. Por tanto. so
si disco corrompe datos sin devolver un error, sus datos se
<EM>corromper&aacute;n</EM>. Naturalmente, esto es muy improbable que ocurra, pero
es posible, y producir&iacute;a un sistema de ficheros corrupto.
<P>Un RAID no puede y no est&aacute; pensado para proteger contra la corrupci&oacute;n de
datos en un medio. Por tanto, tampoco tiene ning&uacute;n sentido corromper
a prop&oacute;sito los datos de un disco (usando <CODE>dd</CODE>, por ejemplo) para ver
c&oacute;mo manejar&aacute; el sistema RAID esa situaci&oacute;n. Es m&aacute;s probable (a menos que
corrompa el superbloque del RAID) que la capa RAID no descubra nunca la
corrupci&oacute;n, sino que su sistema de ficheros en el dispositivo RAID se
corrompa.
<P>As&iacute; es como se supone que funcionan las cosas. Un RAID no es una garant&iacute;a
para la integridad de datos, simplemente le permite conservar sus datos si
un disco muere (naturalmente, con RAIDs de niveles iguales o superiores a
1).
<P>
<P>
<HR>
<A HREF="Software-RAID.HOWTO-6.html">Página siguiente</A>
<A HREF="Software-RAID.HOWTO-4.html">Página anterior</A>
<A HREF="Software-RAID.HOWTO.html#toc5">Índice general</A>
</BODY>
</HTML>
