<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>RAID-Software C&Oacute;MO: Configuraci&oacute;n de RAID</TITLE>
 <LINK HREF="Software-RAID.HOWTO-5.html" REL=next>
 <LINK HREF="Software-RAID.HOWTO-3.html" REL=previous>
 <LINK HREF="Software-RAID.HOWTO.html#toc4" REL=contents>
</HEAD>
<BODY>
<A HREF="Software-RAID.HOWTO-5.html">Página siguiente</A>
<A HREF="Software-RAID.HOWTO-3.html">Página anterior</A>
<A HREF="Software-RAID.HOWTO.html#toc4">Índice general</A>
<HR>
<H2><A NAME="s4">4. Configuraci&oacute;n de RAID</A></H2>

<P>
<H2><A NAME="ss4.1">4.1 Configuraci&oacute;n general</A>
</H2>

<P>Esto es lo que necesita para cualquiera de los niveles RAID:
<UL>
<LI>Un n&uacute;cleo.  Obtenga la versi&oacute;n 2.0.36 o un n&uacute;cleo 2.2.x reciente.</LI>
<LI>Los parches RAID.  Normalmente existe un parche disponible para los
n&uacute;cleos recientes.</LI>
<LI>El paquete de herramientas RAID (raidtools).</LI>
<LI>Paciencia, una pizza y su bebida con cafe&iacute;na favorita.</LI>
</UL>
<P>Todo este software se puede encontrar en <CODE>ftp://ftp.fi.kernel.org/pub/linux</CODE>. Las herramientas RAID y
los parches est&aacute;n en el subdirectorio <CODE>daemons/raid/alpha</CODE>. Los n&uacute;cleos
se encuentran en el subdirectorio <CODE>kernel</CODE>.
<P>Parchee el n&uacute;cleo, config&uacute;relo para incluir el soporte del nivel RAID que
quiera usar. Comp&iacute;lelo e inst&aacute;lelo.
<P>A continuaci&oacute;n desempaquete, configure, compile e instale las herramientas
RAID.
<P>Vale, hasta ahora todo va bien. Si rearranca ahora, deber&iacute;a tener un fichero
llamado <CODE>/proc/mdstat</CODE>. Recu&eacute;rdelo, ese fichero es su amigo. Vea lo que contiene
haciendo un <CODE>cat </CODE><CODE>/proc/mdstat</CODE>. Le debe decir que tiene registrada la
personalidad RAID (es decir, el modo RAID) correcta y que actualmente no hay
dispositivos RAID activos.
<P>Cree las particiones que quiere incluir en su grupo RAID.
<P>Ahora, vayamos a un modo espec&iacute;fico.
<P>
<P>
<H2><A NAME="ss4.2">4.2 Modo lineal</A>
</H2>

<P>De acuerdo, as&iacute; que tiene dos o m&aacute;s particiones que no son necesariamente
del mismo tama&ntilde;o (pero que, naturalmente, pueden serlo) que quiere adjuntar
unas con otras.
<P>Prepare el fichero <CODE>/etc/raidtab</CODE> para describir su configuraci&oacute;n. He preparado
un raditab para dos discos en modo lineal y el fichero se parece a esto:
<P>
<PRE>
raiddev /dev/md0
        raid-level      linear
        nr-raid-disks   2
        persistent-superblock 1
        device          /dev/sdb6
        raid-disk       0
        device          /dev/sdc5
        raid-disk       1
</PRE>

Aqu&iacute; no se soportan discos de reserva. Si un disco muere, el array muere con
&eacute;l. No hay informaci&oacute;n que poner en un disco de reserva.
<P>Vale, creemos el array. Ejecute la orden
<PRE>
  mkraid /dev/md0
</PRE>
<P>Esto inicializar&aacute; su array, escribir&aacute; los superbloques persistentes y
arrancar&aacute; el array.
<P>&Eacute;chele un vistazo a <CODE>/proc/mdstat</CODE>. Debe ver que el array est&aacute; funcionando.
<P>Ahora, puede crear un sistema de ficheros, justo como har&iacute;a con
cualquier otro dispositivo, montarlo, incluirlo en su fstab, etc. 
<P>
<P>
<H2><A NAME="ss4.3">4.3 RAID-0</A>
</H2>

<P>Tiene dos o m&aacute;s dispositivos, de aproximadamente el mismo tama&ntilde;o, y quiere
combinar sus capacidades de almacenamiento y tambi&eacute;n combinar sus
rendimientos accedi&eacute;ndolos en paralelo.
<P>Prepare el fichero <CODE>/etc/raidtab</CODE> para describir su configuraci&oacute;n. Un raidtab de
ejemplo se parece a esto:
<PRE>
raiddev /dev/md0
        raid-level      0
        nr-raid-disks   2
        persistent-superblock 1
        chunk-size     4
        device          /dev/sdb6
        raid-disk       0
        device          /dev/sdc5
        raid-disk       1
</PRE>

Como en el modo lineal, los discos de reserva tampoco se soportan aqu&iacute;.
Un RAID-0 no tiene redundancia, por lo que cuando un disco muere, el array
le acompa&ntilde;a.
<P>Una vez m&aacute;s, ejecute simplemente
<PRE>
  mkraid /dev/md0
</PRE>

para inicializar el array. Esto debe inicializar los superbloques y poner en
funcionamiento el dispositivo RAID. &Eacute;che un vistazo a <CODE>/proc/mdstat</CODE> para ver qu&eacute;
sucede. Deber&iacute;a ver que su dispositivo ahora est&aacute; en funcionamiento.
<P>Ahora, /dev/md0 est&aacute; listo para ser formateado, montado, usado y maltratado.
<P>
<P>
<H2><A NAME="ss4.4">4.4 RAID-1</A>
</H2>

<P>Tiene dos dispositivos de aproximadamente el mismo tama&ntilde;o y quiere que cada
uno de los dos sea un duplicado del otro. Finalmente, tiene m&aacute;s dispositivos
que quiere guardar como discos de reserva preparados, que autom&aacute;ticamente
formar&aacute;n parte del duplicado si uno de los dispositivos activos se rompe.
<P>Configure el fichero <CODE>/etc/raidtab</CODE> as&iacute;:
<PRE>
raiddev /dev/md0
        raid-level      1
        nr-raid-disks   2
        nr-spare-disks  0
        chunk-size      4
        persistent-superblock 1
        device          /dev/sdb6
        raid-disk       0
        device          /dev/sdc5
        raid-disk       1
</PRE>

Si tiene discos de reserva, puede a&ntilde;adirlos al final de la especificaci&oacute;n de
dispositivos como
<PRE>
        device          /dev/sdd5
        spare-disk      0
</PRE>

Recuerde configurar la entrada <CODE>nr-spare-disks</CODE> adecuadamente.
<P>De acuerdo, ahora estamos listos para comenzar la inicializaci&oacute;n del RAID.
Se debe construir el duplicado, es decir, los contenidos (de todos modos,
sin importancia ahora, ya que el dispositivo todav&iacute;a est&aacute; sin formatear) de
los dos dispositivos se deben sincronizar.
<P>D&eacute; la orden
<PRE>
  mkraid /dev/md0
</PRE>

para comenzar la inicializaci&oacute;n del duplicado.
<P>Compruebe el fichero <CODE>/proc/mdstat</CODE>. Debe decirle que se ha puesto en
funcionamiento el dispositivo /dev/md0, que est&aacute; siendo reconstruido el
duplicado y una cuenta del tiempo estimado para la terminaci&oacute;n de la
reconstrucci&oacute;n.
<P>La reconstrucci&oacute;n se realiza usando el ancho de banda ocioso de E/S. De esta
manera, su sistema todav&iacute;a deber&iacute;a ser capaz de responder en gran medida,
aunque los LEDs de sus discos deben estar bonitamente resplandecientes.
<P>El proceso de reconstrucci&oacute;n es transparente, por lo que realmente puede
usar el dispositivo aunque la duplicaci&oacute;n est&eacute; actualmente en
reconstrucci&oacute;n.
<P>Intente formatear el dispositivo mientras la reconstrucci&oacute;n se est&eacute;
realizando. Funcionar&aacute;. Tambi&eacute;n puede montarlo y usarlo mientras la
reconstrucci&oacute;n se est&eacute; realizando. Naturalmente, si el disco equivocado
se rompe mientras se est&aacute; realizando la reconstrucci&oacute;n, no hay soluci&oacute;n.
<P>
<P>
<H2><A NAME="ss4.5">4.5 RAID-4</A>
</H2>

<P>-
<B>¡Nota!</B> No he comprobado esta configuraci&oacute;n por m&iacute; mismo. La
configuraci&oacute;n de m&aacute;s abajo es mi mejor suposici&oacute;n, no algo que realmente haya
tenido funcionando.
<P>Tiene tres o m&aacute;s dispositivos de aproximadamente el mismo tama&ntilde;o, un
dispositivo es significativamente m&aacute;s r&aacute;pido que los otros dispositivos y
quiere combinarlos todos en un &uacute;nico dispositivo m&aacute;s grande, conservando
todav&iacute;a alguna informaci&oacute;n de redundancia. Finalmente, tiene varios
dispositivos que desea usar como discos de reserva.
<P>Configure el fichero /etc/raidtab as&iacute;:
<PRE>
raiddev /dev/md0
        raid-level      4
        nr-raid-disks   4
        nr-spare-disks  0
        persistent-superblock 1
        chunk-size      32
        device          /dev/sdb1
        raid-disk       0
        device          /dev/sdc1
        raid-disk       1
        device          /dev/sdd1
        raid-disk       2
        device          /dev/sde1
        raid-disk       3
</PRE>

Si tuvi&eacute;ramos discos de reserva, se insertar&iacute;an de forma parecida, siguiendo
las especificaciones de discos RAID;
<PRE>
        device         /dev/sdf1
        spare-disk     0
</PRE>

como de costumbre.
<P>Su array se puede inicializar con la orden
<PRE>
   mkraid /dev/md0
</PRE>

como es habitual.
<P>Deber&iacute;a ver la secci&oacute;n de opciones especiales de mke2fs antes de formatear
el dispositivo.
<P>
<P>
<P>
<H2><A NAME="ss4.6">4.6 RAID-5</A>
</H2>

<P>Tiene tres o m&aacute;s dispositivos de aproximadamente el mismo tama&ntilde;o, quiere
combinarlos en un dispositivo mayor, pero conservando todav&iacute;a cierto grado
de redundancia para la seguridad de datos. Finalmente, tiene varios
dispositivos para usar como discos de reserva, que no tomar&aacute;n parte en el
array antes de que otro dispositivo falle.
<P>Si usa N dispositivos donde el tama&ntilde;o del m&aacute;s peque&ntilde;o es S, el tama&ntilde;o de todo
el array ser&aacute; (N-1)*S. El espacio ``faltante'' se usa para informaci&oacute;n
de paridad (redundancia). De esta manera, si cualquier disco falla, todos
los datos permanecer&aacute;n intactos. Pero si dos discos fallan, todos los datos
se perder&aacute;n.
<P>Configure el fichero /etc/raidtab as&iacute;:
<PRE>
raiddev /dev/md0
        raid-level      5
        nr-raid-disks   7
        nr-spare-disks  0
        persistent-superblock 1
        parity-algorithm        left-symmetric
        chunk-size      32
        device          /dev/sda3
        raid-disk       0
        device          /dev/sdb1
        raid-disk       1
        device          /dev/sdc1
        raid-disk       2
        device          /dev/sdd1
        raid-disk       3
        device          /dev/sde1
        raid-disk       4
        device          /dev/sdf1
        raid-disk       5
        device          /dev/sdg1
        raid-disk       6
</PRE>

Si tuvi&eacute;ramos discos de reserva, se insertar&iacute;an de forma parecida, siguiendo
las especificaciones de discos RAID;
<PRE>
        device         /dev/sdh1
        spare-disk     0
</PRE>

Y as&iacute; sucesivamente.
<P>Un tama&ntilde;o de porci&oacute;n de 32KB es un buen valor por defecto para muchos
sistemas de ficheros de prop&oacute;sito general de este tama&ntilde;o. El array sobre el
que se utiliza el raidtab anterior es un dispositivo de 7 por 6 GB = 36 GB
(recuerde que (N-1)*S = (7-1)*6 = 36). Contiene un sistema de ficheros ext2
con un tama&ntilde;o de bloque de 4KB. Podr&iacute;a incrementar tanto el tama&ntilde;o de
porci&oacute;n del array como el tama&ntilde;o de bloque del sistema de ficheros si
su sistema de ficheros fuera o bien mucho mayor o bien si simplemente
contuviera ficheros muy grandes.
<P>Vale, ya hemos hablado bastante. Configure el fichero raidtab y
veamos si funciona. Ejecute la orden
<PRE>
  mkraid /dev/md0
</PRE>

y observe qu&eacute; ocurre. Es de esperar que sus discos comiencen a trabajar como
locos debido a que empiezan la reconstrucci&oacute;n de su array. &Eacute;chele un
vistazo  a <CODE>/proc/mdstat</CODE> para ver qu&eacute; est&aacute; sucediendo.
<P>Si el dispositivo se ha creado correctamente, el proceso de reconstrucci&oacute;n
comenzar&aacute; ahora. Su array no ser&aacute; consistente hasta que esta fase de
reconstrucci&oacute;n haya terminado. No obstante, el array es totalmente funcional
(excepto, por supuesto, para el manejo de fallos de dispositivos) y puede
formatearlo y usarlo incluso mientras se est&eacute; reconstruyendo.
<P>Consulte la secci&oacute;n de opciones especiales de mke2fs antes de formatear el
array.
<P>Bueno, ahora que ya tiene su dispositivo RAID funcionando, siempre puede
pararlo o rearrancarlo usando las &oacute;rdenes
<PRE>
  raidstop /dev/md0
</PRE>

y
<PRE>
  raidstart /dev/md0,
</PRE>

respectivamente.
<P>En lugar de colocar &eacute;stos en ficheros de inicio y rearrancar un n&uacute;mero
astron&oacute;mico de veces hasta hacer que funcione, siga leyendo y haga funcionar
la autodetecci&oacute;n.
<P>
<P>
<H2><A NAME="ss4.7">4.7 El superbloque persistente</A>
</H2>

<P>Volviendo a los ``buenos viejos tiempos'' (``The Good Old Days'' (TM)),
las herramientas RAID (raidtools) leer&iacute;an su fichero <CODE>/etc/raidtab</CODE> y a
continuaci&oacute;n inicializar&iacute;an el array. Sin embargo, esto requerir&iacute;a que el
sistema de ficheros sobre el que reside <CODE>/etc/raidtab</CODE> estuviera montado. Esto
es desafortunado si quiere arrancar a partir de un RAID.
<P>Tambi&eacute;n, la anterior aproximaci&oacute;n produc&iacute;a complicaciones al montar
sistemas de ficheros sobre dispositivos RAID. &Eacute;stos no se pod&iacute;an colocar en
el fichero <CODE>/etc/fstab</CODE> como era usual, sino que ten&iacute;an que ser montados en los
guiones de inicio.
<P>Los superbloques persistentes solucionan estos problemas. Cuando un array se
inicializa con la opci&oacute;n <CODE>persistent-superblock</CODE> en el fichero
<CODE>/etc/raidtab</CODE>, se escribe un superbloque especial al principio de todos los
discos participantes en el array. Esto permite al n&uacute;cleo leer la
configuraci&oacute;n de los dispositivos RAID directamente de los discos
involucrados, en lugar de leerla de alg&uacute;n fichero de configuraci&oacute;n que puede
no estar disponible en todo momento.
<P>Sin embargo, todav&iacute;a deber&iacute;a mantener un fichero <CODE>/etc/raidtab</CODE> consistente, ya que
puede necesitar este fichero para una reconstrucci&oacute;n posterior del array.
<P>Los superbloques persistentes son obligatorios si desea la autodetecci&oacute;n de
sus dispositivos RAID durante el arranque del sistema. Esto se describe en
la secci&oacute;n <B>Autodetecci&oacute;n</B>.
<P>
<P>
<H2><A NAME="ss4.8">4.8 Tama&ntilde;os de porci&oacute;n</A>
</H2>

<P>El tama&ntilde;o de porci&oacute;n merece una explicaci&oacute;n. Nunca puede escribir de forma
totalmente paralela a un grupo de discos. Si tuviera dos discos y quisiera
escribir un byte, tendr&iacute;a que escribir cuatro bits en cada disco; realmente,
todos los segundos bits ir&iacute;an al disco 0 y los otros al disco 1.
Sencillamente, el hardware no soporta eso. En su lugar, elegimos alg&uacute;n
tama&ntilde;o de porci&oacute;n que definimos como la masa ``at&oacute;mica'' m&aacute;s peque&ntilde;a de datos
que puede ser escrita en los dispositivos. Una escritura de 16 KB con un
tama&ntilde;o de porci&oacute;n de 4 KB provocar&iacute;a que la primera y tercera porci&oacute;n de 4KB
se escribieran en el primer disco y la segunda y el cuarta porci&oacute;n en el
segundo, en el caso de un RAID-0 de dos discos. De esta manera, para grandes
escrituras, podr&iacute;a observar una sobrecarga m&aacute;s peque&ntilde;a teniendo porciones lo
bastante grandes, mientras que los arrays que contuvieran principalmente
ficheros peque&ntilde;os se podr&iacute;an beneficiar m&aacute;s de un tama&ntilde;o de porci&oacute;n m&aacute;s
peque&ntilde;o.
<P>Los tama&ntilde;os de porci&oacute;n se pueden especificar para todos los niveles de RAID
excepto para el modo lineal.
<P>Para un rendimiento &oacute;ptimo, deber&iacute;a experimentar con el valor, as&iacute; como con
el tama&ntilde;o de bloque del sistema de ficheros que pusiera en el array.
<P>El argumento de la opci&oacute;n <CODE>chunk-size</CODE> en <CODE>/etc/raidtab</CODE> especifica el
tama&ntilde;o de porci&oacute;n en kilobytes. Por tanto, ``4'' significa ``4 KB''.
<P>
<H3>RAID-0</H3>

<P>Los datos se escriben ``casi'' en paralelo en todos los discos del array.
Realmente, se escriben <CODE>chunk-size</CODE> bytes en cada disco, de forma
consecutiva.
<P>Si especifica un tama&ntilde;o de porci&oacute;n de 4 KB y escribe 16 KB a un array de 3
discos, el sistema RAID escribir&aacute; 4 KB a los discos 0, 1 y 2, en paralelo, y
a continuaci&oacute;n los 4 KB restantes al disco 0.
<P>Un tama&ntilde;o de porci&oacute;n de 32 KB es un punto de inicio razonable para la mayor&iacute;a
de los arrays. Pero el valor &oacute;ptimo depende much&iacute;simo del n&uacute;mero de discos
implicados, del contenido del sistema de ficheros que coloca y de muchos
otros factores. Experimente con &eacute;l para obtener el mejor rendimiento.
<P>
<H3>RAID-1</H3>

<P>Para las escrituras, el tama&ntilde;o de porci&oacute;n no afecta al array, ya que se deben
escribir todos los datos a todos los discos sin importar qu&eacute;. Para las
lecturas, sin embargo, el tama&ntilde;o de porci&oacute;n indica cu&aacute;ntos datos leer
consecutivamente de los discos participantes. Ya que todos los discos activos
del array contienen la misma informaci&oacute;n, las lecturas se pueden hacer en
paralelo al estilo de un RAID-0.
<P>
<H3>RAID-4</H3>

<P>Cuando se realiza una escritura en un array RAID-4, tambi&eacute;n se debe
actualizar la informaci&oacute;n de paridad en el disco de paridad. El tama&ntilde;o de
porci&oacute;n es el tama&ntilde;o de los bloques de paridad. Si se escribe un byte a un
array RAID-4, entonces se leer&aacute;n <CODE>chunk-size</CODE> bytes de los N-1
discos, se calcular&aacute; la informaci&oacute;n de paridad y se escribir&aacute;n
<CODE>chunk-size</CODE> bytes al disco de paridad.
<P>El tama&ntilde;o de porci&oacute;n afecta al rendimiento de las lecturas de la misma manera
que en un RAID-0, ya que las lecturas de un RAID-4 se realizan de la misma
forma.
<P>
<H3>RAID-5</H3>

<P>En RAID-5 el tama&ntilde;o de porci&oacute;n tiene exactamente el mimo significado que en un
RAID-4.
<P>Un tama&ntilde;o de porci&oacute;n razonable para un RAID-5 es 128 KB pero, como siempre,
puede desear experimentar con &eacute;ste.
<P>Tambi&eacute;n consulte la secci&oacute;n de opciones especiales de mke2fs. Esto afecta al
rendimiento de un RAID-5.
<P>
<P>
<H2><A NAME="ss4.9">4.9 Opciones de mke2fs</A>
</H2>

<P>Hay disponible una opci&oacute;n especial cuando se formatean dispositivos RAID-4 y
RAID-5 con mke2fs. La opci&oacute;n <CODE>-R stride=nn</CODE> permitir&aacute; a mke2fs
situar mejor diferentes estructuras de datos espec&iacute;ficas de ext2 en un
dispositivo RAID de forma inteligente.
<P>Si el tama&ntilde;o de porci&oacute;n es 32 KB significa que 32 KB de datos consecutivos
residir&aacute;n en un &uacute;nico disco. Si queremos construir un sistema de ficheros
ext2 con un tama&ntilde;o de bloque de 4KB, nos damos cuenta de que habr&aacute; 8 bloques
del sistema de ficheros en una porci&oacute;n del array. Podemos pasar esta
informaci&oacute;n a la utilidad mke2fs cuando se cree el sistema de ficheros:
<PRE>
  mke2fs -b 4096 -R stride=8 /dev/md0
</PRE>
<P>El rendimiento de un RAID-{4,5} se ve fuertemente influido por esta opci&oacute;n. No
estoy seguro de c&oacute;mo la opci&oacute;n <CODE>stride</CODE> afectar&aacute; a otros niveles
RAID. Si alguien tiene informaci&oacute;n sobre esto, por favor, que la env&iacute;e a mi
direcci&oacute;n.
<P>
<P>
<H2><A NAME="ss4.10">4.10 Autodetecci&oacute;n</A>
</H2>

<P>La autodetecci&oacute;n permite a los dispositivos RAID ser autom&aacute;ticamente
reconocidos por el n&uacute;cleo durante el arranque, justo despu&eacute;s de que se
realice la detecci&oacute;n ordinaria de particiones.
<P>Esto requiere varias cosas:
<OL>
<LI>Necesita soporte para autodetecci&oacute;n en el n&uacute;cleo. Compruebe esto</LI>
<LI>Debe haber creado los dispositivos RAID usando superbloques
persistentes</LI>
<LI>El tipo de partici&oacute;n de los dispositivos usados en el RAID se debe
establecer a <B>0xFD</B>  (use fdisk y establezca el tipo a ``fd'')</LI>
</OL>
<P>NOTA: aseg&uacute;rese de que su RAID NO EST&Aacute; FUNCIONANDO antes de cambiar los
tipos de las particiones. Use <CODE>raidstop /dev/md0</CODE> para parar el
dispositivo.
<P>Si sigue los pasos 1, 2 y 3 de arriba, la autodetecci&oacute;n deber&iacute;a activarse.
Pruebe rearrancar. Cuando el sistema se levante, vea el contenido de
<CODE>/proc/mdstat</CODE>; deber&iacute;a decirle que su RAID est&aacute; funcionando.
<P>Durante el arranque, podr&iacute;a ver mensajes similares a estos:
<PRE>
 Oct 22 00:51:59 malthe kernel: SCSI device sdg: hdwr sector= 512
  bytes. Sectors= 12657717 [6180 MB] [6.2 GB]
 Oct 22 00:51:59 malthe kernel: Partition check:
 Oct 22 00:51:59 malthe kernel:  sda: sda1 sda2 sda3 sda4
 Oct 22 00:51:59 malthe kernel:  sdb: sdb1 sdb2
 Oct 22 00:51:59 malthe kernel:  sdc: sdc1 sdc2
 Oct 22 00:51:59 malthe kernel:  sdd: sdd1 sdd2
 Oct 22 00:51:59 malthe kernel:  sde: sde1 sde2
 Oct 22 00:51:59 malthe kernel:  sdf: sdf1 sdf2
 Oct 22 00:51:59 malthe kernel:  sdg: sdg1 sdg2
 Oct 22 00:51:59 malthe kernel: autodetecting RAID arrays
 Oct 22 00:51:59 malthe kernel: (read) sdb1's sb offset: 6199872
 Oct 22 00:51:59 malthe kernel: bind&lt;sdb1,1>
 Oct 22 00:51:59 malthe kernel: (read) sdc1's sb offset: 6199872
 Oct 22 00:51:59 malthe kernel: bind&lt;sdc1,2>
 Oct 22 00:51:59 malthe kernel: (read) sdd1's sb offset: 6199872
 Oct 22 00:51:59 malthe kernel: bind&lt;sdd1,3>
 Oct 22 00:51:59 malthe kernel: (read) sde1's sb offset: 6199872
 Oct 22 00:51:59 malthe kernel: bind&lt;sde1,4>
 Oct 22 00:51:59 malthe kernel: (read) sdf1's sb offset: 6205376
 Oct 22 00:51:59 malthe kernel: bind&lt;sdf1,5>
 Oct 22 00:51:59 malthe kernel: (read) sdg1's sb offset: 6205376
 Oct 22 00:51:59 malthe kernel: bind&lt;sdg1,6>
 Oct 22 00:51:59 malthe kernel: autorunning md0
 Oct 22 00:51:59 malthe kernel: running: &lt;sdg1>&lt;sdf1>&lt;sde1>&lt;sdd1>&lt;sdc1>&lt;sdb1>
 Oct 22 00:51:59 malthe kernel: now!
 Oct 22 00:51:59 malthe kernel: md: md0: raid array is not clean --
  starting background reconstruction 
</PRE>

Esta es la salida de la autodetecci&oacute;n de un array RAID-5 que no fue
limpiamente desactivado (es decir, la m&aacute;quina se cay&oacute;). La reconstrucci&oacute;n se
inicia autom&aacute;ticamente. Montar este dispositivo es perfectamente seguro, ya
que la reconstrucci&oacute;n es transparente y todos los datos son consistentes
(s&oacute;lo es la informaci&oacute;n de paridad la que es inconsistente - aunque la misma
no se necesita hasta que un dispositivo falle).
<P>Los dispositivos autoarrancados tambi&eacute;n son autom&aacute;ticamente parados durante
el cierre del sistema. No se preocupe de los guiones de inicio. Simplemente,
use los dispositivos /dev/md como cualquier otro dispositivo /dev/sd o
/dev/hd.
<P>S&iacute;, verdaderamente es as&iacute; de f&aacute;cil.
<P>Quiz&aacute;s desee buscar cualquier orden raidstart/raidstop en sus guiones de
inicio. &Eacute;stas suelen encontrarse en los guiones de inicio est&aacute;ndares de
RedHat. Se usan para el antiguo estilo de RAID y no tienen utilidad en el nuevo
estilo de RAID con autodetecci&oacute;n. Simplemente, elimine las l&iacute;neas y todo
ir&aacute; perfectamente bien.
<P>
<P>
<H2><A NAME="ss4.11">4.11 Arrancar desde un RAID</A>
</H2>

<P>Existen varias formas de configurar un sistema que monta su sistema de
ficheros ra&iacute;z sobre un dispositivo RAID. Desafortunadamente, ninguna de las
distribuciones de Linux con las que yo he probado (RedHat y Debian) soportan 
un dispositivo RAID como dispositivo del sistema de ficheros ra&iacute;z durante el
proceso de instalaci&oacute;n. Por tanto, le va a doler un poco si quiere
esto pero, de hecho, es posible.
<P>Actualmente, LILO no maneja dispositivos RAID y ,por ello, no se puede
cargar el n&uacute;cleo desde un dispositivo RAID en el instante del arranque. Su
sistema de ficheros <CODE>/boot</CODE> tendr&aacute; que residir en un dispositivo que
no sea RAID. Un modo de asegurar que su sistema arranca, pase lo que pase, es
crear particiones <CODE>/boot</CODE> similares en todas las unidades de su RAID,
de esa forma la BIOS siempre puede cargar datos desde, por ejemplo, la
primera unidad disponible. Esto necesita que no arranque con un disco
defectuoso en su sistema.
<P>Otra forma de asegurar que su sistema siempre arranca es crear un disquete de
arranque cuando toda la configuraci&oacute;n se haya terminado. Si muere el disco en
el que reside el sistema de ficheros <CODE>/boot</CODE>, siempre puede arrancar
desde el disquete.
<P>
<H3>M&eacute;todo 1</H3>

<P>Este m&eacute;todo asume que posee un disco de reserva en el que puede instalar el
sistema y que no es parte del RAID que configurar&aacute; m&aacute;s adelante.
<P>
<UL>
<LI>Primero, instale un sistema normal en su disco extra.</LI>
<LI>Obtenga el n&uacute;cleo que piensa ejecutar, obtenga los parches y las
herramientas RAID y haga que su sistema arranque con el nuevo n&uacute;cleo con
soporte RAID. Aseg&uacute;rese de que el soporte RAID est&aacute; <B>dentro</B> del
n&uacute;cleo y que no se carga como m&oacute;dulo.</LI>
<LI>Vale, ahora debe configurar y crear el RAID que tiene pensado usar
para el sistema de ficheros ra&iacute;z. &Eacute;ste es un procedimiento est&aacute;ndar como ya
se describi&oacute; en otra parte de este documento.</LI>
<LI>Simplemente para asegurarse de que todo est&aacute; bien, trate de rearrancar
el sistema para ver si el nuevo RAID aparece durante el arranque. Deber&iacute;a
aparecer.</LI>
<LI> Coloque un sistema de ficheros sobre el nuevo array (usando
<CODE>mke2fs</CODE>), y m&oacute;ntelo en /mnt/newroot.</LI>
<LI>Ahora, copie el contenido de su sistema de ficheros ra&iacute;z actual (el
disco extra) al nuevo sistema de ficheros ra&iacute;z (el array). Hay muchas formas
de hacer esto. Una de ellas es
<PRE>
 cd /
 find . -xdev | cpio -pm /mnt/newroot
</PRE>
</LI>
<LI>Debe modificar el fichero <CODE>/mnt/newroot/etc/fstab</CODE> para usar el
dispositivo correcto (el dispositivo ra&iacute;z <CODE>/dev/md?</CODE>) para el sistema
de ficheros ra&iacute;z.</LI>
<LI>Ahora, desmonte el sistema de ficheros <CODE>/boot</CODE> actual y m&oacute;ntelo
en su lugar en <CODE>/mnt/newroot/boot</CODE>. Esto es necesario para que LILO
funcione correctamente en el siguiente paso.</LI>
<LI>Actualice <CODE>/mnt/newroot/etc/lilo.conf</CODE> para que apunte a los
dispositivos correctos. El dispositivo de arranque debe ser todav&iacute;a un disco
normal (no un dispositivo RAID) pero el dispositivo ra&iacute;z debe apuntar a su
nuevo RAID. Cuando est&eacute; hecho, ejecute 
<PRE>
 lilo -r /mnt/newroot
</PRE>

Esta ejecuci&oacute;n de LILO deber&iacute;a terminar sin errores.</LI>
<LI>Rearranque el sistema y observe que todo aparece como se esperaba :)</LI>
</UL>
<P>Si est&aacute; haciendo esto con discos IDE, aseg&uacute;rese de indicarle a su BIOS que
todos los discos son del tipo ``auto-detect'', as&iacute; la BIOS permitir&aacute; a su
m&aacute;quina arrancar incluso cuando un disco haya fallado.
<P>
<H3>M&eacute;todo 2</H3>

<P>Este m&eacute;todo necesita que parchee su paquete raidtools para poder incluir la
directiva <CODE>failed-disk</CODE> en <CODE>/etc/raidtab</CODE>. Busque en los archivos de la
lista de correo Linux-raid los mensajes enviados por Martin Bene, alrededor
del 23 de abril de 1999, donde se envi&oacute; el parche <CODE>failed-disk</CODE>.
Se espera que esta funcionalidad est&eacute; pronto en el paquete raidtools
(para cuando est&eacute; leyendo esto puede que incluso no necesite parchear las
raidtools).
<P><B>S&oacute;lo</B> puede utilizar este m&eacute;todo en RAIDs de niveles 1 o superiores.
La idea es instalar un sistema sobre un disco que es adrede marcado como
estropeado en el RAID, copiar a continuaci&oacute;n el sistema en el RAID que
estar&aacute; funcionando en modo degrado y finalmente hacer que el RAID use el ya
no necesario ``disco de instalaci&oacute;n'', aniquilando la anterior instalaci&oacute;n
pero haciendo que el RAID funcione en modo no degradado.
<P>
<UL>
<LI>Primero, instale un sistema normal sobre un disco (que m&aacute;s tarde
formar&aacute; parte de su RAID). ¡Es importante que este disco (o partici&oacute;n) no sea
el m&aacute;s peque&ntilde;o. Si lo es, no ser&aacute; posible a&ntilde;adirlo al RAID m&aacute;s tarde!</LI>
<LI>A continuaci&oacute;n, obtenga el n&uacute;cleo, los parches, las herramientas,
etc., etc. Ya conoce el ejercicio. Haga que su sistema arranque con un nuevo
n&uacute;cleo que tenga el soporte RAID que necesita compilado dentro del n&uacute;cleo.</LI>
<LI>Ahora, configure el RAID con su dispositivo ra&iacute;z actual como el
<CODE>failed-disk</CODE> (disco estropeado) en el fichero <CODE>raidtab</CODE>. No
coloque el <CODE>failed-disk</CODE> como el primer disco en el fichero
<CODE>raidtab</CODE>, eso le dar&aacute; problemas para poner en marcha el RAID. Cree el
RAID y coloque un sistema de ficheros en &eacute;l.</LI>
<LI>Pruebe a rearrancar y vea si el RAID aparece como deber&iacute;a
hacerlo.</LI>
<LI>Copie los ficheros del sistema y reconfigure el sistema para usar el
RAID como dispositivo ra&iacute;z, como se ha descrito en la secci&oacute;n anterior.</LI>
<LI>Cuando su sistema arranque con &eacute;xito desde el RAID, puede modificar el
fichero <CODE>raidtab</CODE> para incluir el <CODE>failed-disk</CODE> anterior como
un disco <CODE>raid-disk</CODE> normal. Ahora, ejecute <CODE>raidhotadd</CODE> para
a&ntilde;adir el disco a su sistema RAID.</LI>
<LI>Ahora deber&iacute;a tener un sistema capaz de arrancar desde un RAID no
degradado.</LI>
</UL>
<P>
<P>
<P>
<H2><A NAME="ss4.12">4.12 Dificultades</A>
</H2>

<P>Nunca NUNCA <B>nunca</B> reparticione discos que son parte de un RAID que
est&aacute; funcionando. Si debe alterar la tabla de particiones de un disco que es
parte de un RAID, pare primero el array y despu&eacute;s reparticione.
<P>Es f&aacute;cil poner demasiados discos en un bus. Un bus Fast-Wide SCSI normal
puede sostener 10 MB/s que es menos de lo que muchos discos pueden obtener por
s&iacute; solos hoy en d&iacute;a. Por supuesto, colocar seis de tales discos en un bus no
le proporcionar&aacute; el aumento de rendimiento esperado.
<P>La mayor&iacute;a de los controladores SCSI s&oacute;lo le proporcionar&aacute;n un rendimiento
extra si los buses SCSI son llevados pr&aacute;cticamente al m&aacute;ximo por los discos
conectados a ellos. No observar&aacute; una mejora de rendimiento por usar dos
controladores 2940 con dos viejos discos SCSI en lugar de simplemente hacer
funcionar los dos discos sobre un &uacute;nico controlador.
<P>Si olvida la opci&oacute;n <CODE>persistent-superblock</CODE> puede que su array no
arranque por las buenas despu&eacute;s de que haya sido parado. Simplemente, recree
el array con la opci&oacute;n colocada correctamente en el fichero raidtab.
<P>Si un RAID-5 no logra reconstruirse despu&eacute;s de que un disco haya sido
eliminado y reinsertado, puede deberse al orden de los dispositivos en el
fichero raidtab. Intente mover el primer par ``device''--``raid-disk''
al final de la descripci&oacute;n del array en el fichero raidtab.
<P>
<P>
<HR>
<A HREF="Software-RAID.HOWTO-5.html">Página siguiente</A>
<A HREF="Software-RAID.HOWTO-3.html">Página anterior</A>
<A HREF="Software-RAID.HOWTO.html#toc4">Índice general</A>
</BODY>
</HTML>
