<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>RAID-Software C&Oacute;MO: ¿Por qu&eacute; RAID?</TITLE>
 <LINK HREF="Software-RAID.HOWTO-3.html" REL=next>
 <LINK HREF="Software-RAID.HOWTO-1.html" REL=previous>
 <LINK HREF="Software-RAID.HOWTO.html#toc2" REL=contents>
</HEAD>
<BODY>
<A HREF="Software-RAID.HOWTO-3.html">Página siguiente</A>
<A HREF="Software-RAID.HOWTO-1.html">Página anterior</A>
<A HREF="Software-RAID.HOWTO.html#toc2">Índice general</A>
<HR>
<H2><A NAME="s2">2. ¿Por qu&eacute; RAID?</A></H2>

<P>Puede haber muchas buenas razones para usar RAID. Unas pocas son: la
posibilidad de combinar varios discos f&iacute;sicos en un &uacute;nico dispositivo 
``virtual'' m&aacute;s grande, mejoras en el rendimiento y redundancia.
<P>
<P>
<H2><A NAME="ss2.1">2.1 Detalles t&eacute;cnicos</A>
</H2>

<P>El RAID de Linux puede funcionar sobre la mayor&iacute;a de los dispositivos de
bloques. No importa si usa dispositivos IDE, SCSI o una mezcla de ambos.
Incluso algunas personas han usado el dispositivo de bloques de red (Network
Block Device, NBD) con m&aacute;s o menos &eacute;xito.
<P>Aseg&uacute;rese de que el bus (o buses) de los discos son lo suficientemente
r&aacute;pidos. No deber&iacute;a tener 14 discos UW-SCSI en un &uacute;nico bus UW, si cada
disco puede dar 10MB/s y el bus s&oacute;lo puede sostener 40MB/s.
Adem&aacute;s, s&oacute;lo deber&iacute;a tener un dispositivo por bus IDE. El uso de discos
como maestro/esclavo es horrible para el rendimiento. IDE es realmente
malo accediendo a m&aacute;s de un disco por bus. Naturalmente, todas las placas
madre modernas tienen dos buses IDE, por lo que puede configurar dos discos
en RAID sin comprar m&aacute;s tarjetas controladoras.
<P>La capa RAID no tiene absolutamente nada que ver con la capa del sistema de
ficheros. Puede poner cualquier sistema de ficheros sobre un dispositivo
RAID, justo como con cualquier otro dispositivo de bloques.
<P>
<P>
<H2><A NAME="ss2.2">2.2 T&eacute;rminos</A>
</H2>

<P>La palabra ``RAID'' significa ``RAID software de Linux''. Este C&Oacute;MO no trata
ning&uacute;n aspecto de RAID hardware.
<P>Cuando se describen configuraciones, es &uacute;til referirse al n&uacute;mero de discos y
sus tama&ntilde;os. En todos los casos se usa la letra <B>N</B> para denotar el
n&uacute;mero de discos activos en el array (sin contar los discos de reserva). La
letra <B>S</B> es el tama&ntilde;o del disco m&aacute;s peque&ntilde;o en el array, a menos que
se diga otra cosa. La letra <B>P</B> representa el rendimiento de un
disco en el array, en MB/s. Cuando se use, supondremos que los discos son
igual de r&aacute;pidos, que no siempre puede ser cierto.
<P>Note que se supone que las palabras ``dispositivo'' y ``disco'' significan
lo mismo. Normalmente, los dispositivos usados para construir un dispositivo
RAID son particiones de discos, no necesariamente discos enteros. Pero,
normalmente, combinar varias particiones de un disco no tiene sentido, por
lo que las palabras dispositivo y disco simplemente significan ``particiones
de discos diferentes''.
<P>
<P>
<H2><A NAME="ss2.3">2.3 Niveles RAID</A>
</H2>

<P>Lo siguiente es una breve descripci&oacute;n de lo que soportan los parches RAID de
Linux. Parte de esta informaci&oacute;n es informaci&oacute;n RAID absolutamente b&aacute;sica,
aunque he a&ntilde;adido unas pocas rese&ntilde;as de lo que hay de especial en la
implementaci&oacute;n de Linux de los niveles. Simplemente, s&aacute;ltese esta secci&oacute;n si
conoce RAID. Regrese despu&eacute;s cuando tenga problemas   :)
<P>Los actuales parches RAID para Linux soportan los siguientes niveles:
<UL>
<LI><B>Modo Lineal (Linear mode)</B>
<UL>
<LI>Dos o m&aacute;s discos se combinan en un &uacute;nico dispositivo f&iacute;sico. Los
discos se ``adjuntan'' unos a otros de tal manera que las escrituras en el
dispositivo RAID primero llenar&aacute;n el disco 0, a continuaci&oacute;n el disco 1 y
as&iacute; sucesivamente. Los discos no tienen por qu&eacute; ser del mismo tama&ntilde;o. De
hecho, los tama&ntilde;os no importan para nada aqu&iacute;   :)</LI>
<LI>No existe redundancia en este nivel. Si un disco falla perder&aacute; todos
sus datos con toda probabilidad. Sin embargo, puede tener suerte y recuperar
algunos datos, ya que el sistema de ficheros simplemente habr&aacute;n perdido un
gran pu&ntilde;ado de datos consecutivos.</LI>
<LI>El rendimiento de las lecturas y las escrituras no se incrementar&aacute;
para lecturas/escrituras individuales. Pero si varios usuarios usan el
dispositivo, puede tener la suerte de que un usuario use efectivamente el
primer disco y el otro usuario acceda a ficheros que por casualidad residan
en el segundo disco. Si esto ocurre, ver&aacute; un aumento en el rendimiento.</LI>
</UL>
</LI>
<LI><B>RAID-0</B>
<UL>
<LI>Tambi&eacute;n llamado modo ``stripe'' o distribuci&oacute;n por bandas. Como el modo
lineal salvo que las lecturas y escrituras se realizan en paralelo en los
dispositivos. Los dispositivos deben tener aproximadamente el mismo tama&ntilde;o.
Puesto que todos los accesos se realizan en paralelo, los discos se llenan
por igual. Si un dispositivo es mucho mayor que los otros dispositivos, el
espacio extra todav&iacute;a se utilizar&aacute; en el dispositivo RAID durante las
escrituras en el extremo superior del dispositivo RAID, aunque s&oacute;lo se
acceder&aacute; a este disco m&aacute;s grande. Naturalmente, esto perjudica el rendimiento.</LI>
<LI>Como en el modo lineal, tampoco hay redundancia en este nivel.
A diferencia del modo lineal, no ser&aacute; capaz de recuperar ning&uacute;n dato si un
disco falla. Si elimina un disco de un grupo RAID-0, el dispositivo RAID no
perder&aacute; simplemente un bloque consecutivo de datos, sino que se llenar&aacute; con
peque&ntilde;os agujeros por todo el dispositivo. Probablemente, e2fsck no ser&aacute;
capaz de recuperar gran cosa de dicho dispositivo.</LI>
<LI>El rendimiento de las lecturas y las escrituras se incrementar&aacute;, ya
que las lecturas y las escrituras se realizan en paralelo sobre los
dispositivos. Normalmente, &eacute;sta es la raz&oacute;n principal para usar RAID-0. Si
los buses a los discos son suficientemente r&aacute;pidos, puede obtener casi N*P
MB/seg.</LI>
</UL>
</LI>
<LI><B>RAID-1</B>
<UL>
<LI>Este es el primer modo que realmente tiene redundancia. RAID-1 se
puede usar en dos o m&aacute;s discos con cero o m&aacute;s discos de reserva. Este modo
mantiene en un disco un duplicado exacto de la informaci&oacute;n en el otro(s)
disco(s). Por supuesto, los discos deben ser del mismo tama&ntilde;o. Si un disco
es mayor que otro, su dispositivo RAID ser&aacute; del tama&ntilde;o del disco m&aacute;s
peque&ntilde;o.</LI>
<LI>Si se eliminan (o fallan) hasta N-1 discos, todos los datos todav&iacute;a
permanecer&aacute;n intactos. Si existen discos de reserva disponibles y el sistema
(es decir, las controladoras SCSI o los chipsets IDE, etc.) sobreviven al
desastre, comenzar&aacute; inmediatamente la reconstrucci&oacute;n de un duplicado en uno
de los discos de reserva, despu&eacute;s de la detecci&oacute;n del fallo del disco.</LI>
<LI>Normalmente, el rendimiento de las lecturas aumenta hasta casi N*P,
mientras que el rendimiento de las escrituras es el mismo que el de un &uacute;nico
dispositivo o, tal vez, incluso menos. Las lecturas se pueden hacer en
paralelo pero, cuando se escribe, la CPU debe transferir N veces la cantidad
de datos que normalmente transferir&iacute;a (recuerde, se deben enviar N copias
id&eacute;nticas de todos los datos a los discos).</LI>
</UL>
</LI>
<LI><B>RAID-4</B>
<UL>
<LI>Este nivel de RAID no se usa con mucha frecuencia. Se puede usar sobre
3 o m&aacute;s discos. En lugar de duplicar completamente la informaci&oacute;n, guarda
informaci&oacute;n de paridad en un &uacute;nico disco y escribe datos a los otros discos
de forma parecida a un RAID-0. Ya que uno de los discos se reserva para
informaci&oacute;n de paridad, el tama&ntilde;o del array ser&aacute; (N-1)*S, donde S es el
tama&ntilde;o del disco m&aacute;s peque&ntilde;o del array. Como en un RAID-1, los discos deben
ser del mismo tama&ntilde;o o de lo contrario tendr&aacute; que aceptar que el valor de S
en la f&oacute;rmula (N-1)*S anterior ser&aacute; el tama&ntilde;o del disco m&aacute;s peque&ntilde;o del
array.</LI>
<LI>Si un disco falla, se puede usar la informaci&oacute;n de paridad para
reconstruir todos los datos. Si dos discos fallan, se perder&aacute;n todos los
datos.</LI>
<LI>La raz&oacute;n por la que este nivel no se usa con mucha frecuencia es que la
informaci&oacute;n de paridad se guarda en un &uacute;nico disco. Esta informaci&oacute;n se debe
actualizar <EM>cada</EM> vez que se escribe en uno de los otros discos. Por
eso, el disco de paridad se convertir&aacute; en un cuello de botella si no es
mucho m&aacute;s r&aacute;pido que los otros discos. Sin embargo, si por pura casualidad
tuviera muchos discos lentos y un disco muy r&aacute;pido, este nivel de RAID
podr&iacute;a ser muy &uacute;til.</LI>
</UL>
</LI>
<LI><B>RAID-5</B>
<UL>
<LI>Este es quiz&aacute;s el modo RAID m&aacute;s &uacute;til cuando uno desea combinar un
mayor n&uacute;mero de discos f&iacute;sicos y todav&iacute;a conservar alguna redundancia.
RAID-5 se puede usar sobre 3 o m&aacute;s discos, con cero o m&aacute;s discos de reserva.
El tama&ntilde;o del dispositivo RAID-5 resultante ser&aacute; (N-1)*S, justo como en
RAID-4. La gran diferencia entre RAID-5 y RAID-4 es que la informaci&oacute;n de
paridad se distribuye uniformemente entre los discos participantes, evitando
el problema del cuello de botella del RAID-4.</LI>
<LI>Si uno de los discos falla, todos los datos todav&iacute;a permanecer&aacute;n intactos,
gracias a la informaci&oacute;n de paridad. Si existen discos de reserva
disponibles, la reconstrucci&oacute;n comenzar&aacute; inmediatamente despu&eacute;s del fallo
del dispositivo. Si dos discos fallan simult&aacute;neamente, todos los dato se
perder&aacute;n. RAID-5 puede sobrevivir a un fallo de disco, pero no a dos o m&aacute;s.</LI>
<LI>Normalmente, el rendimiento de las lecturas y las escrituras se
incrementar&aacute;, pero es dif&iacute;cil predecir en qu&eacute; medida.</LI>
</UL>
</LI>
</UL>
<P>
<H3>Discos de reserva</H3>

<P>Los discos de reserva son discos que no forman parte del grupo RAID hasta
que uno de los discos activos falla. Cuando se detecta un fallo de disco, el
dispositivo se marca como ``defectuoso'' y la reconstrucci&oacute;n se inicia
inmediatamente sobre el primer disco de reserva disponible.  
<P>De esta manera, los discos de reservan proporcionan una buena seguridad
extra, especialmente, a sistemas RAID-5 que, tal vez, son dif&iacute;ciles de
lograr (f&iacute;sicamente). Se puede permitir que el sistema funcione durante
alg&uacute;n tiempo con un dispositivo defectuoso, ya que se conserva toda la
redundancia mediante los discos de reserva.
<P>No puede estar seguro de que su sistema sobrevivir&aacute; a una ca&iacute;da de disco. La
capa RAID puede que maneje los fallos de dispositivos verdaderamente bien,
pero las controladoras SCSI se podr&iacute;an romper durante el manejo del error o
el chipset IDE podr&iacute;a bloquearse, o podr&iacute;an ocurrir muchas otras cosas.
<P>
<P>
<P>
<H2><A NAME="ss2.4">2.4 Intercambio sobre RAID</A>
</H2>

<P>No hay ninguna raz&oacute;n para usar RAID por razones de rendimiento del intercambio. El
propio n&uacute;cleo puede repartir el intercambio entre varios dispositivos si
simplemente les da la misma prioridad en el fichero fstab.
<P>Un buen fstab se parece a &eacute;ste:
<PRE>
/dev/sda2       swap           swap    defaults,pri=1   0 0
/dev/sdb2       swap           swap    defaults,pri=1   0 0
/dev/sdc2       swap           swap    defaults,pri=1   0 0
/dev/sdd2       swap           swap    defaults,pri=1   0 0
/dev/sde2       swap           swap    defaults,pri=1   0 0
/dev/sdf2       swap           swap    defaults,pri=1   0 0
/dev/sdg2       swap           swap    defaults,pri=1   0 0
</PRE>

Esta configuraci&oacute;n permite a la m&aacute;quina intercambiar en paralelo sobre siete
dispositivos SCSI. No necesita RAID, ya que esa ha sido una caracter&iacute;stica
del n&uacute;cleo desde hace mucho tiempo.
<P>Otra raz&oacute;n para usar RAID para intercambio es la alta disponibilidad. Si
configura un sistema para arrancar desde, por ejemplo, un dispositivo
RAID-1, el sistema podr&iacute;a ser capaz de sobrevivir a un fallo de disco. Pero si
el sistema ha estado intercambiando sobre el ahora dispositivo defectuoso,
puede estar seguro de que se vendr&aacute; abajo. El intercambio sobre un
dispositivo RAID-1 solucionar&iacute;a este problema.
<P>Sin embargo, el intercambio sobre RAID-{1,4,5} <B>NO</B> est&aacute; soportado.
Puede configurarlo, pero fracasar&aacute;. La raz&oacute;n es que la capa RAID algunas
veces reserva memoria antes de realizar una escritura. Esto produce un
bloqueo mortal ya que el n&uacute;cleo tendr&aacute; que reservar memoria antes de que
pueda intercambiar, e intercambiar antes de que pueda reservar memoria.
<P>Es triste pero cierto, al menos por ahora.
<P>
<P>
<HR>
<A HREF="Software-RAID.HOWTO-3.html">Página siguiente</A>
<A HREF="Software-RAID.HOWTO-1.html">Página anterior</A>
<A HREF="Software-RAID.HOWTO.html#toc2">Índice general</A>
</BODY>
</HTML>
