<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>RAID-Software C&Oacute;MO: Rendimiento</TITLE>
 <LINK HREF="Software-RAID.HOWTO-7.html" REL=next>
 <LINK HREF="Software-RAID.HOWTO-5.html" REL=previous>
 <LINK HREF="Software-RAID.HOWTO.html#toc6" REL=contents>
</HEAD>
<BODY>
<A HREF="Software-RAID.HOWTO-7.html">Página siguiente</A>
<A HREF="Software-RAID.HOWTO-5.html">Página anterior</A>
<A HREF="Software-RAID.HOWTO.html#toc6">Índice general</A>
<HR>
<H2><A NAME="s6">6. Rendimiento</A></H2>

<P>Esta secci&oacute;n contiene varias pruebas de evaluaci&oacute;n de prestaciones
(``benchmarks'') de un sistema del mundo real usando un RAID software.
<P>Las evaluaciones se han realizado con el programa <CODE>bonnie</CODE> y todas
las veces con ficheros dos o m&aacute;s veces m&aacute;s grandes que el tama&ntilde;o de la
RAM f&iacute;sica de la m&aacute;quina.
<P>Estas evaluaciones <EM>s&oacute;lo</EM> miden el ancho de banda de entrada y de
salida sobre un &uacute;nico gran fichero. Esto es algo interesante de saber si uno
est&aacute; interesado en el m&aacute;ximo rendimiento de E/S para grandes
lecturas/escrituras. Sin embargo, tales n&uacute;meros nos dicen poco sobre cu&aacute;l
ser&iacute;a el rendimiento si el array se usara para un almac&eacute;n temporal de
noticias, un servidor web, etc. etc. Tenga siempre en cuenta que los n&uacute;meros
de las evaluaciones son el resultado de ejecutar un programa ``sint&eacute;tico''.
Pocos programas del mundo real hacen lo que <CODE>bonnie</CODE> hace y, aunque
es interesante mirar estos n&uacute;meros de E/S, no son indicadores en &uacute;ltima
instancia del rendimiento de los dispositivos del mundo real.
<P>Por ahora, s&oacute;lo poseo resultados de mi propia m&aacute;quina. La configuraci&oacute;n es:
<UL>
<LI>Dual Pentium Pro 150 MHz</LI>
<LI>256 MB RAM (60 MHz EDO)</LI>
<LI>Tres IBM UltraStar 9ES 4.5 GB U2W SCSI</LI>
<LI>Adaptec 2940U2W</LI>
<LI>Un IBM UltraStar 9ES 4.5 GB UW SCSI</LI>
<LI>Adaptec 2940 UW</LI>
<LI>N&uacute;cleo 2.2.7 con los parches RAID</LI>
</UL>
<P>Los tres discos U2W cuelgan de la controladora U2W y el disco UW cuelga de
la controladora UW.
<P>Parece imposible sacar mucho m&aacute;s de 30 MB/s a trav&eacute;s de los buses SCSI de
este sistema, usando un RAID o no. Mi suposici&oacute;n es que, debido a que el
sistema es bastante antiguo, el ancho de banda de la memoria lo fastidia y,
por tanto, limita lo que se puede enviar a trav&eacute;s de las controladoras SCSI.
<P>
<H2><A NAME="ss6.1">6.1 RAID-0</A>
</H2>

<P><B>Lectura</B> significa <B>entrada de bloques secuencial</B> y
<B>Escritura</B> significa <B>salida de bloques secuencial</B>. El
tama&ntilde;o de fichero fue de 1GB en todas las pruebas. Las pruebas se realizaron
en modo monousuario. Se configur&oacute; el manejador SCSI para que no utilizara el
encolamiento de &oacute;rdenes etiquetadas (``tagged command queuing'', TCQ).
<P>
<CENTER><TABLE BORDER><TR><TD>
Tama&ntilde;o de porci&oacute;n </TD><TD> Tama&ntilde;o de bloque </TD><TD> Lectura KB/s </TD><TD> Escritura KB/s </TD></TR><TR><TD>
</TD></TR><TR><TD>
4k </TD><TD> 1k </TD><TD> 19712 </TD><TD> 18035 </TD></TR><TR><TD>
4k </TD><TD> 4k </TD><TD> 34048 </TD><TD> 27061 </TD></TR><TR><TD>
8k </TD><TD> 1k </TD><TD> 19301 </TD><TD> 18091 </TD></TR><TR><TD>
8k </TD><TD> 4k </TD><TD> 33920 </TD><TD> 27118 </TD></TR><TR><TD>
16k </TD><TD> 1k </TD><TD> 19330 </TD><TD> 18179 </TD></TR><TR><TD>
16k </TD><TD> 2k </TD><TD> 28161 </TD><TD> 23682 </TD></TR><TR><TD>
16k </TD><TD> 4k </TD><TD> 33990 </TD><TD> 27229 </TD></TR><TR><TD>
32k </TD><TD> 1k </TD><TD> 19251 </TD><TD> 18194 </TD></TR><TR><TD>
32k </TD><TD> 4k </TD><TD> 34071 </TD><TD> 26976

</TD></TR></TABLE></CENTER>
<P>A partir de esto vemos que el tama&ntilde;o de porci&oacute;n del RAID no importa mucho.
Sin embargo, el tama&ntilde;o de bloque del sistema de ficheros ext2 deber&iacute;a ser
tan grande como fuera posible, lo cual significa 4KB (es decir, el tama&ntilde;o de
p&aacute;gina) en una IA-32 (N.T.: arquitectura Intel de 32 bits).
<P>
<H2><A NAME="ss6.2">6.2 RAID-0 con TCQ</A>
</H2>

<P>Esta vez, el manejador SCSI se configur&oacute; para usar TCQ, con una longitud de
cola de 8. Por lo dem&aacute;s, todo es lo mismo de antes.
<P>
<CENTER><TABLE BORDER><TR><TD>
Tama&ntilde;o de porci&oacute;n </TD><TD> Tama&ntilde;o de bloque </TD><TD> Lectura KB/s </TD><TD> Escritura KB/s </TD></TR><TR><TD>
</TD></TR><TR><TD>
32k </TD><TD> 4k </TD><TD> 33617 </TD><TD> 27215

</TD></TR></TABLE></CENTER>
<P>No se realizaron m&aacute;s pruebas. TCQ pareci&oacute; incrementar ligeramente el
rendimiento de las escrituras, pero verdaderamente no hubo mucha diferencia
en absoluto.
<P>
<H2><A NAME="ss6.3">6.3 RAID-5</A>
</H2>

<P>El array se configur&oacute; para funcionar en el modo RAID-5 y se hicieron pruebas
similares.
<P>
<CENTER><TABLE BORDER><TR><TD>
Tama&ntilde;o de porci&oacute;n </TD><TD> Tama&ntilde;o de bloque </TD><TD> Lectura KB/s </TD><TD> Escritura KB/s </TD></TR><TR><TD>
</TD></TR><TR><TD>
8k </TD><TD> 1k </TD><TD> 11090 </TD><TD> 6874 </TD></TR><TR><TD>
8k </TD><TD> 4k </TD><TD> 13474 </TD><TD> 12229 </TD></TR><TR><TD>
32k </TD><TD> 1k </TD><TD> 11442 </TD><TD> 8291 </TD></TR><TR><TD>
32k </TD><TD> 2k </TD><TD> 16089 </TD><TD> 10926 </TD></TR><TR><TD>
32k </TD><TD> 4k </TD><TD> 18724 </TD><TD> 12627

</TD></TR></TABLE></CENTER>
<P>Ahora, tanto el tama&ntilde;o de porci&oacute;n como el tama&ntilde;o de bloque parecen realmente
significativos.
<P>
<H2><A NAME="ss6.4">6.4 RAID-10</A>
</H2>

<P>Un RAID-10 significa ``bandas duplicadas'' o un array RAID-1 de dos arrays
RAID-0. El tama&ntilde;o de porci&oacute;n es tanto el tama&ntilde;o de las porciones del array
RAID-1 como del array RAID-0. No realic&eacute; pruebas en las que esos tama&ntilde;os de
porci&oacute;n fueran diferentes, aunque esa deber&iacute;a ser una configuraci&oacute;n
perfectamente v&aacute;lida.
<P>
<CENTER><TABLE BORDER><TR><TD>
Tama&ntilde;o de porci&oacute;n </TD><TD> Tama&ntilde;o de bloque </TD><TD> Lecturas KB/s </TD><TD> Escrituras KB/s </TD></TR><TR><TD>
</TD></TR><TR><TD>
32k </TD><TD> 1k </TD><TD> 13753 </TD><TD> 11580 </TD></TR><TR><TD>
32k </TD><TD> 4k </TD><TD> 23432 </TD><TD> 22249

</TD></TR></TABLE></CENTER>
<P>No se realizaron m&aacute;s pruebas. El tama&ntilde;o de fichero fue de 900MB debido a que
las cuatro particiones involucradas eran de 500 MB cada una, lo cual no deja
espacio para un fichero de 1GB en esta configuraci&oacute;n (RAID-1 sobre dos
arrays de 1000MB).
<P>
<P>
<HR>
<A HREF="Software-RAID.HOWTO-7.html">Página siguiente</A>
<A HREF="Software-RAID.HOWTO-5.html">Página anterior</A>
<A HREF="Software-RAID.HOWTO.html#toc6">Índice general</A>
</BODY>
</HTML>
