<!-- $Id: caracteristicas_de_linux.xml,v 1.1 2003/03/20 12:59:18 rafael Exp $ -->

  <chapter>
    <title>Caracter&iacute;sticas de Linux</title>
    
    <para>Aqu&iacute; teneis a grandes rasgos una lista con las
    características de Linux.  <emphasis>[Fuente:
    Infosheet-Como. Traductor: Ivan Casado. Revisi&oacute;n: Rafael
    Martinez]</emphasis> :</para>
    
    <itemizedlist>
      <listitem>
	<para>Multitarea: La palabra multitarea describe la habilidad
	de ejecutar varios programas al mismo tiempo. Linux utiliza la
	llamada multitarea preeventiva, la cual asegura que todos los
	programas que se est&aacute;n utilizando en un momento dado
	ser&aacute;n ejecutados, siendo el sistema operativo el
	encargado de ceder tiempo de microprocesador a cada
	programa.</para>
      </listitem>
      <listitem>
	<para> Multiusuario: Muchos usuarios usando la misma máquina
	al mismo tiempo.</para>
      </listitem>
      <listitem>
	<para> Multiplataforma: Las plataformas en las que en un
	principio se puede utilizar Linux son 386-, 486-. Pentium,
	Pentium Pro, Pentium II/III/IV, Amiga y Atari, tambi&eacute;n
	existen versiones para su utilizaci&oacute;n en otras
	plataformas, como Alpha, ARM,MIPS, PowerPC y SPARC.</para>
      </listitem>
      <listitem>
	<para> Multiprocesador: Soporte para sistemas con mas de un
	procesador est&aacute; disponible para Intel y SPARC.</para>
      </listitem>
      <listitem>
	<para>Funciona en modo protegido en el 386.</para>
      </listitem>
      <listitem>
	<para>Protecci&oacute;n de la memoria entre procesos, de
	manera que uno de ellos no pueda colgar el sistema.</para>
      </listitem>
      <listitem>
	<para>Carga de ejecutables por demanda: Linux s&oacute;lo lee
	del disco aquellas partes de un programa que est&aacute;n
	siendo usadas actualmente.</para>
      </listitem>
      <listitem>
	<para>Pol&iacute;tica de cop&iacute;a en escritura para la
	compartición de p&aacute;ginas entre ejecutables: esto
	significa que varios procesos pueden usar la misma zona de
	memoria para ejecutarse.  Cuando alguno intenta escribir en
	esa memoria, la p&aacute;gina (4Kb de memoria) se copia a otro
	lugar.  Esta pol&iacute;tica de copia en escritura tiene dos
	beneficios: aumenta la velocidad y reduce el uso de
	memoria.</para>
      </listitem>
      <listitem>
	<para>Memoria virtual usando paginaci&oacute;n (sin
	intercambio de procesos completos) a disco: A una
	partici&oacute;n o un archivo en el sistema de archivos, o
	ambos, con la posibilidad de a&ntilde;adir m&aacute;s
	&aacute;reas de intercambio sobre la marcha Un total de 16
	zonas de intercambio de 128Mb de tama&ntilde;o m&aacute;ximo
	pueden ser usadas en un momento dado con un l&iacute;mite
	te&oacute;rico de 2Gb para intercambio. Este limite se puede
	aumentar facilmente con el cambio de unas cuantas lineas en el
	codigo fuente. <emphasis>Este limite de 128Mb no existe
	actualmente en las &uacute;ltimas versiones del
	n&uacute;cleo/kernel (2.4.x).</emphasis></para>
      </listitem>
      <listitem>
	<para>La memoria se gestiona como un recurso unificado para
	los programas de usuario y para el cach&eacute; de disco, de
	tal forma que toda la memoria libre puede ser usada para
	cach&eacute; y &eacute;sta puede a su vez ser reducida cuando
	se ejecuten grandes programas.</para>
      </listitem>
      <listitem>
	<para>Librer&iacute;as compartidas de carga din&aacute;mica
	(DLL's) y librer&iacute;as est&aacute;ticas.</para>
      </listitem>
      <listitem>
	<para>Se realizan volcados de estado (core dumps) para
	posibilitar los an&aacute;lisis post-mortem, permitiendo el
	uso de depuradores sobre los programas no s&oacute;lo en
	ejecuci&oacute;n sino tambi&eacute;n tras abortar &eacute;stos
	por cualquier motivo.</para>
      </listitem>
      <listitem>
	<para>Compatible con POSIX, System V y BSD a nivel fuente.</para>
      </listitem>
      <listitem>
	<para>Emulaci&oacute;n de iBCS2, casi completamente compatible
	con SCO, SVR3 y SVR4 a nivel binario.</para>
      </listitem>
      <listitem>
	<para>Todo el c&oacute;digo fuente est&aacute; disponible,
	incluyendo el n&uacute;cleo completo y todos los drivers, las
	herramientas de desarrollo y todos los programas de usuario;
	adem&aacute;s todo ello se puede distribuir libremente. Hay
	algunos programas comerciales que est&aacute;n siendo
	ofrecidos para Linux actualmente sin c&oacute;digo fuente,
	pero todo lo que ha sido gratuito sigue siendo
	gratuito.</para>
      </listitem>
      <listitem>
	<para>Control de tareas POSIX.</para>
      </listitem>
      <listitem>
	<para>Pseudo-terminales (pty's).</para>
      </listitem>
      <listitem>
	<para>Emulaci&oacute;n de 387 en el n&uacute;cleo, de tal
	forma que los programas no tengan que hacer su propia
	emulaci&oacute;n matem&aacute;tica. Cualquier m&aacute;quina
	que ejecute Linux parecer&aacute; dotada de coprocesador
	matem&aacute;tico. Por supuesto, si el ordenador ya tiene una
	FPU (unidad de coma flotante), esta ser&aacute; usada en lugar
	de la emulaci&oacute;n, pudiendo incluso compilar tu propio
	kernel sin la emulaci&oacute;n matem&aacute;tica y conseguir
	un peque&ntilde;o ahorro de memoria.</para>
      </listitem>
      <listitem>
	<para>Soporte para muchos teclados nacionales o adaptados y es
	bastante f&aacute;cil a&ntilde;adir nuevos din&aacute;micamente.</para>
      </listitem>
      <listitem>
	<para>Consolas virtuales m&uacute;ltiples: varias sesiones de
	login a trav&eacute;s de la consola entre las que se puede
	cambiar con las combinaciones adecuadas de teclas (totalmente
	independiente del hardware de video).  Se crean
	din&aacute;micamente y puedes tener hasta 64.</para>
      </listitem>
      <listitem>
	<para>Soporte para varios sistemas de archivo comunes,
	incluyendo minix-1, Xenix y todos los sistemas de archivo
	t&iacute;picos de System V, y tiene un avanzado sistema de
	archivos propio con una capacidad de hasta 4 Tb y nombres de
	archivos de hasta 255 caracteres de longitud.</para>
      </listitem>
      <listitem>
	<para>Acceso transparente a particiones MS-DOS (o a
	particiones OS/2 FAT) mediante un sistema de archivos
	especial: no es necesario ning&uacute;n comando especial para
	usar la partici&oacute;n MS-DOS, esta parece un sistema de
	archivos normal de Unix (excepto por algunas restricciones en
	los nombres de archivo, permisos, y esas cosas). Las
	particiones comprimidas de MS-DOS 6 no son accesibles en este
	momento, sin un parche especial (dmsdosfs). El soporte para
	VFAT, FAT32 (WNT, Windows 95/98) se encuentra soportado desde
	la version 2.0.x del nucleo y el NTFS de WNT desde la version
	2.2.x.</para>
      </listitem>
      <listitem>
	<para>Un sistema de archivos especial llamado UMSDOS que
	permite que Linux sea instalado en un sistema de archivos DOS.</para>
      </listitem>
      <listitem>
	<para>Soporte en s&oacute;lo lectura de HPFS-2 del OS/2 2.1</para>
      </listitem>
      <listitem>
	<para>Sistema de archivos de CD-ROM que lee todos los formatos
	est&aacute;ndar de CD-ROM.</para>
      </listitem>
      <listitem>
	<para>TCP/IP, incluyendo ftp, telnet, NFS, etc.</para>
      </listitem>
      <listitem>
	<para>Appletalk.</para>
      </listitem>
      <listitem>
	<para>Software cliente y servidor Netware.</para>
      </listitem>
      <listitem>
	<para>Lan Manager / Windows Native (SMB), software cliente y
	servidor.</para>
      </listitem>
      <listitem>
	<para>Posibilidad de un Firewall (Cortafuegos) incorporado en
	el n&uacute;cleo.</para>
      </listitem>
      <listitem>
	<para>Diversos protocolos de red incluidos en el kernel: TCP,
	IPv4, IPv6, AX.25, X.25, IPX, DDP, Netrom, etc.</para>
      </listitem>
      
    </itemizedlist>
  </chapter>
  
  <!-- Local Variables: -->
  <!-- sgml-parent-document: "../faqlinux.xml" -->
  <!-- End: -->