<!-- $Id: historia_de_linux.xml,v 1.1 2003/03/20 12:59:19 rafael Exp $ -->
 
  <chapter>
    <title>Historia de Linux</title> 
    
    <para>Linux hace su aparici&oacute;n a principios de la decada de
    los noventa, era el a&ntilde;o 1991 y por aquel entonces un
    estudiante de inform&aacute;tica de la Universidad de Helsinki,
    llamado Linus Torvalds empez&oacute;, como una afici&oacute;n y
    sin poderse imaginar a lo que llegar&iacute;a este proyecto, a
    programar las primeras lineas de c&oacute;digo de este sistema
    operativo llamado Linux.</para>
    
    <para>Aqu&iacute; teneis el primer mensaje que Linus Torvalds
    mando al grupo de noticias comp.os.minix:</para>

    <programlisting><![CDATA[
  From:torvalds@klaava.Helsinki.FI (Linus Benedict Torvalds)
  Newsgroup: comp.os.minix
  Subject: GCC-1.40 and a posix question
  Message-ID: 1991Jul13, 100050.9886@klaava.Helsinki.FI
  Date: 3 Jul 91 10:00:50 GMT

  Hello netlanders,
  Due a project I'm working on (in minix), I'm interested 
  in the posix standard definition. Could somebody please 
  point me to a (preferably) machine-readable format of the 
  latest posix rules? Ftp-sites would be nice.

  Linux Torvalds torvalds@kruuna.helsinki.fi
]]></programlisting>
    
    <para>Y aqu&iacute; el que le siguio, este mensaje es considerado
    por muchos como el comienzo de Linux:</para>
   
    <programlisting><![CDATA[
  From:torvalds@klaava.Helsinki.FI (Linus Benedict Torvalds)
  Newsgroup: comp.os.minix
  Subject: What would you like to see most in minix?
  Summary: small poll for my new operating system
  Message-ID: 1991Aug25, 20578.9541@klaava.Helsinki.FI
  Date: 25 Aug 91 20:57:08 GMT
  Organization: University of Helsinki.

  Hello everybody out there using minix-

  I'm doing a (free) operating system (just a hobby, won't 
  be big and professional like gnu) for 386(486) AT clones. 
  This has been brewing since april, and is starting to get ready. 
  I'd like any feedback on things people like/dislike in minix; 
  as my OS resembles it somewhat (same physical layout of the 
  file-sytem due to practical reasons) among other things.

  I've currently ported bash (1.08) an gcc (1.40), and things seem to work.
  This implies that i'll get something practical within a few months, 
  and I'd like to know what features most people want. Any suggestions 
  are welcome, but I won't promise I'll implement them :-)

  Linux Torvalds torvalds@kruuna.helsinki.fi
]]></programlisting>

    <para>Este comienzo estuvo inspirado en MINIX, un peque&ntilde;o
    sistema Unix desarrollado por Andy Tanenbaum. Las primeras
    discusiones sobre Linux fueron en el grupo de noticias
    comp.os.minix, en estas discusiones se hablaba sobre todo del
    desarrollo de un peque&ntilde;o sistema Unix para usuarios de
    Minix que querian m&aacute;s.</para>
  
    <para>Linus nunca anuncio la versi&oacute;n 0.01 de Linux (agosto
    1991), esta version no era ni siquiera ejecutable, solamente
    incluia los principios del n&uacute;cleo del sistema, estaba
    escrita en lenguaje ensamblador y asum&iacute;a que uno tenia
    acceso a un sistema Minix para su compilaci&oacute;n.</para>
    
    <para>El 5 de octubre de 1991, Linus anuncio la primera versión
    "Oficial" de Linux, versi&oacute;n 0.02. Con esta versi&oacute;n
    Linus pudo ejecutar Bash (GNU Bourne Again Shell) y gcc (El
    compilador GNU de C) pero no mucho m&aacute;s funcionaba. En este
    estado de desarrollo ni se pensaba en los t&eacute;rminos soporte,
    documentaci&oacute;n, distribuci&oacute;n .....</para>

    <para>Despues de la versi&oacute;n 0.03, Linus salto en la
    numeración hasta la 0.10, m&aacute;s y m&aacute;s programadores a
    lo largo y ancho de internet empezaron a trabajar en el proyecto y
    despues de sucesivas revisiones, Linus incremento el n&uacute;mero
    de versi&oacute;n hasta la 0.95 (Marzo 1992). M&aacute;s de un
    a&ntilde;o despues (diciembre 1993) el n&uacute;cleo del sistema
    estaba en la versi&oacute;n 0.99 y la version 1.0 no llego hasta
    el 14 de marzo de 1994.</para>
   
    <para>La serie actual del n&uacute;cleo (Junio 2002) es la 2.4.x y
    sigue avanzando d&iacute;a a d&iacute;a con la meta de
    perfeccionar y mejorar el sistema.</para>

  </chapter>
  
  <!-- Local Variables: -->
  <!-- sgml-parent-document: "../faqlinux.xml" -->
  <!-- End: -->