<!-- $Id: que_es_linux.xml,v 1.1 2003/03/20 12:59:19 rafael Exp $ -->

  <chapter id="que_es_linux">
    <title>¿Qu&eacute; es Linux?</title>
    
    <para>En el estricto sentido de la palabra, Linux es el
    n&uacute;cleo/kernel de un sistema operativo, aunque este
    n&uacute;cleo no podria funcionar sin una infraestructura
    alrededor del mismo, librerias, compiladores utilidades,
    programas, etc. Por esto mismo, y porque la mayor&iacute;a de esta
    infraestructura est&aacute; licenciada bajo el proyecto
    &link.gnu;, muchos definen a este sistema operativo como
    GNU/Linux.  Normalmente cuando se habla del sistema operativo
    GNU/Linux &oacute; simplemente Linux, se est&aacute; haciendo
    referencia al conjunto formado por el n&uacute;cleo m&aacute;s
    todo lo que lo acompa&ntilde;a y que hace posible su
    utilizaci&oacute;n.</para> 

    <para>Linux es un sistema operativo, compatible Unix. Dos
    caracter&iacute;sticas muy peculiares lo diferencian del resto de
    los sistemas que podemos encontrar en el mercado, la primera, es
    que es <emphasis>libre</emphasis> (libre, no es lo mismo que
    gratis), esto significa que no tenemos que pagar ning&uacute;n
    tipo de licencia a ninguna casa desarrolladora de software por el
    uso del mismo, la segunda, es que el sistema viene
    acompa&ntilde;ado del <emphasis>c&oacute;digo
    fuente</emphasis>. Como ya hemos dicho, el sistema lo forman el
    <link linkend="kernel">Kernel/N&uacute;cleo</link> del sistema
    m&aacute;s un gran n&uacute;mero de utilidades / programas /
    librerias que hacen posible su utilizaci&oacute;n.</para>
    
    <para>Linux se distribuye bajo la &link.licencia.gnu;, por lo
    tanto, el c&oacute;digo fuente tiene que estar siempre
    accesible.</para>
    
    <para>El sistema ha sido dise&ntilde;ado y programado por multitud de
    programadores alrededor del mundo.  El n&uacute;cleo del sistema
    sigue en continuo desarrollo bajo la coordinaci&oacute;n de Linus
    Torvalds, la persona de la que partio la idea de este proyecto, a
    principios de la d&eacute;cada de los noventa.</para>

    <para>Día a día, más y más programas / aplicaciones están
    disponibles para este sistema y la cantidad de los mismos aumenta
    de versión a versión. La gran mayor&iacute;a de los mismos vienen
    acompa&ntilde;ados del c&oacute;digo fuente y se distribuyen
    gratuitamente bajo los t&eacute;rminos de licencia de la GNU
    Public License. Tambi&eacute;n existen programas comerciales, los
    cuales hay que comprar y que no se distribuyen bajo la licencia
    GNU.</para>
    
    <para>en los últimos tiempos, muchas casa de software comercial
    han empezado a distribuir sus productos para Linux y la presencia
    del mismo en empresas aumenta rapidamente por la excelente
    relaci&oacute;n calidad-precio que se consigue con el mismo, asi
    como el apoyo de grandes empresas inform&aacute;ticas, IBM, SUN,
    Silicon Graphics, etc.</para>

    <para>Las plataformas en las que en un principio se puede utilizar
    Linux son 386-, 486-.  Pentium, Pentium Pro, Pentium II/III/IV,
    Amiga y Atari, tambi&eacute;n existen versiones para su
    utilizaci&oacute;n en otras plataformas, como Alpha, ARM, MIPS,
    PowerPC y SPARC</para>
    
  </chapter>
  
  <!-- Local Variables: -->
  <!-- sgml-parent-document: "../faqlinux.xml" -->
  <!-- End: -->