<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="David Marín Carreño">
   <meta name="Author" content="David Martínez Moreno">
   <title>Proyecto NuLies. Noticias atrasadas.</title>

<!-----------------Start ReferStat   ----------------->
<script type="text/javascript" language="JavaScript">
<!--
document.write("<img src=\"http://es.nedstat.net/cgi-bin/referstat.gif?");
document.write("name=nulies&refer=");
document.write(escape(document.referrer));
document.write("\" width=1 height=1 alt=\"\" align=\"right\">");
// -->

</script>
<!------------------End ReferStat   ------------------>


</head>


<body bgcolor="White">


<SCRIPT Languaje="JavaScript">

<!--
// Test de compatibilidad con Netscape 3.0 (Para las imagenes cambiantes)
compatible = false;
if( parseInt( navigator.appVersion ) >= 3 ) { compatible = true; }

// Carga las imagenes en la cache para que el cambio se haga rapido
if( compatible ) {
path='images/'
secciones = new Array();
var on    = new Array();
var off   = new Array();
var click = new Array();

secciones[0] = "acerca"
num_acerca = 0
secciones[1] = "descargas"
num_descargas = 1
secciones[2] = "colaborar"
num_colaborar = 2
secciones[3] = "noticias"
num_noticias = 3
secciones[4] = "leerdoc"
num_leerdoc = 4


for (var i = 0; i <secciones.length; i++) {
on[i]      = new Image;(85,25)
on[i].src  = path+secciones[i]+'1.png'
off[i]     = new Image;(85,25)
off[i].src = path+secciones[i]+'0.png'
click[i]   = new Image;(85,25)
click[i].src = path+secciones[i]+'2.png'
}}

function cambia(imagen,modo) 
{ if( compatible ) 
  {
       var j=parseInt(eval('num_'+imagen))
       if (modo=='on') 
           { document.images[imagen].src =  on[j].src }
       if (modo=='off')
           { document.images[imagen].src = off[j].src }
       if (modo=='click')
           { document.images[imagen].src = click[j].src }
  }
}


// -->
</SCRIPT>




<table cellspacing=0 cellpadding=0 border=0 width="750" ALIGN="CENTER">
  <tr>
  <td valign="top" width="452"><img 
  src="images/nulies-00.png" width="452" height="157"></td> 
  <td>
  </td>
  <td>

	<P ALIGN=RIGHT>

	

	<a href="http://es.nedstat.net/cgi-bin/viewstat?name=nulies"><img 
	SRC="http://es.nedstat.net/cgi-bin/nedstat.gif?name=nulies"
	ALT="Estadísticas NedStat" BORDER=0 height=25 width=25></a>

        <!--

         <a href="index.html" 
	 onMouseOver="cambia('noticias','on')" 
	 onMouseOut="cambia('noticias','off')"
	 onClick="cambia('noticias','click')">
        --> <img 
	 src="images/noticias1.png" ALT="Noticias" 
	 TITLE="noticias" NAME="noticias" BORDER="0"><!--/a-->

	<a href="acercade.html" 
	 onMouseOver="cambia('acerca','on')" 
	 onMouseOut="cambia('acerca','off')"
	 onClick="cambia('acerca','click')"><img 
	 src="images/acerca0.png" ALT="Acerca de..." 
	 TITLE="acerca" NAME="acerca" BORDER="0"></a>

	<a href="descargas.html" 
	 onMouseOver="cambia('descargas','on')" 
	 onMouseOut="cambia('descargas','off')"
	 onClick="cambia('descargas','click')"><img 
	 src="images/descargas0.png" ALT="Descargas" 
	 TITLE="descargas" NAME="descargas" BORDER="0"></a>

	<a href="leerdoc.html" 
	 onMouseOver="cambia('leerdoc','on')" 
	 onMouseOut="cambia('leerdoc','off')"
	 onClick="cambia('leerdoc','click')"><img 
	 src="images/leerdoc0.png" ALT="Leer documentación" 
	 TITLE="leerdoc" NAME="leerdoc" BORDER="0"></a>

	<a href="colaborar.html" 
	 onMouseOver="cambia('colaborar','on')" 
	 onMouseOut="cambia('colaborar','off')"
	 onClick="cambia('colaborar','click')"><img 
	 src="images/colaborar0.png" ALT="Colaborar" 
	 TITLE="colaborar" NAME="colaborar" BORDER="0"></a>

	<BR>
	<font size=-1>
	&Uacute;ltima actualizaci&oacute;n: 19 de enero de 2004
	<BR>
	por <a href="mailto:enderARROBArediris.es">
	David Mart&iacute;nez Moreno</a>.</font>

  </td>
	</tr>
	<tr>
		<td><img 
		src="images/nulies-01.png"></td> 

		<td width="112"><img 
		src="images/nulies-11.png"></td>
	</tr>
</table>

<FONT FACE="Verdana, Arial, Helvetica">

<P>
<FONT SIZE="+3">
<STRONG><U>Noticias atrasadas</U></STRONG>
</FONT>
<FONT SIZE="-1">
<DL>

<!----------------------------
* Las noticias comienzan aquí
*----------------------------->
<DT>
<FONT COLOR="Orange">
<STRONG>21 de agosto de 2002 </STRONG> </FONT>
</DT> <DD>
Pequeños cambios en la página de <i>Leer documentación</i>, y adición de un enlace con el interfaz web del CVS de NuLies.

<DT>
<FONT COLOR="Orange">
<STRONG>14 de mayo de 2002 </STRONG> </FONT>
</DT> <DD>
Los ficheros <b>Changes</b> han sido actualizados a la última versión disponible, la del núcleo 2.4.19-pre7.

<DT>
<FONT COLOR="Orange">
<STRONG>19 de septiembre de 2001 </STRONG> </FONT>
</DT> <DD>
El trabajo y otras ocupaciones (principalmente <a href="http://www.debian.org/">Debian</a>) han hecho a este coordinador bastante más ocupado de lo estrictamente aceptable...siento todos los retrasos y correos sin responder. O:-) "Aprovechando" que he sufrido un accidente y estoy confinado en mi casa, estoy aprovechando para actualizar todo el árbol de documentación. El Configure.help está bastante actualizado, pero todavía no he conseguido que converja totalmente a la rama 2.4 del núcleo. En los próximos días liberaremos paquetes para las nuevas versiones del núcleo (especialmente ese 2.4.9 que anda dando vueltas ya durante un tiempo).

<DT>
<FONT COLOR="Orange">
<STRONG>1 de abril de 2001 </STRONG> </FONT>
</DT> <DD>
Justo cuando empezábamos a sentirnos cómodos con el 2.4.2 aparecen de pronto dos versiones nuevas del árbol oficial del núcleo: 2.4.3 y 2.2.19. Aprovechamos el fin de semana para ofrecer un nuevo paquete: <a href="ftp://nulies.hispalinux.es/pub/nulies/web/paquetes/NuLies-2.4.3-1.gz">NuLies-2.4.3-1.gz</a>. La traducción del menú de configuración continúa, además de tener traducidos el joystick.txt, gracias a Rubén Gómez Antolí, y el parport.txt, gracias a Alejandro.

<DT>
<FONT COLOR="Orange">
<STRONG>29 de marzo de 2001 </STRONG> </FONT>
</DT> <DD>
Por fin tenemos disponible un paquete para el núcleo 2.4.2. Este paquete por fin empieza a traducir parte del menú de configuración del núcleo, aunque tan sólo afecta a una pequeña parte de él. El aspecto general de la configuración es muchísimo mejor, y todos lo agradecerán. :-)

<DT>
<FONT COLOR="Orange">
<STRONG>7 de febrero de 2001 </STRONG> </FONT>
</DT> <DD>
Primeros cambios en el árbol de NuLies para el núcleo 2.4.2. Aún no hay disponible un paquete NuLies 2.4.2-1.

<DT>
<FONT COLOR="Orange">
<STRONG>30 de enero de 2001 </STRONG> </FONT>
</DT> <DD>
El núcleo 2.4.1 ya ha salido, así que es hora de actualizar un par de ficheros del árbol 2.4 y crear un paquete NuLies 2.4.1-1. Más información en la sección <a href="descargas.html">Descargas</a>.

<DT>
<FONT COLOR="Orange">
<STRONG>19 de enero de 2001 </STRONG> </FONT>
</DT> <DD>
He arreglado un &lt;/table&gt; al final de la p&aacute;gina. Parece ser que se me olvid&oacute; y los usuarios de Netscape no veían la tabla. Se me pas&oacute; porque yo uso <a href="http://www.mozilla.org/">Mozilla</a>, y parece que &eacute;l s&iacute; que lo ve bien.

<DT>
<FONT COLOR="Orange">
<STRONG>16 de enero de 2001 </STRONG> </FONT>
</DT> <DD>
Comienza una nueva andadura para NuLies (espero). En la barra de la derecha ir&aacute;n apareciendo enlaces a documentos relacionados con el n&uacute;cleo de Linux, pero <b>en español</b> (o <b>castellano</b>, lo mismo da). Hoy empezamos con la traducci&oacute;n del bolet&iacute;n <b>Kernel Traffic</b>, gracias a Cristian Oth&oacute;n Mart&iacute;nez Vera. Esperamos que NuLies se convierta en un lugar de paso de la comunidad hispanohablante que quiera informaci&oacute;n sobre el ping&uuml;ino de marras. :-)

<DT>
<FONT COLOR="Orange">
<STRONG>14 de enero de 2001 </STRONG> </FONT>
</DT> <DD>
¡Por fin tenemos de nuevo paquetes disponibles en NuLies! Los primeros son de la versi&oacute;n 2.4.0. Esperamos tener pronto un paquete para 2.2.18. La forma de instalaci&oacute;n ha cambiado. Por favor, lea los cambios que hay en la forma de <a href="descargas.html">instalaci&oacute;n de los paquetes</a>.

<DT>
<FONT COLOR="Orange">
<STRONG>11 de enero de 2001 </STRONG> </FONT>
</DT> <DD>
El fichero de <a href="cambios24.html">cambios para n&uacute;cleos 2.4</a> comienza su andadura. Ya son dos los ficheros en HTML en nuestra secci&oacute;n <i><a href="leerdoc.html">Documentaci&oacute;n en l&iacute;nea</a></i>.

<DT>
<FONT COLOR="Orange">
<STRONG>10 de enero de 2001 </STRONG> </FONT>
</DT> <DD>
Ahora que el núcleo 2.4 está por fin en la calle, aprovechamos para actualizar unos cuantos documentos. Esperamos que las herramientas de configuración y la ayuda de menuconfig estén cuanto antes traducidas de nuevo.

<DT>
<FONT COLOR="Orange">
<STRONG> 3 de enero de 2001 </STRONG> </FONT>
</DT> <DD>
El fichero <a href="2.4/Documentation/Changes">Changes</a> del &aacute;rbol 2.4 est&aacute; actualizado al &uacute;ltimo n&uacute;cleo disponible, el 2.4.0-test13-pre7. Los ficheros de sonido no est&aacute;n en el &aacute;rbol tan s&oacute;lo por culpa m&iacute;a, ya que su responsable me los mand&oacute; hace ya un tiempo. :-(

Por cierto...¡Feliz Año 2001! ;-)

<DT>
<FONT COLOR="Orange">
<STRONG> 13 de diciembre de 2000 </STRONG> </FONT>
</DT> <DD>
Ha salido una versión tanto de los núcleos estables como de los inestables. Las últimas versiones son 2.2.18 y 2.4.0-test12. Debido a las tremendas modificaciones que se han hecho en 2.2.18, las versiones de NuLies contra ese núcleo se retrasarán algo más de lo normal. El <a href="2.4/Documentation/Changes">Changes</a> de 2.4 está actualizado a la última versión.
 
<DT>
<FONT COLOR="Orange">
<STRONG> 13 de noviembre de 2000 </STRONG> </FONT>
</DT> <DD>
Hay un documento más en el árbol de 2.4 y también el joystick.txt del árbol de 2.2. Además, gracias a Carlos Perelló (que me avis&oacute;), resulta que la página de David Marín Carreño, el anterior responsable de NuLies, estaba equivocada. Es <a href="http://aspl-fact.sourceforge.net/">http://aspl-fact.sourceforge.net/</a>.<br>
En otro orden de cosas, resulta que los documentos no estaban sincronizados con las últimas versiones de los núcleos (es triste, pero real). Creo que a día de hoy (núcleo 2.2.17 y 2.4.0-test10) todos los documentos están actualizados, con la notable excepción de los de sonido, de los que espero que su responsable pronto me envíe la actualización.
  
<DT>
<FONT COLOR="Orange">
<STRONG> 9 de noviembre de 2000 </STRONG> </FONT>
</DT> <DD>
Cambios menores a todas las páginas del web. Se merecían una actualización.

<DT>
<FONT COLOR="Orange">
<STRONG> 7 de noviembre de 2000 </STRONG> </FONT>
</DT> <DD>
Incorporación del Configure.help para 2.2.17 y Changes de 2.4.0-test10.

<DT>
<FONT COLOR="Orange">
<STRONG> 31 de octubre de 2000 </STRONG> </FONT>
</DT> <DD>
El &aacute;rbol de documentos est&aacute; completamente separado ahora. Hay un &aacute;rbol para <a href="2.2/Documentation">2.2</a> y otro para <a href="2.4/Documentation">2.4</a>.

<DT>
<FONT COLOR="Orange">
<STRONG> 27 de octubre de 2000 </STRONG> </FONT>
</DT> <DD>
Ya hay un enlace al &aacute;rbol de desarrollo de Linux 2.4 en la secci&oacute;n <a href="leerdoc.html">Documentaci&oacute;n en l&iacute;nea</a>

<DT>
<FONT COLOR="Orange">
<STRONG> 26 de octubre de 2000 </STRONG> </FONT>
</DT> <DD>
Abrimos el &aacute;rbol del n&uacute;cleo 2.4 (a&uacute;n en fase de pruebas). Est&aacute; disponible el <a href="2.4/Documentation/Changes">Changes</a>. Se aceptan colaboraciones del &aacute;rbol a partir de este momento.

<DT>
<FONT COLOR="Orange">
<STRONG> 8 de septiembre de 2000 </STRONG> </FONT>
</DT> <DD>
David Marín Carreño abandona la coordinación de NuLiEs, pero es por una buena causa. Puedes visitar el proyecto ASPL, en el que está trabajando, en <a href="http://aspl-fact.sourceforge.net/">http://aspl-fact.sourceforge.net/</a>.<br>
En los próximos días habrá cambios de documentos. ¡Estamos muy desactualizados!

<DT>
<FONT COLOR="Orange">
<STRONG> 17 de mayo de 2000 </STRONG> </FONT>
</DT> <DD>
Estrenamos logotipo nuevo. ¡Esperamos que os guste más que el anterior! :-)

<DT>
<FONT COLOR="Orange"> 
<STRONG> 10 de mayo de 2000 </STRONG> </FONT>
</DT> <DD>
Cambios menores en el web. Actualización de enlaces, e inclusi&oacute;n de 
nuevos documentos.

<DT>
<FONT COLOR="Orange"> 
<STRONG> 19 de febrero de 2000 </STRONG> </FONT>
</DT> <DD>
Versión 4 de las rutinas de configuración del núcleo versión 2.2.14:
inclusión de nuevos documentos y depuración de errores.
</DD> 

<DT>
<FONT COLOR="Orange">
<STRONG> 3 de febrero de 2000 </STRONG>
</FONT>
</DT>
<DD>
Nueva versión de las rutinas de configuración para núcleo 2.2.14, con Menuconfig completamente traducido, gracias a <a href="mailto:a1402ARROBAserdis.dis.ulpgc.es">Ricardo Javier Cárdenes Medina</a>.
</DD>

<DT>
<FONT COLOR="Orange">
<STRONG>
9 de enero de 2000
</STRONG>
</FONT>
</DT>
<DD>
Ya está disponible para bajar la primera versión de desarrollo del programa Gconfig, la nueva herramienta gráfica de configuración del núcleo Linux. Descárguela desde 
<a href="descargas.html">aquí</a>.
</DD>


<DT>
<FONT COLOR="Orange">
<STRONG>
6 de enero de 2000
</STRONG>
</FONT>
</DT>
<DD>
Rutinas de configuración en castellano de núcleos 2.2.13 y 2.2.14 <a href="descargas.html">ya disponibles</a>.
</DD>

<DT>
<FONT COLOR="Orange">
<STRONG>
27 de diciembre de 1999
</STRONG>
</FONT>
</DT>
<DD>
Peque&ntilde;a modificaci&oacute;n: en la secci&oacute;n de documentaci&oacute;n en l&iacute;nea 
s&oacute;lo se leen los ficheros ya traducidos. <I> Bajo propuesta de <a href="mailto:enderARROBAadi.uam.es">
David Mart&iacute;nez Moreno</a></I>
</DD>


<DT>
<FONT COLOR="Orange">
<STRONG>
24 de diciembre de 1999
</STRONG>
</FONT>
</DT>
<DD>
Versi&oacute;n final de la traducci&oacute;n del fichero Configure.help para n&uacute;cleos
2.2.x ya disponible. Mantenida por <a href="mailto:davefxARROBAbigfoot.com">David Marín Carreño</a>
</DD>


<DT>
<FONT COLOR="Orange">
<STRONG>
2 de diciembre de 1999
</STRONG>
</FONT>
</DT>
<DD>
La nueva p&aacute;gina del proyecto NuLies se pone en marcha con un nuevo y mejorado diseño.
</DD>


</DL>
</FONT>
</FONT>
</body>
